# Ultralytics YOLOv8 🚀 Standard Mid-Fusion Paradigm (V8 version)
# YOLOMM RGB+X 标准中期融合 (V8 结构，C2f 主干) + v8Detect 头
# 核心策略: 双路独立到 P5 的骨干网 + P4/P5 双层融合 + 标准三尺度检测头
# 适用场景: 作为多模态检测通用基准，适合中高层特征互补的任务

# Parameters
nc: 80  # number of classes
scales:  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# P4/P5 双层融合架构（V8 版以 C2f 块为主）
backbone:
  # ========== RGB 路径 (0-9) - 到 P5 ==========
  - [-1, 1, Conv, [64, 3, 2], 'RGB']      # 0-P1/2 RGB起始
  - [-1, 1, Conv, [128, 3, 2]]            # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]            # 3-P3/8 (RGB_P3)
  - [-1, 6, C2f, [256, True]]             # 4
  - [-1, 1, Conv, [512, 3, 2]]            # 5-P4/16
  - [-1, 6, C2f, [512, True]]             # 6 (RGB_P4)
  - [-1, 1, Conv, [1024, 3, 2]]           # 7-P5/32
  - [-1, 3, C2f, [1024, True]]            # 8
  - [-1, 1, SPPF, [1024, 5]]              # 9 (RGB_P5)

  # ========== X 路径 (10-20) - 到 P5 ==========
  - [-1, 1, Conv, [64, 3, 2], 'X']        # 10-P1/2 X起始
  - [-1, 1, Conv, [128, 3, 2]]            # 11-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]            # 13-P3/8 (X_P3)
  - [-1, 6, C2f, [256, True]]             # 14
  - [-1, 1, Conv, [512, 3, 2]]            # 15-P4/16
  - [-1, 6, C2f, [512, True]]             # 16 (X_P4)
  - [-1, 1, Conv, [1024, 3, 2]]           # 17-P5/32
  - [-1, 3, C2f, [1024, True]]            # 18
  - [-1, 1, SPPF, [1024, 5]]              # 19 (X_P5)

  # ========== P4 与 P5 层级融合 ==========
  # P4 融合（RGB_P4 与 X_P4）
  - [[6, 16], 1, Concat, [1]]             # 20 P4融合: RGB_P4(6) + X_P4(16)
  - [-1, 3, C2f, [1024, True]]            # 21 (Fused_P4)

  # P5 融合（RGB_P5 与 X_P5）
  - [[9, 19], 1, Concat, [1]]             # 22 P5融合: RGB_P5(9) + X_P5(19)
  - [-1, 3, C2f, [1024, True]]            # 23 (Fused_P5)

# 标准 YOLOv8 检测头 (FPN + PAN)
head:
  # 自顶向下路径 (FPN)
  - [23, 1, nn.Upsample, [None, 2, "nearest"]]  # 24 Fused_P5 上采样
  - [[-1, 21], 1, Concat, [1]]                   # 25 连接 Fused_P4
  - [-1, 3, C2f, [512]]                          # 26

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 27
  - [[-1, 4], 1, Concat, [1]]                    # 28 连接 RGB_P3(4)
  - [-1, 3, C2f, [256]]                          # 29 (P3/8-small)

  # 自底向上路径 (PAN)
  - [-1, 1, Conv, [256, 3, 2]]                   # 30
  - [[-1, 26], 1, Concat, [1]]                   # 31
  - [-1, 3, C2f, [512]]                          # 32 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                   # 33
  - [[-1, 23], 1, Concat, [1]]                   # 34 连接 Fused_P5
  - [-1, 3, C2f, [1024]]                         # 35 (P5/32-large)

  - [[29, 32, 35], 1, v8Detect, [nc]]            # 36 v8Detect(P3, P4, P5)

