# Ultralytics YOLOv8 🚀 MultiModal Early Fusion Configuration
# YOLOMM RGB+X 二元模态早期融合（Dual 输入）+ v8Detect 头
# 策略：输入层直接融合 RGB(3ch)+X(Xch)=Dual(3+Xch)，默认 Xch=3 则为 6 通道

# Parameters
nc: 80  # number of classes
scales:  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# 多模态架构定义 - 通用 RGB+X 二元模态（早期融合）
# X 模态通道数由数据配置 dataset_config.Xch 指定（默认 3）

# Backbone（V8 结构，C2f 主干）
# [from, repeats, module, args, (optional multimodal-route)]
backbone:
  # P1/2 - 早期融合：直接处理 Dual 输入 (3+Xch)
  - [-1, 1, Conv, [64, 3, 2], 'Dual']   # 0-P1/2 (Dual -> 64)
  - [-1, 1, Conv, [128, 3, 2]]          # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]          # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]          # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]         # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]            # 9

# Head（标准 YOLOv8 检测头结构）
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]           # cat backbone P4
  - [-1, 3, C2f, [512]]                 # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]           # cat backbone P3
  - [-1, 3, C2f, [256]]                 # 15 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]          # cat head P4
  - [-1, 3, C2f, [512]]                 # 18 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]           # cat head P5
  - [-1, 3, C2f, [1024]]                # 21 (P5/32-large)

  - [[15, 18, 21], 1, v8Detect, [nc]]   # v8Detect(P3, P4, P5)
