# Ultralytics YOLOv8 MM Late Fusion Configuration
# YOLOMM RGB+X 晚期融合 (V8 结构，C2f 主干) + v8Detect 头
# 核心策略: 双路独立骨干 + 各自独立 FPN+PAN → P3/P4/P5 三层 Concat 融合 → 统一检测
# 适用场景: RGB和X模态特征差异大，需要完全独立的特征提取和检测路径

# Parameters
nc: 80  # number of classes
scales:  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# 双路径 backbone - RGB路径和X路径完全独立
backbone:
  # ========== RGB路径 (层0-9) - 完整V8骨干到P5 ==========
  - [-1, 1, Conv, [64, 3, 2], 'RGB']       # 0-P1/2 RGB路径起始
  - [-1, 1, Conv, [128, 3, 2]]             # 1-P2/4
  - [-1, 3, C2f, [128, True]]              # 2
  - [-1, 1, Conv, [256, 3, 2]]             # 3-P3/8 (RGB_P3)
  - [-1, 6, C2f, [256, True]]              # 4
  - [-1, 1, Conv, [512, 3, 2]]             # 5-P4/16
  - [-1, 6, C2f, [512, True]]              # 6 (RGB_P4)
  - [-1, 1, Conv, [1024, 3, 2]]            # 7-P5/32
  - [-1, 3, C2f, [1024, True]]             # 8
  - [-1, 1, SPPF, [1024, 5]]               # 9 (RGB_P5)

  # ========== X路径 (层10-19) - 完整V8骨干到P5 ==========
  - [-1, 1, Conv, [64, 3, 2], 'X']         # 10-P1/2 X路径起始
  - [-1, 1, Conv, [128, 3, 2]]             # 11-P2/4
  - [-1, 3, C2f, [128, True]]              # 12
  - [-1, 1, Conv, [256, 3, 2]]             # 13-P3/8 (X_P3)
  - [-1, 6, C2f, [256, True]]              # 14
  - [-1, 1, Conv, [512, 3, 2]]             # 15-P4/16
  - [-1, 6, C2f, [512, True]]              # 16 (X_P4)
  - [-1, 1, Conv, [1024, 3, 2]]            # 17-P5/32
  - [-1, 3, C2f, [1024, True]]             # 18
  - [-1, 1, SPPF, [1024, 5]]               # 19 (X_P5)

# 独立检测头 - RGB和X模态各自独立FPN+PAN，最后融合决策
head:
  # ========== RGB检测分支 (层20-31) ==========
  - [9, 1, nn.Upsample, [None, 2, "nearest"]]    # 20 从RGB backbone P5
  - [[-1, 6], 1, Concat, [1]]                    # 21 cat RGB backbone P4
  - [-1, 3, C2f, [512]]                          # 22

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 23
  - [[-1, 4], 1, Concat, [1]]                    # 24 cat RGB backbone P3
  - [-1, 3, C2f, [256]]                          # 25 (RGB P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]                   # 26
  - [[-1, 22], 1, Concat, [1]]                   # 27 cat RGB head P4
  - [-1, 3, C2f, [512]]                          # 28 (RGB P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                   # 29
  - [[-1, 9], 1, Concat, [1]]                    # 30 cat RGB backbone P5
  - [-1, 3, C2f, [1024]]                         # 31 (RGB P5/32-large)

  # ========== X模态检测分支 (层32-43) ==========
  - [19, 1, nn.Upsample, [None, 2, "nearest"]]   # 32 从X backbone P5
  - [[-1, 16], 1, Concat, [1]]                   # 33 cat X backbone P4
  - [-1, 3, C2f, [512]]                          # 34

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 35
  - [[-1, 14], 1, Concat, [1]]                   # 36 cat X backbone P3
  - [-1, 3, C2f, [256]]                          # 37 (X P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]                   # 38
  - [[-1, 34], 1, Concat, [1]]                   # 39 cat X head P4
  - [-1, 3, C2f, [512]]                          # 40 (X P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                   # 41
  - [[-1, 19], 1, Concat, [1]]                   # 42 cat X backbone P5
  - [-1, 3, C2f, [1024]]                         # 43 (X P5/32-large)

  # ========== 多模态融合 + 检测 ==========
  - [[25, 37], 1, Concat, [1]]                   # 44 融合P3
  - [[28, 40], 1, Concat, [1]]                   # 45 融合P4
  - [[31, 43], 1, Concat, [1]]                   # 46 融合P5
  - [[44, 45, 46], 1, v8Detect, [nc]]            # 47 v8Detect(P3, P4, P5)
