# Ultralytics YOLOMM - MROD-YOLO Complete Architecture
# 论文: MROD-YOLO: Multimodal Joint Representation for Small Object Detection
#       in Remote Sensing Imagery via Multiscale Iterative Aggregation
# 来源: IEEE TGRS 2025
#
# 核心特点:
# 1. MJRNet 早期融合: 在 backbone 入口使用 GCB 进行多模态融合
# 2. RFEM 感受野扩展: 在 SPPF 前动态调整感受野
# 3. MSIA 多尺度聚合: 在 backbone-neck 连接处进行迭代特征聚合
# 4. FPN 替代 PANet: 简化特征流，保留小目标敏感特征
#
# 重要提示:
# 使用此配置训练时必须关闭 AMP (自动混合精度)，否则可能出现 NaN loss
# 训练示例: model.train(data='xxx.yaml', amp=False, ...)

nc: 80
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # ========== MJRNet 早期融合入口 ==========
  # 两个模态各自经过初始卷积，然后通过 MJRNet 融合
  - [-1, 1, Conv, [64, 3, 2], 'RGB']           # 0-P1/2 RGB 初始卷积
  - [-1, 1, Conv, [64, 3, 2], 'X']             # 1-P1/2 X 初始卷积
  - [[0, 1], 1, MJRNet, [64, 16]]              # 2 MJRNet 早期融合 -> 单路特征

  # ========== 融合后单路 Backbone ==========
  - [-1, 1, Conv, [128, 3, 2]]                 # 3-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]          # 4
  - [-1, 1, Conv, [256, 3, 2]]                 # 5-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]          # 6 (P3 特征)
  - [-1, 1, Conv, [512, 3, 2]]                 # 7-P4/16
  - [-1, 2, C3k2, [512, True]]                 # 8 (P4 特征)
  - [-1, 1, Conv, [1024, 3, 2]]                # 9-P5/32
  - [-1, 2, C3k2, [1024, True]]                # 10

  # ========== RFEM 感受野扩展 ==========
  - [-1, 1, RFEM, [1024]]                      # 11 RFEM 动态感受野

  # ========== SPPF + C2PSA ==========
  - [-1, 1, SPPF, [1024, 5]]                   # 12
  - [-1, 2, C2PSA, [1024]]                     # 13 (P5 特征)

  # ========== MSIA 多尺度聚合 ==========
  # P4-P5 聚合：需要先上采样 P5 到 P4 尺寸
  - [13, 1, nn.Upsample, [None, 2, "nearest"]] # 14 P5 上采样
  - [-1, 1, Conv, [512, 1, 1]]                 # 15 通道对齐到 P4
  - [[8, 15], 1, MSIA, [512]]                  # 16 MSIA(P4, P5_up) -> Fused_P4

  # P3-P4 聚合：需要先上采样 Fused_P4 到 P3 尺寸
  - [16, 1, nn.Upsample, [None, 2, "nearest"]] # 17 Fused_P4 上采样
  - [-1, 1, Conv, [512, 1, 1]]                 # 18 通道对齐到 P3 (512*width=128)
  - [[6, 18], 1, MSIA, [512]]                  # 19 MSIA(P3, P4_up) -> Fused_P3

head:
  # ========== FPN 自顶向下路径（替代 PANet）==========
  # 论文设计：使用 FPN 替代 PANet，简化特征流
  - [19, 2, C3k2, [256, False]]                # 20 P3/8 精炼 (小目标检测)

  - [16, 2, C3k2, [512, False]]                # 21 P4/16 精炼 (中目标检测)

  - [13, 2, C3k2, [1024, True]]                # 22 P5/32 精炼 (大目标检测)

  # ========== 检测头 ==========
  - [[20, 21, 22], 1, Detect, [nc]]            # 23 Detect(P3, P4, P5)
