# Ultralytics YOLOMM Mid-Fusion with LoGStem2x (Conv 替换测试版)
# YOLOMM RGB+X 中期融合范式 - LoGStem2x 替换中间层 Conv 测试
# 核心策略: 使用 LoGStem2x 替代中间层的标准 Conv，实现边缘增强
# 设计原则: LoGStem2x 基于高斯-拉普拉斯算子，2x 下采样，可替代 Conv 实现边缘增强
# 适用场景: 测试 LoGStem2x 在中间层的边缘增强效果

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# P4/P5双层融合架构 (LoGStem2x 替换中间层下采样 Conv)
backbone:
  # ========== RGB路径 (层0-10) ==========
  - [-1, 1, Conv, [64, 3, 2], 'RGB']       # 0-P1/2 RGB路径起始
  - [-1, 1, LoGStem2x, [128]]              # 1-P2/4 用 LoGStem2x 替换下采样 Conv
  - [-1, 2, C3k2, [256, False, 0.25]]      # 2
  - [-1, 1, LoGStem2x, [256]]              # 3-P3/8 用 LoGStem2x 替换下采样 Conv
  - [-1, 2, C3k2, [512, False, 0.25]]      # 4 (RGB_P3)
  - [-1, 1, LoGStem2x, [512]]              # 5-P4/16 用 LoGStem2x 替换下采样 Conv
  - [-1, 2, C3k2, [512, True]]             # 6 (RGB_P4)
  - [-1, 1, LoGStem2x, [1024]]             # 7-P5/32 用 LoGStem2x 替换下采样 Conv
  - [-1, 2, C3k2, [1024, True]]            # 8
  - [-1, 1, SPPF, [1024, 5]]               # 9
  - [-1, 2, C2PSA, [1024]]                 # 10 (RGB_P5)

  # ========== X路径 (层11-21) - 标准 Conv 路径 ==========
  - [-1, 1, Conv, [64, 3, 2], 'X']         # 11-P1/2 X路径起始
  - [-1, 1, Conv, [128, 3, 2]]             # 12-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]      # 13
  - [-1, 1, Conv, [256, 3, 2]]             # 14-P3/8 (X_P3)
  - [-1, 2, C3k2, [512, False, 0.25]]      # 15
  - [-1, 1, Conv, [512, 3, 2]]             # 16-P4/16
  - [-1, 2, C3k2, [512, True]]             # 17 (X_P4)
  - [-1, 1, Conv, [1024, 3, 2]]            # 18-P5/32
  - [-1, 2, C3k2, [1024, True]]            # 19
  - [-1, 1, SPPF, [1024, 5]]               # 20
  - [-1, 2, C2PSA, [1024]]                 # 21 (X_P5)

  # ========== P4和P5层级融合 ==========
  # P4级融合
  - [[6, 17], 1, Concat, [1]]              # 22 P4融合: RGB_P4(6) + X_P4(17)
  - [-1, 2, C3k2, [1024, True]]            # 23 (Fused_P4)

  # P5级融合
  - [[10, 21], 1, Concat, [1]]             # 24 P5融合: RGB_P5(10) + X_P5(21)
  - [-1, 2, C3k2, [1024, True]]            # 25
  - [-1, 1, C2PSA, [1024]]                 # 26 (Fused_P5)

# 标准YOLOv11检测头 (Neck + Head)
head:
  # 自顶向下路径 (FPN)
  - [26, 1, nn.Upsample, [None, 2, "nearest"]]  # 27 Fused_P5上采样
  - [[-1, 23], 1, Concat, [1]]                  # 28 连接Fused_P4
  - [-1, 2, C3k2, [512, False]]                 # 29

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 30
  - [[-1, 4], 1, Concat, [1]]                   # 31 连接RGB_P3(4)
  - [-1, 2, C3k2, [256, False]]                 # 32 (P3/8-small)

  # 自底向上路径 (PAN)
  - [-1, 1, Conv, [256, 3, 2]]                  # 33
  - [[-1, 29], 1, Concat, [1]]                  # 34
  - [-1, 2, C3k2, [512, False]]                 # 35 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                  # 36
  - [[-1, 26], 1, Concat, [1]]                  # 37
  - [-1, 2, C3k2, [1024, True]]                 # 38 (P5/32-large)

  - [[32, 35, 38], 1, Detect, [nc]]             # 39 Detect(P3, P4, P5)
