# Test 3: LoGStem2x as first layer + full X path + Concat
nc: 80
scales:
  n: [0.50, 0.25, 1024]

backbone:
  - [-1, 1, LoGStem2x, [64], 'RGB']   # 0
  - [-1, 2, C3k2, [256, False, 0.25]]     # 1
  - [-1, 1, Conv, [256, 3, 2]]            # 2
  - [-1, 2, C3k2, [512, False, 0.25]]     # 3
  - [-1, 1, Conv, [512, 3, 2]]            # 4
  - [-1, 2, C3k2, [512, True]]            # 5
  - [-1, 1, Conv, [1024, 3, 2]]           # 6
  - [-1, 2, C3k2, [1024, True]]           # 7
  - [-1, 1, SPPF, [1024, 5]]              # 8
  - [-1, 2, C2PSA, [1024]]                # 9

  - [-1, 1, Conv, [64, 3, 2], 'X']        # 10
  - [-1, 1, Conv, [128, 3, 2]]            # 11
  - [-1, 2, C3k2, [256, False, 0.25]]     # 12
  - [-1, 1, Conv, [256, 3, 2]]            # 13
  - [-1, 2, C3k2, [512, False, 0.25]]     # 14
  - [-1, 1, Conv, [512, 3, 2]]            # 15
  - [-1, 2, C3k2, [512, True]]            # 16
  - [-1, 1, Conv, [1024, 3, 2]]           # 17
  - [-1, 2, C3k2, [1024, True]]           # 18
  - [-1, 1, SPPF, [1024, 5]]              # 19
  - [-1, 2, C2PSA, [1024]]                # 20

  - [[5, 16], 1, Concat, [1]]             # 21
  - [-1, 2, C3k2, [1024, True]]           # 22

  - [[9, 20], 1, Concat, [1]]            # 23
  - [-1, 2, C3k2, [1024, True]]           # 24
  - [-1, 1, C2PSA, [1024]]                # 25

head:
  - [25, 1, nn.Upsample, [None, 2, "nearest"]]  # 26
  - [[-1, 22], 1, Concat, [1]]                  # 27
  - [-1, 2, C3k2, [512, False]]                 # 28

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 29
  - [[-1, 2], 1, Concat, [1]]                   # 30
  - [-1, 2, C3k2, [256, False]]                 # 31

  - [[31], 1, Detect, [nc]]
