# Ultralytics YOLOMM Mid-Fusion with LoGStem
# YOLOMM RGB+X 中期融合范式 - LoGStem 增强版
# 核心策略: RGB 路径使用 LoGStem 替代标准 Conv 作为起始层
# 设计原则: LoGStem 基于高斯-拉普拉斯算子，4x 下采样，可替代 Conv 实现边缘增强
# 适用场景: 需要强边缘感知的视觉任务

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# P4/P5双层融合架构 (LoGStem 作为起始层，4x下采样)
backbone:
  # ========== RGB路径 (层0-9) - LoGStem 起始 ==========
  - [-1, 1, LoGStem, [64], 'RGB']         # 0-P2/4 RGB路径起始, 输出 [B, 64, H/4, W/4]
  - [-1, 2, C3k2, [256, False, 0.25]]     # 1 (RGB_P2)
  - [-1, 1, Conv, [256, 3, 2]]            # 2-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]     # 3 (RGB_P3)
  - [-1, 1, Conv, [512, 3, 2]]            # 4-P4/16
  - [-1, 2, C3k2, [512, True]]            # 5 (RGB_P4)
  - [-1, 1, Conv, [1024, 3, 2]]           # 6-P5/32
  - [-1, 2, C3k2, [1024, True]]           # 7
  - [-1, 1, SPPF, [1024, 5]]              # 8
  - [-1, 2, C2PSA, [1024]]                # 9 (RGB_P5)

  # ========== X路径 (层10-20) - 标准 Conv 路径 ==========
  - [-1, 1, Conv, [64, 3, 2], 'X']        # 10-P1/2 X路径起始
  - [-1, 1, Conv, [128, 3, 2]]            # 11-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]     # 12
  - [-1, 1, Conv, [256, 3, 2]]            # 13-P3/8 (X_P3)
  - [-1, 2, C3k2, [512, False, 0.25]]     # 14
  - [-1, 1, Conv, [512, 3, 2]]            # 15-P4/16
  - [-1, 2, C3k2, [512, True]]            # 16 (X_P4)
  - [-1, 1, Conv, [1024, 3, 2]]           # 17-P5/32
  - [-1, 2, C3k2, [1024, True]]           # 18
  - [-1, 1, SPPF, [1024, 5]]              # 19
  - [-1, 2, C2PSA, [1024]]                # 20 (X_P5)

  # ========== P4和P5层级融合 ==========
  # P4级融合
  - [[5, 16], 1, Concat, [1]]             # 21 P4融合: RGB_P4(5) + X_P4(16)
  - [-1, 2, C3k2, [1024, True]]           # 22 (Fused_P4)

  # P5级融合
  - [[9, 20], 1, Concat, [1]]             # 23 P5融合: RGB_P5(9) + X_P5(20)
  - [-1, 2, C3k2, [1024, True]]           # 24
  - [-1, 1, C2PSA, [1024]]                # 25 (Fused_P5)

# 标准YOLOv11检测头 (Neck + Head)
head:
  # 自顶向下路径 (FPN)
  - [25, 1, nn.Upsample, [None, 2, "nearest"]]  # 26 Fused_P5上采样
  - [[-1, 22], 1, Concat, [1]]                  # 27 连接Fused_P4
  - [-1, 2, C3k2, [512, False]]                 # 28

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 29
  - [[-1, 3], 1, Concat, [1]]                   # 30 连接RGB_P3(3)
  - [-1, 2, C3k2, [256, False]]                 # 31 (P3/8-small)

  # 自底向上路径 (PAN)
  - [-1, 1, Conv, [256, 3, 2]]                  # 32
  - [[-1, 28], 1, Concat, [1]]                  # 33
  - [-1, 2, C3k2, [512, False]]                 # 34 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                  # 35
  - [[-1, 25], 1, Concat, [1]]                  # 36
  - [-1, 2, C3k2, [1024, True]]                 # 37 (P5/32-large)

  - [[31, 34, 37], 1, Detect, [nc]]             # 38 Detect(P3, P4, P5)
