# Ultralytics YOLOMM - Mid-Fusion with RFEM
# 目的：在中期融合架构中验证 RFEM 感受野扩展能力
# 基于：yolo11n-mm-mid.yaml
# 变更：在双路 backbone 的 SPPF 前各添加 RFEM 模块
#
# 重要提示:
# 使用此配置训练时必须关闭 AMP (自动混合精度)，否则可能出现 NaN loss
# 训练示例: model.train(data='xxx.yaml', amp=False, ...)

nc: 80
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # ========== RGB路径 (层0-11) - 添加 RFEM ==========
  - [-1, 1, Conv, [64, 3, 2], 'RGB']      # 0-P1/2 RGB路径起始
  - [-1, 1, Conv, [128, 3, 2]]            # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]     # 2
  - [-1, 1, Conv, [256, 3, 2]]            # 3-P3/8 (RGB_P3)
  - [-1, 2, C3k2, [512, False, 0.25]]     # 4
  - [-1, 1, Conv, [512, 3, 2]]            # 5-P4/16
  - [-1, 2, C3k2, [512, True]]            # 6 (RGB_P4)
  - [-1, 1, Conv, [1024, 3, 2]]           # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]           # 8
  - [-1, 1, RFEM, [1024]]                 # 9 RFEM 感受野扩展
  - [-1, 1, SPPF, [1024, 5]]              # 10
  - [-1, 2, C2PSA, [1024]]                # 11 (RGB_P5)

  # ========== X路径 (层12-23) - 添加 RFEM ==========
  - [-1, 1, Conv, [64, 3, 2], 'X']        # 12-P1/2 X路径起始
  - [-1, 1, Conv, [128, 3, 2]]            # 13-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]     # 14
  - [-1, 1, Conv, [256, 3, 2]]            # 15-P3/8 (X_P3)
  - [-1, 2, C3k2, [512, False, 0.25]]     # 16
  - [-1, 1, Conv, [512, 3, 2]]            # 17-P4/16
  - [-1, 2, C3k2, [512, True]]            # 18 (X_P4)
  - [-1, 1, Conv, [1024, 3, 2]]           # 19-P5/32
  - [-1, 2, C3k2, [1024, True]]           # 20
  - [-1, 1, RFEM, [1024]]                 # 21 RFEM 感受野扩展
  - [-1, 1, SPPF, [1024, 5]]              # 22
  - [-1, 2, C2PSA, [1024]]                # 23 (X_P5)

  # ========== P4和P5层级融合 ==========
  # P4级融合
  - [[6, 18], 1, Concat, [1]]             # 24 P4融合: RGB_P4(6) + X_P4(18)
  - [-1, 2, C3k2, [1024, True]]           # 25 (Fused_P4)

  # P5级融合
  - [[11, 23], 1, Concat, [1]]            # 26 P5融合: RGB_P5(11) + X_P5(23)
  - [-1, 2, C3k2, [1024, True]]           # 27
  - [-1, 1, C2PSA, [1024]]                # 28 (Fused_P5)

head:
  # 自顶向下路径 (FPN)
  - [28, 1, nn.Upsample, [None, 2, "nearest"]]  # 29 Fused_P5上采样
  - [[-1, 25], 1, Concat, [1]]                  # 30 连接Fused_P4
  - [-1, 2, C3k2, [512, False]]                 # 31

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 32
  - [[-1, 4], 1, Concat, [1]]                   # 33 连接RGB_P3(4)
  - [-1, 2, C3k2, [256, False]]                 # 34 (P3/8-small)

  # 自底向上路径 (PAN)
  - [-1, 1, Conv, [256, 3, 2]]                  # 35
  - [[-1, 31], 1, Concat, [1]]                  # 36
  - [-1, 2, C3k2, [512, False]]                 # 37 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                  # 38
  - [[-1, 28], 1, Concat, [1]]                  # 39
  - [-1, 2, C3k2, [1024, True]]                 # 40 (P5/32-large)

  - [[34, 37, 40], 1, Detect, [nc]]             # 41 Detect(P3, P4, P5)
