# Ultralytics YOLOMM with C3k2_RVB_SE
# 使用RepViTBlock（带SE）的C3k2变体
# 适用场景: 带SE注意力的重参数化ViT场景

# Parameters
nc: 80  # number of classes
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# 中期融合架构 - 使用C3k2_RVB_SE替换标准C3k2
backbone:
  # RGB路径
  - [-1, 1, Conv, [64, 3, 2], 'RGB']       # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]             # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]      # 2
  - [-1, 1, Conv, [256, 3, 2]]             # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]      # 4
  - [-1, 1, Conv, [512, 3, 2]]             # 5-P4/16
  - [-1, 2, C3k2_RVB_SE, [512, True]]    # 6 使用C3k2_RVB_SE
  - [-1, 1, Conv, [1024, 3, 2]]            # 7-P5/32
  - [-1, 2, C3k2_RVB_SE, [1024, True]]   # 8 使用C3k2_RVB_SE
  - [-1, 1, SPPF, [1024, 5]]               # 9
  - [-1, 2, C2PSA, [1024]]                 # 10 (RGB_P5)

  # X路径
  - [-1, 1, Conv, [64, 3, 2], 'X']         # 11-P1/2
  - [-1, 1, Conv, [128, 3, 2]]             # 12-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]      # 13
  - [-1, 1, Conv, [256, 3, 2]]             # 14-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]      # 15
  - [-1, 1, Conv, [512, 3, 2]]             # 16-P4/16
  - [-1, 2, C3k2_RVB_SE, [512, True]]    # 17 使用C3k2_RVB_SE
  - [-1, 1, Conv, [1024, 3, 2]]            # 18-P5/32
  - [-1, 2, C3k2_RVB_SE, [1024, True]]   # 19 使用C3k2_RVB_SE
  - [-1, 1, SPPF, [1024, 5]]               # 20
  - [-1, 2, C2PSA, [1024]]                 # 21 (X_P5)

  # P4/P5融合
  - [[6, 17], 1, Concat, [1]]              # 22 P4融合
  - [-1, 2, C3k2_RVB_SE, [1024, True]]   # 23 使用C3k2_RVB_SE
  - [[10, 21], 1, Concat, [1]]             # 24 P5融合
  - [-1, 2, C3k2_RVB_SE, [1024, True]]   # 25 使用C3k2_RVB_SE
  - [-1, 1, C2PSA, [1024]]                 # 26

head:
  - [26, 1, nn.Upsample, [None, 2, "nearest"]]  # 27
  - [[-1, 23], 1, Concat, [1]]                  # 28
  - [-1, 2, C3k2, [512, False]]                 # 29
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 30
  - [[-1, 4], 1, Concat, [1]]                   # 31
  - [-1, 2, C3k2, [256, False]]                 # 32
  - [-1, 1, Conv, [256, 3, 2]]                  # 33
  - [[-1, 29], 1, Concat, [1]]                  # 34
  - [-1, 2, C3k2, [512, False]]                 # 35
  - [-1, 1, Conv, [512, 3, 2]]                  # 36
  - [[-1, 26], 1, Concat, [1]]                  # 37
  - [-1, 2, C3k2_RVB_SE, [1024, True]]       # 38 使用C3k2_RVB_SE
  - [[32, 35, 38], 1, Detect, [nc]]             # 39
