# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-r18 MultiModal Mid-level Fusion model (mm-mid-c2f-eblock)

nc: 80
scales:
  l: [1.00, 1.00, 1024]

backbone:
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu'], 'RGB']
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']]
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']]
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]]

  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu'], 'X']
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']]
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']]
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]]

  - [3, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']]
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']]
  - [7, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']]
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']]

  - [[9, 11], 1, Concat, [1]]
  - [-1, 1, Conv, [256, 1, 1]]

  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']]
  - [-1, 1, Blocks, [512, BasicBlock, 2, 5, 'relu']]
  - [-1, 1, C2f_EBlock, [512]]

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]
  - [-1, 1, AIFI, [1024, 8]]
  - [-1, 1, Conv, [256, 1, 1]]

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [14, 1, Conv, [256, 1, 1, None, 1, 1, False]]
  - [[-2, -1], 1, Concat, [1]]
  - [-1, 3, RepC3, [256, 0.5]]
  - [-1, 1, Conv, [256, 1, 1]]

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [13, 1, Conv, [256, 1, 1, None, 1, 1, False]]
  - [[-2, -1], 1, Concat, [1]]
  - [-1, 3, RepC3, [256, 0.5]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 23], 1, Concat, [1]]
  - [-1, 3, RepC3, [256, 0.5]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 18], 1, Concat, [1]]
  - [-1, 3, RepC3, [256, 0.5]]

  - [[27, 30, 33], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]

