# RT-DETR-r18 MM: SwinTransformer-Tiny 单模块多输出主干（入口含输入投影 Conv：Dual->3ch）

nc: 80
scales:
  l: [1.00, 1.00, 1024]

backbone:
  - [-1, 1, SwinTransformer_Tiny, [], 'Dual']  # 4

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]
  - [-1, 1, AIFI, [1024, 8]]
  - [-1, 1, Conv, [256, 1, 1]]

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [3, 1, Conv, [256, 1, 1, None, 1, 1, False]]
  - [[-2, -1], 1, Concat, [1]]
  - [-1, 3, RepC3, [256, 0.5]]
  - [-1, 1, Conv, [256, 1, 1]]

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [2, 1, Conv, [256, 1, 1, None, 1, 1, False]]
  - [[-2, -1], 1, Concat, [1]]
  - [-1, 3, RepC3, [256, 0.5]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, RepC3, [256, 0.5]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 7], 1, Concat, [1]]
  - [-1, 3, RepC3, [256, 0.5]]

  - [[16, 19, 22], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]

