# RT-DETR-r18 MultiModal Mid-level Fusion with TSA (TokenSelectiveAttention)
# 对应 YOLOMM: yolo11n-mm-mid-tsa（融合后 P4/P5 使用 TSA，需确保 C 可被 num_heads 与 group 整除）

nc: 80
scales:
  l: [1.00, 1.00, 1024]

backbone:
  # RGB/X branches to P3
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu'], 'RGB']
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']]
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']]
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]]

  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu'], 'X']
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']]
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']]
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]]

  - [3, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']]
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']]  # 9 RGB P3
  - [7, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']]
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']]  # 11 X P3

  # P3 fusion → 256
  - [[9, 11], 1, Concat, [1]]
  - [-1, 1, Conv, [256, 1, 1]]  # 13 fused P3

  # P4/P5 TSA
  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']]  # 14 P4
  - [-1, 1, Blocks, [512, BasicBlock, 2, 5, 'relu']]  # 15 P5
  - [14, 1, TokenSelectiveAttention, [8, 0.8, 4]]  # 16 P4-TSA
  - [15, 1, TokenSelectiveAttention, [8, 0.8, 4]]  # 17 P5-TSA

head:
  - [17, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 18 input_proj.2
  - [-1, 1, AIFI, [1024, 8]]  # 19
  - [-1, 1, Conv, [256, 1, 1]]  # 20

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 21
  - [16, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 22 input_proj.1
  - [[-2, -1], 1, Concat, [1]]  # 23
  - [-1, 3, RepC3, [256, 0.5]]  # 24
  - [-1, 1, Conv, [256, 1, 1]]  # 25

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 26
  - [13, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 27 input_proj.0
  - [[-2, -1], 1, Concat, [1]]  # 28
  - [-1, 3, RepC3, [256, 0.5]]  # 29

  - [-1, 1, Conv, [256, 3, 2]]  # 30
  - [[-1, 25], 1, Concat, [1]]  # 31
  - [-1, 3, RepC3, [256, 0.5]]  # 32

  - [-1, 1, Conv, [256, 3, 2]]  # 33
  - [[-1, 20], 1, Concat, [1]]  # 34
  - [-1, 3, RepC3, [256, 0.5]]  # 35

  - [[29, 32, 35], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]  # 36
