# RT-DETR-r18 MultiModal Mid-level Fusion (DEA-style)
# 对应 YOLOMM: yolo11n-deyolo（双路 + DEA 跨模态注意；此处在 P3 处应用 DEA）

nc: 80
scales:
  l: [1.00, 1.00, 1024]

backbone:
  # RGB/X to P3
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu'], 'RGB']
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']]
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']]
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]]

  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu'], 'X']
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']]
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']]
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]]

  - [3, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']]   # 8
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']]  # 9 RGB P3
  - [7, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']]    # 10
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']]  # 11 X P3

  # DEA at P3 (dual-input → single-output), kernel_size=40, reduction=16
  - [[9, 11], 1, DEA, [null, 40, null, null, 16]]  # 12 DEA fused P3-like
  - [-1, 1, Conv, [256, 1, 1]]     # 13 ensure 256

  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']] # 14 P4
  - [-1, 1, Blocks, [512, BasicBlock, 2, 5, 'relu']] # 15 P5

head:
  - [15, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 16 input_proj.2
  - [-1, 1, AIFI, [1024, 8]]  # 17
  - [-1, 1, Conv, [256, 1, 1]]  # 18

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 19
  - [14, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 20 input_proj.1
  - [[-2, -1], 1, Concat, [1]]  # 21
  - [-1, 3, RepC3, [256, 0.5]]  # 22
  - [-1, 1, Conv, [256, 1, 1]]  # 23

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 24
  - [13, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 25 input_proj.0
  - [[-2, -1], 1, Concat, [1]]  # 26
  - [-1, 3, RepC3, [256, 0.5]]  # 27

  - [-1, 1, Conv, [256, 3, 2]]  # 28
  - [[-1, 23], 1, Concat, [1]]  # 29
  - [-1, 3, RepC3, [256, 0.5]]  # 30

  - [-1, 1, Conv, [256, 3, 2]]  # 31
  - [[-1, 18], 1, Concat, [1]]  # 32
  - [-1, 3, RepC3, [256, 0.5]]  # 33

  - [[27, 30, 33], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]] # 34
