# 模型名: rtdetr-mm-DFGF-r18-UAVNeck.yaml
# 核心架构: R18主干 + 原版跨尺度频域引导融合 + 动态频域感知上下采样颈部 (DySample + FFDS)

nc: 80 # number of classes
scales: 
  l: [1.00, 1.00, 1024]

backbone:
  # ==================== RGB 路径 (R18) ====================
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu'], 'RGB'] 
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']] 
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']] 
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]] 
  
  - [-1, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']]          # 4
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']]         # 5-P3/8
  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']]         # 6-P4/16
  - [-1, 1, Blocks, [512, BasicBlock, 2, 5, 'relu']]         # 7-P5/32

  # ==================== IR 路径 (R18) ====================
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu'], 'X'] 
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']] 
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']] 
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]] 
  
  - [-1, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']]          # 12
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']]         # 13-P3/8
  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']]         # 14-P4/16
  - [-1, 1, Blocks, [512, BasicBlock, 2, 5, 'relu']]         # 15-P5/32

  # ==================== 原版跨尺度频域引导融合 (DFGF) ====================
  - [[7, 15], 1, SymmetricFreqGuidedFusion, [512, False]]    # 16: RGB_P5 + IR_P5
  - [-1, 1, C2PSA, [512]]                                    # 17: Fused_P5

  - [[6, 15], 1, DecoupledFreqGuidedFusion, [256, False]]    # 18: RGB_P4 + IR_P5 (非对称)
  - [[5, 14], 1, DecoupledFreqGuidedFusion, [128, False]]    # 19: RGB_P3 + IR_P4 (非对称)

head:
  # ==================== RT-DETR Decoder ====================
  - [17, 1, Conv, [256, 1, 1, None, 1, 1, False]]            # 20: 引入 Fused_P5 投影
  - [-1, 1, AIFI, [1024, 8]]                                 # 21
  - [-1, 1, Conv, [256, 1, 1]]                               # 22: Y5

  # ==================== FPN (Top-down) 动态上采样 ====================
  # 【修改 1】：引入 DySample 替换掉死板的 nn.Upsample
  - [-1, 1, DySample, [2, 'lp']]                             # 23: Y5 动态上采样
  - [18, 1, Conv, [256, 1, 1, None, 1, 1, False]]            # 24: 引入 Fused_P4 投影
  - [[-2, -1], 1, Concat, [1]]                               # 25
  - [-1, 3, RepC3, [256, 0.5]]                               # 26: fpn_blocks.0
  - [-1, 1, Conv, [256, 1, 1]]                               # 27: Y4

  # 【修改 2】：引入 DySample
  - [-1, 1, DySample, [2, 'lp']]                             # 28: Y4 动态上采样
  - [19, 1, Conv, [256, 1, 1, None, 1, 1, False]]            # 29: 引入 Fused_P3 投影
  - [[-2, -1], 1, Concat, [1]]                               # 30
  - [-1, 3, RepC3, [256, 0.5]]                               # 31: X3 (P3尺度最终特征)

  # ==================== PAN (Bottom-up) 频域聚焦下采样 ====================
  # 【修改 3】：引入 FrequencyFocusedDownSampling 替换会导致小目标丢失的普通 Conv
  - [-1, 1, FrequencyFocusedDownSampling, [256]]             # 32: X3 频域感知下采样
  - [[-1, 27], 1, Concat, [1]]                               # 33: 拼接 Y4
  - [-1, 3, RepC3, [256, 0.5]]                               # 34: F4

  # 【修改 4】：引入 FrequencyFocusedDownSampling
  - [-1, 1, FrequencyFocusedDownSampling, [256]]             # 35: F4 频域感知下采样
  - [[-1, 22], 1, Concat, [1]]                               # 36: 拼接 Y5
  - [-1, 3, RepC3, [256, 0.5]]                               # 37: F5

  - [[31, 34, 37], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]] # 38: 检测头