# Ultralytics YOLOMM 🚀 RT-DETR with Bi-Focus Asymmetric Fusion (提点版)
# 核心提升：P5-P3 全线升级为 BiFocus 竞争机制，配合跨尺度红外先验引导

nc: 80 
scales:
  l: [1.00, 1.00, 1024]

backbone:
  # ==================== RGB 路径 (ResNet50) ====================
  - [-1, 1, ResNetLayer, [3, 64, 1, True, 1], 'RGB']    # 0: stem
  - [-1, 1, ResNetLayer, [64, 64, 1, False, 3]]         # 1: layer1 (P2)
  - [-1, 1, ResNetLayer, [256, 128, 2, False, 4]]       # 2: layer2 (RGB_P3)
  - [-1, 1, ResNetLayer, [512, 256, 2, False, 6]]       # 3: layer3 (RGB_P4)
  - [-1, 1, ResNetLayer, [1024, 512, 2, False, 3]]      # 4: layer4 (RGB_P5)

  # ==================== IR 路径 (ResNet50) ====================
  - [-1, 1, ResNetLayer, [3, 64, 1, True, 1], 'X']      # 5: stem
  - [-1, 1, ResNetLayer, [64, 64, 1, False, 3]]         # 6: layer1 (P2)
  - [-1, 1, ResNetLayer, [256, 128, 2, False, 4]]       # 7: layer2 (IR_P3) -> 后续抛弃
  - [-1, 1, ResNetLayer, [512, 256, 2, False, 6]]       # 8: layer3 (IR_P4)
  - [-1, 1, ResNetLayer, [1024, 512, 2, False, 3]]      # 9: layer4 (IR_P5)

  # ==================== BiFocus 竞争融合层 ====================
  
  # P5 顶层: 语义级模态竞争 [RGB_P5(4), IR_P5(9)]
  - [[4, 9], 1, DFGF_BiFocus, [512, False]]            # 10: Fused_P5
  - [-1, 1, C2PSA, [512]]                               # 11: 增强全局依赖

  # P4 融合 (跨尺度引导): [RGB_P4(3), IR_P5(9)]
  # 用最强的 IR 语义引导 P4 空间特征
  - [[3, 9], 1, DFGF_BiFocus, [256, False]]             # 12: Fused_P4

  # P3 融合 (跨尺度引导): [RGB_P3(2), IR_P4(8)]
  # 拿 P4 的红外显著性去“点亮” P3 的高分辨率细节
  - [[2, 8], 1, DFGF_BiFocus, [128, False]]             # 13: Fused_P3

# ==================== RT-DETR Head ====================
head:
  # P5 尺度 (AIFI)
  - [10, 1, Conv, [256, 1, 1, None, 1, 1, False]]       # 14
  - [-1, 1, AIFI, [1024, 8]]                            # 15
  - [-1, 1, Conv, [256, 1, 1]]                          # 16: Y5

  # FPN Top-down 语义下传
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]          # 17
  - [12, 1, Conv, [256, 1, 1, None, 1, 1, False]]       # 18
  - [[-2, -1], 1, Concat, [1]]                          # 19
  - [-1, 3, RepC3, [256, 0.5]]                          # 20: Y4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]          # 21
  - [13, 1, Conv, [256, 1, 1, None, 1, 1, False]]       # 22
  - [[-2, -1], 1, Concat, [1]]                          # 23
  - [-1, 3, RepC3, [256, 0.5]]                          # 24: X3

  # PAN Bottom-up 空间回传
  - [-1, 1, Conv, [256, 3, 2]]                          # 25
  - [[-1, 20], 1, Concat, [1]]                          # 26
  - [-1, 3, RepC3, [256, 0.5]]                          # 27: F4

  - [-1, 1, Conv, [256, 3, 2]]                          # 28
  - [[-1, 16], 1, Concat, [1]]                          # 29
  - [-1, 3, RepC3, [256, 0.5]]                          # 30: F5

  # 最终检测头：使用 600 Queries 压榨性能
  - [[24, 27, 30], 1, RTDETRDecoder, [nc, 256, 600, 4, 8, 3]] # 31