# Ultralytics YOLOMM 🚀 RT-DETR with Deep_CFFM Asymmetric Fusion (R50 旗舰精简版)
# 核心架构: 深层语义主干 + 跨尺度红外频域先验引导 + 移除 C2PSA 直连 AIFI

nc: 80 # number of classes
scales:
  l: [1.00, 1.00, 1024]

backbone:
  # ==================== RGB 路径 (ResNet50) ====================
  - [-1, 1, ResNetLayer, [3, 64, 1, True, 1], 'RGB']    # 0: stem
  - [-1, 1, ResNetLayer, [64, 64, 1, False, 3]]         # 1: layer1 (P2)
  - [-1, 1, ResNetLayer, [256, 128, 2, False, 4]]       # 2: layer2 (RGB_P3) 提取
  - [-1, 1, ResNetLayer, [512, 256, 2, False, 6]]       # 3: layer3 (RGB_P4) 提取
  - [-1, 1, ResNetLayer, [1024, 512, 2, False, 3]]      # 4: layer4 (RGB_P5) 提取

  # ==================== X 路径 (红外/深度) ====================
  - [-1, 1, ResNetLayer, [3, 64, 1, True, 1], 'X']      # 5: stem
  - [-1, 1, ResNetLayer, [64, 64, 1, False, 3]]         # 6: layer1 (P2)
  - [-1, 1, ResNetLayer, [256, 128, 2, False, 4]]       # 7: layer2 (IR_P3) 抛弃
  - [-1, 1, ResNetLayer, [512, 256, 2, False, 6]]       # 8: layer3 (IR_P4) 提取
  - [-1, 1, ResNetLayer, [1024, 512, 2, False, 3]]      # 9: layer4 (IR_P5) 提取

  # ==================== 频域引导融合 (Deep_CFFM) ====================
  
  # P5 顶层: 对称融合 [RGB_P5(4), IR_P5(9)]
  # 直连 AIFI，确保高阶频域特征无损耗
  - [[4, 9], 1, Deep_CFFM, [512, False]]        # 10: Fused_P5

  # P4 中层融合: 跨尺度 [RGB_P4(3), IR_P5(9)]
  - [[3, 9], 1, Deep_CFFM, [256, False]]        # 11: Fused_P4

  # P3 底层融合: 跨尺度 [RGB_P3(2), IR_P4(8)]
  # 极其关键：这是高分辨率小目标层，开启 Refiner (True)
  - [[2, 8], 1, Deep_CFFM, [128, True]]         # 12: Fused_P3

# ==================== RT-DETR 专属 Transformer 检测头 ====================
head:
  # ============ P5 尺度 (AIFI) ============
  - [10, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 13: 引入 Fused_P5(10)
  - [-1, 1, AIFI, [1024, 8]]                       # 14: Transformer Encoder
  - [-1, 1, Conv, [256, 1, 1]]                     # 15: Y5

  # ============ FPN (Top-down) ============
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]     # 16: Y5 上采样
  - [11, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 17: 引入跨尺度 Fused_P4(11)
  - [[-2, -1], 1, Concat, [1]]                     # 18
  - [-1, 3, RepC3, [256, 0.5]]                     # 19: fpn_blocks.0
  - [-1, 1, Conv, [256, 1, 1]]                     # 20: Y4

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]     # 21: Y4 上采样
  - [12, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 22: 引入跨尺度 Fused_P3(12)
  - [[-2, -1], 1, Concat, [1]]                     # 23
  - [-1, 3, RepC3, [256, 0.5]]                     # 24: X3 (P3尺度最终特征)

  # ============ PAN (Bottom-up) ============
  - [-1, 1, Conv, [256, 3, 2]]                     # 25: downsample P3
  - [[-1, 20], 1, Concat, [1]]                     # 26: 连接 Y4(20)
  - [-1, 3, RepC3, [256, 0.5]]                     # 27: F4

  - [-1, 1, Conv, [256, 3, 2]]                     # 28: downsample P4
  - [[-1, 15], 1, Concat, [1]]                     # 29: 连接 Y5(15)
  - [-1, 3, RepC3, [256, 0.5]]                     # 30: F5

  # 端到端检测，索引更新为 [24, 27, 30]
  # 提示：如果在小目标数据集上，考虑将 300 改为 600
  - [[24, 27, 30], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]] # 31