# 模型名: rtdetr-mm-DFGF-r18-FocusBypass.yaml
# 单一变量: 增加 Focus 高频旁路替代 RGB_P3，保持融合模块的原版全非对称逻辑不变

nc: 80 
scales:
  l: [1.00, 1.00, 1024]

backbone:
  # ==================== RGB 路径 (R18) ====================
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu'], 'RGB'] 
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']]        
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']]        # 2 (★ 旁路提取起点 ★)
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]]                               

  - [-1, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']]                # 4 
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']]               # 5 (原 RGB_P3，此实验中被旁路顶替)
  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']]               # 6-P4/16 (RGB_P4)
  - [-1, 1, Blocks, [512, BasicBlock, 2, 5, 'relu']]               # 7-P5/32 (RGB_P5)

  # ==================== IR 路径 (R18) ====================
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu'], 'X']   
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']]        
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']]        
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]]                               

  - [-1, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']]                # 12
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']]               # 13-P3/8
  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']]               # 14-P4/16 (IR_P4，用于引导)
  - [-1, 1, Blocks, [512, BasicBlock, 2, 5, 'relu']]               # 15-P5/32 (IR_P5)

  # ==================== ★ 单一变量：添加 Focus 直通旁路 ★ ====================
  - [2, 1, Focus, [64, 1]]                                         # 16: -> 160x160
  - [-1, 1, Focus, [128, 1]]                                       # 17: -> 80x80 (提取出无损旁路 Bypass_P3)

  # ==================== 维持原版 DFGF 融合逻辑 (0修改) ====================
  - [[7, 15], 1, SymmetricFreqGuidedFusion, [512, False]]          # 18: RGB_P5 + IR_P5
  - [-1, 1, C2PSA, [512]]                                          # 19: Fused_P5

  - [[6, 15], 1, DecoupledFreqGuidedFusion, [256, False]]          # 20: RGB_P4 + IR_P5

  # 【唯一修改处】：依然使用原版跨尺度融合 (IR_P4 引导 RGB)，但用无损的 Bypass_P3(17) 替换了 RGB_P3(5)
  - [[17, 14], 1, DecoupledFreqGuidedFusion, [128, False]]         # 21: Bypass_P3 + IR_P4 -> Fused_P3

head:
  # ==================== 检测头路由索引顺延更新 ====================
  - [19, 1, Conv, [256, 1, 1, None, 1, 1, False]]                  # 22
  - [-1, 1, AIFI, [1024, 8]]                                       # 23
  - [-1, 1, Conv, [256, 1, 1]]                                     # 24: Y5

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]                     # 25
  - [20, 1, Conv, [256, 1, 1, None, 1, 1, False]]                  # 26
  - [[-2, -1], 1, Concat, [1]]                                     # 27
  - [-1, 3, RepC3, [256, 0.5]]                                     # 28
  - [-1, 1, Conv, [256, 1, 1]]                                     # 29: Y4

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]                     # 30
  - [21, 1, Conv, [256, 1, 1, None, 1, 1, False]]                  # 31
  - [[-2, -1], 1, Concat, [1]]                                     # 32
  - [-1, 3, RepC3, [256, 0.5]]                                     # 33: X3 

  - [-1, 1, Conv, [256, 3, 2]]                                     # 34
  - [[-1, 29], 1, Concat, [1]]                                     # 35
  - [-1, 3, RepC3, [256, 0.5]]                                     # 36: F4

  - [-1, 1, Conv, [256, 3, 2]]                                     # 37
  - [[-1, 24], 1, Concat, [1]]                                     # 38
  - [-1, 3, RepC3, [256, 0.5]]                                     # 39: F5

  - [[33, 36, 39], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]      # 40