# Ultralytics YOLOMM 🚀 RT-DETR with Bi-Focus Asymmetric Fusion (R18 高效提点版)
# 核心策略：全线 BiFocus 竞争机制 + 跨尺度语义对齐 (IR_P5->RGB_P4, IR_P4->RGB_P3)

nc: 80 
scales:
  l: [1.00, 1.00, 1024]

backbone:
  # ==================== RGB 路径 (ResNet18) ====================
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu'], 'RGB'] # 0-P1/2
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']]        # 1
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']]        # 2
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]]                               # 3-P2/4

  - [-1, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']]                # 4
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']]               # 5-RGB_P3 (128 ch)
  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']]               # 6-RGB_P4 (256 ch)
  - [-1, 1, Blocks, [512, BasicBlock, 2, 5, 'relu']]               # 7-RGB_P5 (512 ch)

  # ==================== IR 路径 (ResNet18) ====================
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu'], 'X']   # 8-P1/2
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']]        # 9
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']]        # 10
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]]                               # 11-P2/4

  - [-1, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']]                # 12
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']]               # 13-IR_P3 (抛弃)
  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']]               # 14-IR_P4 (256 ch)
  - [-1, 1, Blocks, [512, BasicBlock, 2, 5, 'relu']]               # 15-IR_P5 (512 ch)

  # ==================== BiFocus 竞争融合层 ====================
  
  # P5 顶层融合: [RGB_P5(7), IR_P5(15)]
  - [[7, 15], 1, DFGF_BiFocus, [512, False]]            # 16: Fused_P5
  - [-1, 1, C2PSA, [512]]                               # 17

  # P4 非对称融合 (跨尺度): [RGB_P4(6), IR_P5(15)]
  # 逻辑：利用深层红外语义引导 P4 特征提取
  - [[6, 15], 1, DFGF_BiFocus, [256, False]]             # 18: Fused_P4

  # P3 非对称融合 (跨尺度): [RGB_P3(5), IR_P4(14)]
  # 逻辑：利用 P4 的热异常先验“点亮” P3 的高分辨率细节
  - [[5, 14], 1, DFGF_BiFocus, [128, False]]             # 19: Fused_P3

# ==================== RT-DETR Head ====================
head:
  # P5 尺度 (AIFI)
  - [17, 1, Conv, [256, 1, 1, None, 1, 1, False]]       # 20
  - [-1, 1, AIFI, [1024, 8]]                            # 21
  - [-1, 1, Conv, [256, 1, 1]]                          # 22: Y5

  # FPN Top-down
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]          # 23
  - [18, 1, Conv, [256, 1, 1, None, 1, 1, False]]       # 24
  - [[-2, -1], 1, Concat, [1]]                          # 25
  - [-1, 3, RepC3, [256, 0.5]]                          # 26: Y4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]          # 27
  - [19, 1, Conv, [256, 1, 1, None, 1, 1, False]]       # 28
  - [[-2, -1], 1, Concat, [1]]                          # 29
  - [-1, 3, RepC3, [256, 0.5]]                          # 30: X3

  # PAN Bottom-up
  - [-1, 1, Conv, [256, 3, 2]]                          # 31
  - [[-1, 26], 1, Concat, [1]]                          # 32
  - [-1, 3, RepC3, [256, 0.5]]                          # 33: F4

  - [-1, 1, Conv, [256, 3, 2]]                          # 34
  - [[-1, 22], 1, Concat, [1]]                          # 35
  - [-1, 3, RepC3, [256, 0.5]]                          # 36: F5

  # 最终检测头
  - [[30, 33, 36], 1, RTDETRDecoder, [nc, 256, 600, 4, 8, 3]] # 37