# Ultralytics YOLOMM 🚀 RT-DETR + IAF_FFCM_Fusion + P2小目标增强 (R50版)

nc: 80 
scales:
  l: [1.00, 1.00, 1024]

backbone:
  # ==================== RGB 路径 (ResNet50) ====================
  - [-1, 1, ResNetLayer, [3, 64, 1, True, 1], 'RGB']    # 0: stem
  - [-1, 1, ResNetLayer, [64, 64, 1, False, 3]]         # 1: layer1 (RGB_P2) 【新增提取】
  - [-1, 1, ResNetLayer, [256, 128, 2, False, 4]]       # 2: layer2 (RGB_P3)
  - [-1, 1, ResNetLayer, [512, 256, 2, False, 6]]       # 3: layer3 (RGB_P4)
  - [-1, 1, ResNetLayer, [1024, 512, 2, False, 3]]      # 4: layer4 (RGB_P5)

  # ==================== IR 路径 (ResNet50) ====================
  - [-1, 1, ResNetLayer, [3, 64, 1, True, 1], 'X']      # 5: stem
  - [-1, 1, ResNetLayer, [64, 64, 1, False, 3]]         # 6: layer1 (IR_P2) 【新增提取】
  - [-1, 1, ResNetLayer, [256, 128, 2, False, 4]]       # 7: layer2 (IR_P3)
  - [-1, 1, ResNetLayer, [512, 256, 2, False, 6]]       # 8: layer3 (IR_P4)
  - [-1, 1, ResNetLayer, [1024, 512, 2, False, 3]]      # 9: layer4 (IR_P5)

  # ==================== 光照感知频域融合 (IAF_FFCM) ====================
  - [[4, 9], 1, IAF_FFCM_Fusion, [512]]   # 10: Fused_P5
  - [-1, 1, C2PSA, [512]]                 # 11: C2PSA
  - [[3, 8], 1, IAF_FFCM_Fusion, [256]]   # 12: Fused_P4
  - [[2, 7], 1, IAF_FFCM_Fusion, [128]]   # 13: Fused_P3
  - [[1, 6], 1, IAF_FFCM_Fusion, [64]]    # 14: Fused_P2 (极高分辨率)

# ==================== 四层特征增强 Neck & Decoder ====================
head:
  # P5
  - [11, 1, Conv, [256, 1, 1, None, 1, 1, False]]   # 15
  - [-1, 1, AIFI, [1024, 8]]                        # 16
  - [-1, 1, Conv, [256, 1, 1]]                      # 17: Y5

  # FPN Top-down
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]      # 18
  - [12, 1, Conv, [256, 1, 1, None, 1, 1, False]]   # 19 (导入 P4)
  - [[-2, -1], 1, Concat, [1]]                      # 20
  - [-1, 3, RepC3, [256, 0.5]]                      # 21
  - [-1, 1, Conv, [256, 1, 1]]                      # 22: Y4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]      # 23
  - [13, 1, Conv, [256, 1, 1, None, 1, 1, False]]   # 24 (导入 P3)
  - [[-2, -1], 1, Concat, [1]]                      # 25
  - [-1, 3, RepC3, [256, 0.5]]                      # 26
  - [-1, 1, Conv, [256, 1, 1]]                      # 27: Y3

  # 高分辨率触底
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]      # 28
  - [14, 1, Conv, [256, 1, 1, None, 1, 1, False]]   # 29 (导入 P2)
  - [[-2, -1], 1, Concat, [1]]                      # 30
  - [-1, 3, RepC3, [256, 0.5]]                      # 31: Y2 (满载小目标高频信息)

  # PAN Bottom-up
  - [-1, 1, Conv, [256, 3, 2]]                      # 32 (下采样 Y2)
  - [[-1, 27], 1, Concat, [1]]                      # 33 (拼接 Y3)
  - [-1, 3, RepC3, [256, 0.5]]                      # 34: F3 (Decoder Layer 1)

  - [-1, 1, Conv, [256, 3, 2]]                      # 35
  - [[-1, 22], 1, Concat, [1]]                      # 36 (拼接 Y4)
  - [-1, 3, RepC3, [256, 0.5]]                      # 37: F4 (Decoder Layer 2)

  - [-1, 1, Conv, [256, 3, 2]]                      # 38
  - [[-1, 17], 1, Concat, [1]]                      # 39 (拼接 Y5)
  - [-1, 3, RepC3, [256, 0.5]]                      # 40: F5 (Decoder Layer 3)

  # 检测头
  - [[34, 37, 40], 1, RTDETRDecoder, [nc, 256, 600, 4, 8, 3]] # 41