# Ultralytics YOLOMM 🚀 RT-DETR-ResNet50 with HeavyDFGF
# 专治 AttributeError: type object 'Bottleneck'
# 采用官方 ResNetLayer 构建双轨 R50 主干，结合重型窗口注意力融合极小目标

nc: 80 
scales: 
  l: [1.00, 1.00, 1024]

backbone:
  # ==================== RGB 路径 (ResNet50) ====================
  - [-1, 1, ResNetLayer, [3, 64, 1, True, 1], 'RGB']    # 0: stem
  - [-1, 1, ResNetLayer, [64, 64, 1, False, 3]]         # 1: layer1 (P2)
  - [-1, 1, ResNetLayer, [256, 128, 2, False, 4]]       # 2: layer2 (RGB_P3, 512 channels)
  - [-1, 1, ResNetLayer, [512, 256, 2, False, 6]]       # 3: layer3 (RGB_P4, 1024 channels)
  - [-1, 1, ResNetLayer, [1024, 512, 2, False, 3]]      # 4: layer4 (RGB_P5, 2048 channels)

  # ==================== IR 路径 (ResNet50) ====================
  - [-1, 1, ResNetLayer, [3, 64, 1, True, 1], 'X']      # 5: stem
  - [-1, 1, ResNetLayer, [64, 64, 1, False, 3]]         # 6: layer1 (P2)
  - [-1, 1, ResNetLayer, [256, 128, 2, False, 4]]       # 7: layer2 (IR_P3, 512 channels)
  - [-1, 1, ResNetLayer, [512, 256, 2, False, 6]]       # 8: layer3 (IR_P4, 1024 channels)
  - [-1, 1, ResNetLayer, [1024, 512, 2, False, 3]]      # 9: layer4 (IR_P5, 2048 channels)

  # ==================== HeavyDFGF 尺度感知融合 ====================
  # R50 的通道数巨大，我们在这里通过 hidden_channels 进行合理降维，防止 OOM
  - [[4, 9], 1, HeavyDFGF, [512, False]]       # 10: Fused_P5 (语义交互)
  - [[3, 8], 1, HeavyDFGF, [256, False]]       # 11: Fused_P4 (语义交互)
  # P3 层对于 R50 有 512 个通道，为了保留高频细节，我们将隐藏层设为 256 (之前 R18 是 128)
  - [[2, 7], 1, HeavyDFGF, [256, True]]        # 12: Fused_P3 (小目标纯净保真直连)

# ==================== RT-DETR Head (完美复刻官方 R50 拓扑) ====================
head:
  # P5 尺度 (AIFI)
  - [10, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 13: 接入 Fused_P5(10)
  - [-1, 1, AIFI, [1024, 8]]                      # 14
  - [-1, 1, Conv, [256, 1, 1]]                    # 15: Y5

  # FPN Top-down
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 16
  - [11, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 17: 接入 Fused_P4(11)
  - [[-2, -1], 1, Concat, [1]]                    # 18
  - [-1, 3, RepC3, [256]]                         # 19
  - [-1, 1, Conv, [256, 1, 1]]                    # 20: Y4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 21
  - [12, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 22: 接入 Fused_P3(12)
  - [[-2, -1], 1, Concat, [1]]                    # 23
  - [-1, 3, RepC3, [256]]                         # 24: X3 (极其重要的小目标层)

  # PAN Bottom-up
  - [-1, 1, Conv, [256, 3, 2]]                    # 25: 下采样 P3
  - [[-1, 20], 1, Concat, [1]]                    # 26: 拼接 Y4
  - [-1, 3, RepC3, [256]]                         # 27: F4

  - [-1, 1, Conv, [256, 3, 2]]                    # 28: 下采样 P4
  - [[-1, 15], 1, Concat, [1]]                    # 29: 拼接 Y5
  - [-1, 3, RepC3, [256]]                         # 30: F5

  # 【核心提分点】 传入融合后的三层特征，并将 Query 数提升至 600
  - [[24, 27, 30], 1, RTDETRDecoder, [nc, 256, 600, 4, 8, 3]] # 31