# Ultralytics YOLOMM 🚀 RT-DETR with LAG-Fusion (Local-Anomaly Guided Fusion)
# SCI 核心贡献: Scale-Aware Routing & Grid-Free Energy Injection
#   - 顶层 (P5) & 中层 (P4): 跨尺度语义增强 + 可变形空间对齐 (Semantic Alignment)
#   - 底层 (P3): 严格同尺度 + 局部热异常无网格注入 (Spatial Fidelity & Zero-Loss Injection)

# Parameters
nc: 80 # number of classes
scales:
  l: [1.00, 1.00, 1024]

backbone:
  # ==================== RGB 路径 (层 0-7) ====================
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu'], 'RGB'] # 0-P1/2
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']]        # 1
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']]        # 2
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]]                               # 3-P2/4

  - [-1, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']]                # 4
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']]               # 5-P3/8 (RGB_P3) 提取
  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']]               # 6-P4/16 (RGB_P4) 提取
  - [-1, 1, Blocks, [512, BasicBlock, 2, 5, 'relu']]               # 7-P5/32 (RGB_P5) 提取

  # ==================== X 路径 (红外/深度) (层 8-15) ====================
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu'], 'X']   # 8-P1/2
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']]        # 9
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']]        # 10
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]]                               # 11-P2/4

  - [-1, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']]                # 12
  # 【绝对保留】：提取红外 P3 特征，这是小目标的“生命线”
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']]               # 13-P3/8 (X_P3) 提取！
  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']]               # 14-P4/16 (X_P4) 提取
  - [-1, 1, Blocks, [512, BasicBlock, 2, 5, 'relu']]               # 15-P5/32 (X_P5) 提取

  # ==================== 尺度感知路由网络 (Scale-Aware Routing) ====================
  
  # 【P5 顶层融合】：重全局语义。这里你可以继续用你之前的对称模块，或者统一用 LAGFusion。
  # 为了代码简洁，统一调用 LAGFusion，大目标模式 (tiny_mode=False)。
  - [[7, 15], 1, HeavyDFGF, [512, False]]                       # 16: RGB_P5 + IR_P5 (大目标)
  - [-1, 1, C2PSA, [512]]                                       # 17: Fused_P5

  # 【P4 中层融合】：跨尺度语义增强。
  # 逻辑：拿高语义、低分辨率的 IR_P5(15) 引导高分辨率 RGB_P4(6)。
  # 参数 [256, False] -> 开启形变卷积对齐 (Deformable Alignment)，平滑大目标边缘。
  - [[6, 15], 1, HeavyDFGF, [256, False]]                       # 18: Fused_P4 (中/大目标)

  # 【P3 底层融合 - SCI 核心突破点】：同尺度绝对保真。
  # 逻辑：严格使用同尺度的 IR_P3(13) 与 RGB_P3(5) 融合，杜绝跨尺度带来的分辨率落差。
  # 参数 [128, True] -> 开启 tiny_mode=True！彻底关闭形变卷积，激活无网格热异常注入 (Grid-Free Injection)。
  - [[5, 13], 1, HeavyDFGF, [128, True]]                        # 19: Fused_P3 (小目标专属)

# RT-DETR 专属 Transformer 检测头 (Neck + Decoder)
head:
  # ============ P5 尺度 (AIFI) ============
  - [17, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 20: 引入 Fused_P5(17) 投影
  - [-1, 1, AIFI, [1024, 8]]                       # 21: AIFI
  - [-1, 1, Conv, [256, 1, 1]]                     # 22: Y5

  # ============ FPN (Top-down) 语义下传 ============
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]     # 23: Y5 上采样
  - [18, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 24: 引入跨尺度对齐的 Fused_P4(18)
  - [[-2, -1], 1, Concat, [1]]                     # 25:
  - [-1, 3, RepC3, [256, 0.5]]                     # 26: fpn_blocks.0
  - [-1, 1, Conv, [256, 1, 1]]                     # 27: Y4

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]     # 28: Y4 上采样
  - [19, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 29: 引入无损保真的 Fused_P3(19)
  - [[-2, -1], 1, Concat, [1]]                     # 30:
  - [-1, 3, RepC3, [256, 0.5]]                     # 31: X3 (极其重要：此时的特征图上，小目标热点完好无损！)

  # ============ PAN (Bottom-up) 空间特征回传 ============
  - [-1, 1, Conv, [256, 3, 2]]                     # 32: downsample P3
  - [[-1, 27], 1, Concat, [1]]                     # 33:
  - [-1, 3, RepC3, [256, 0.5]]                     # 34: F4

  - [-1, 1, Conv, [256, 3, 2]]                     # 35: downsample P4
  - [[-1, 22], 1, Concat, [1]]                     # 36:
  - [-1, 3, RepC3, [256, 0.5]]                     # 37: F5

  # 【冲刺高 AP 的秘诀】：将初始 Query 数量从 300 提升到 600，保证小目标不被初筛淘汰！
  - [[31, 34, 37], 1, RTDETRDecoder, [nc, 256, 600, 4, 8, 3]] # 38