# Ultralytics YOLOMM 🚀 RT-DETR Asymmetric Frequency-Guided Fusion (EFv2-S2)
# 核心策略: 红外网络(EFS2)前置，RGB网络后置，特征在融合层汇聚
# 注意: efficientformerv2_s2 作为第0层时，框架对后续所有层索引+4偏移
#       yaml中的 from 字段必须使用偏移后的真实索引

nc: 80
scales:
  l: [1.00, 1.00, 1024]

backbone:
  # ==================== 1. X 路径 (红外, 置于第0层) ====================
  # 层0 → 真实索引4, 输出列表[P2(32c), P3(64c), P4(144c), P5(288c)]
  - [-1, 1, efficientformerv2_s0, [], 'X']

  # 层1 → 真实索引5: X_P3 (64c, H/8)
  - [4,  1, GetIndex, [48,  1]]
  # 层2 → 真实索引6: X_P4 (144c, H/16)
  - [4,  1, GetIndex, [96, 2]]
  # 层3 → 真实索引7: X_P5 (288c, H/32)
  - [4,  1, GetIndex, [176, 3]]

  # ==================== 2. RGB 路径 (可见光主干) ====================
  # 层4 → 真实索引8
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu'], 'RGB']
  # 层5 → 真实索引9
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']]
  # 层6 → 真实索引10
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']]
  # 层7 → 真实索引11
  - [-1, 1, nn.MaxPool2d,  [3, 2, 1]]

  # 层8 → 真实索引12
  - [-1, 1, Blocks, [64,  BasicBlock, 2, 2, 'relu']]
  # 层9 → 真实索引13: RGB_P3 (128c, H/8)
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']]
  # 层10 → 真实索引14: RGB_P4 (256c, H/16)
  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']]
  # 层11 → 真实索引15: RGB_P5 (512c, H/32)
  - [-1, 1, Blocks, [512, BasicBlock, 2, 5, 'relu']]

  # ==================== 3. 非对称跨尺度频域引导融合 ====================
  # 层12 → 真实索引16: P5对称融合 RGB_P5(索引15,512c) + IR_P5(索引7,288c)
  - [[15, 7], 1, SymmetricFreqGuidedFusion,       [512]]
  # 层13 → 真实索引17: C2PSA精炼 (512c→512c)
  - [-1,      1, C2PSA,                           [512]]
  # 层14 → 真实索引18: P4跨尺度融合 RGB_P4(索引14,256c) + IR_P5(索引7,288c)
  - [[14, 7], 1, DecoupledFreqGuidedFusion_trans,  [256]]
  # 层15 → 真实索引19: P3跨尺度融合 RGB_P3(索引13,128c) + IR_P4(索引6,144c)
  - [[13, 6], 1, DecoupledFreqGuidedFusion_trans,  [128]]

head:
  # ============ P5尺度 (AIFI) ============
  # 引入 Fused_P5(真实索引17) 投影到256c
  - [17, 1, Conv,        [256, 1, 1, None, 1, 1, False]]  # 层16 → 真实索引20
  - [-1, 1, AIFI,        [1024, 8]]                        # 层17 → 真实索引21
  - [-1, 1, Conv,        [256, 1, 1]]                      # 层18 → 真实索引22: Y5

  # ============ FPN Top-down ============
  - [-1,      1, nn.Upsample, [None, 2, 'nearest']]        # 层19 → 真实索引23: Y5上采样
  # 引入 Fused_P4(真实索引18) 投影到256c
  - [18,      1, Conv,        [256, 1, 1, None, 1, 1, False]]  # 层20 → 真实索引24
  - [[-2, -1], 1, Concat,     [1]]                         # 层21 → 真实索引25
  - [-1,       3, RepC3,      [256, 0.5]]                  # 层22 → 真实索引26: fpn_P4
  - [-1,       1, Conv,       [256, 1, 1]]                 # 层23 → 真实索引27: Y4

  - [-1,      1, nn.Upsample, [None, 2, 'nearest']]        # 层24 → 真实索引28: Y4上采样
  # 引入 Fused_P3(真实索引19) 投影到256c
  - [19,      1, Conv,        [256, 1, 1, None, 1, 1, False]]  # 层25 → 真实索引29
  - [[-2, -1], 1, Concat,     [1]]                         # 层26 → 真实索引30
  - [-1,       3, RepC3,      [256, 0.5]]                  # 层27 → 真实索引31: X3 (P3最终特征)

  # ============ PAN Bottom-up ============
  - [-1,       1, Conv,       [256, 3, 2]]                 # 层28 → 真实索引32: downsample P3
  - [[-1, 27], 1, Concat,     [1]]                         # 层29 → 真实索引33
  - [-1,       3, RepC3,      [256, 0.5]]                  # 层30 → 真实索引34: F4

  - [-1,       1, Conv,       [256, 3, 2]]                 # 层31 → 真实索引35: downsample P4
  - [[-1, 22], 1, Concat,     [1]]                         # 层32 → 真实索引36
  - [-1,       3, RepC3,      [256, 0.5]]                  # 层33 → 真实索引37: F5

  # ============ RT-DETR Decoder ============
  - [[31, 34, 37], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]  # 层34 → 真实索引38