# Ultralytics YOLOMM 🚀 RT-DETR with Deep_CFFM Asymmetric Fusion (R18 精简版)
# 核心架构: 跨尺度红外频域先验引导 + 移除 C2PSA 直接接入 AIFI

nc: 80 # number of classes
scales:
  l: [1.00, 1.00, 1024]

backbone:
  # ==================== RGB 路径 (ResNet18) ====================
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu'], 'RGB'] # 0-P1/2
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']]        # 1
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']]        # 2
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]]                               # 3-P2/4

  - [-1, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']]                # 4
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']]               # 5-P3/8 (RGB_P3) 提取
  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']]               # 6-P4/16 (RGB_P4) 提取
  - [-1, 1, Blocks, [512, BasicBlock, 2, 5, 'relu']]               # 7-P5/32 (RGB_P5) 提取

  # ==================== X 路径 (红外/深度) ====================
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu'], 'X']   # 8-P1/2
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']]        # 9
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']]        # 10
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]]                               # 11-P2/4

  - [-1, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']]                # 12
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']]               # 13-P3/8 (X_P3) 抛弃
  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']]               # 14-P4/16 (X_P4) 提取
  - [-1, 1, Blocks, [512, BasicBlock, 2, 5, 'relu']]               # 15-P5/32 (X_P5) 提取

  # ==================== 频域引导融合 (Deep_CFFM) ====================
  
  # P5 顶层: 对称融合 [RGB_P5, IR_P5]
  # 【注】：删除了 17 层的 C2PSA，特征极其纯净，准备直接交给 AIFI
  - [[7, 15], 1, Deep_CFFM, [512, False]]       # 16: Fused_P5

  # P4 中层融合: [RGB_P4, IR_P5]
  - [[6, 15], 1, Deep_CFFM, [256, False]]       # 17: Fused_P4

  # P3 底层融合: [RGB_P3, IR_P4]
  # 极其关键：开启 Refiner (True) 处理高分辨率边缘
  - [[5, 14], 1, Deep_CFFM, [128, True]]        # 18: Fused_P3
  
# ==================== RT-DETR 专属 Transformer 检测头 ====================
head:
  # ============ P5 尺度 (AIFI) ============
  - [16, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 19: 直接引入 Fused_P5(16) 投影
  - [-1, 1, AIFI, [1024, 8]]                       # 20: Transformer Encoder 处理全局依赖
  - [-1, 1, Conv, [256, 1, 1]]                     # 21: Y5

  # ============ FPN (Top-down) ============
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]     # 22: Y5 上采样
  - [17, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 23: 引入跨尺度 Fused_P4(17)
  - [[-2, -1], 1, Concat, [1]]                     # 24
  - [-1, 3, RepC3, [256, 0.5]]                     # 25: fpn_blocks.0
  - [-1, 1, Conv, [256, 1, 1]]                     # 26: Y4

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]     # 27: Y4 上采样
  - [18, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 28: 引入跨尺度 Fused_P3(18)
  - [[-2, -1], 1, Concat, [1]]                     # 29
  - [-1, 3, RepC3, [256, 0.5]]                     # 30: X3 (P3尺度最终特征)

  # ============ PAN (Bottom-up) ============
  - [-1, 1, Conv, [256, 3, 2]]                     # 31: downsample P3
  - [[-1, 26], 1, Concat, [1]]                     # 32: 连接 Y4(26)
  - [-1, 3, RepC3, [256, 0.5]]                     # 33: F4

  - [-1, 1, Conv, [256, 3, 2]]                     # 34: downsample P4
  - [[-1, 21], 1, Concat, [1]]                     # 35: 连接 Y5(21)
  - [-1, 3, RepC3, [256, 0.5]]                     # 36: F5

  # 端到端检测，索引更新为 [30, 33, 36]
  - [[30, 33, 36], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]] # 37