# Ultralytics YOLOMM 🚀 RT-DETR-R50
# 纯净版: 仅升级主干为 ResNet-50，融合模块 (DFGF) 与 Head 保持完全不变

# Parameters
nc: 80 # number of classes
scales:
  l: [1.00, 1.00, 1024]

backbone:
  # ==================== RGB 路径 (R50) ====================
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu'], 'RGB'] # 0-P1/2
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']]        # 1
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']]        # 2
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]]                               # 3-P2/4

  # 升级为 R50 的 RTDETRBottleNeck (3, 4, 6, 3 堆叠)
  - [-1, 1, Blocks, [64, RTDETRBottleNeck, 3, 2, 'relu']]          # 4
  - [-1, 1, Blocks, [128, RTDETRBottleNeck, 4, 3, 'relu']]         # 5-P3/8   (RGB_P3)
  - [-1, 1, Blocks, [256, RTDETRBottleNeck, 6, 4, 'relu']]         # 6-P4/16  (RGB_P4)
  - [-1, 1, Blocks, [512, RTDETRBottleNeck, 3, 5, 'relu']]         # 7-P5/32  (RGB_P5)

  # ==================== X 路径 (红外) (R50) ====================
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu'], 'X']   # 8-P1/2
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']]        # 9
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']]        # 10
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]]                               # 11-P2/4

  # 同步升级红外的 RTDETRBottleNeck
  - [-1, 1, Blocks, [64, RTDETRBottleNeck, 3, 2, 'relu']]          # 12
  - [-1, 1, Blocks, [128, RTDETRBottleNeck, 4, 3, 'relu']]         # 13-P3/8  (IR_P3 抛弃)
  - [-1, 1, Blocks, [256, RTDETRBottleNeck, 6, 4, 'relu']]         # 14-P4/16 (IR_P4)
  - [-1, 1, Blocks, [512, RTDETRBottleNeck, 3, 5, 'relu']]         # 15-P5/32 (IR_P5)

  # ==================== DFGF 跨尺度频域引导融合 ====================
  # 这里的 True/False 就是我们之前加的 tiny_mode 开关 (VEDAI写True，M3FD写False)
  - [[7, 15], 1, SymmetricFreqGuidedFusion, [512,False]]           # 16: RGB_P5 + IR_P5
  - [-1, 1, C2PSA, [512]]                                          # 17: Fused_P5

  - [[6, 15], 1, DecoupledFreqGuidedFusion, [256,False]]           # 18: Fused_P4
  - [[5, 14], 1, DecoupledFreqGuidedFusion, [128,False]]           # 19: Fused_P3

# ==================== RT-DETR 专属 Transformer 检测头 ====================
head:
  # ------------ P5 尺度 (AIFI) ------------
  - [17, 1, Conv, [256, 1, 1, None, 1, 1, False]]                  # 20: 引入 Fused_P5(17) 投影
  - [-1, 1, AIFI, [1024, 8]]                                       # 21:
  - [-1, 1, Conv, [256, 1, 1]]                                     # 22: Y5

  # ------------ FPN (Top-down) ------------
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]                     # 23: Y5 上采样
  - [18, 1, Conv, [256, 1, 1, None, 1, 1, False]]                  # 24: 引入 Fused_P4(18) 投影
  - [[-2, -1], 1, Concat, [1]]                                     # 25:
  - [-1, 3, RepC3, [256]]                                          # 26: fpn_blocks.0
  - [-1, 1, Conv, [256, 1, 1]]                                     # 27: Y4

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]                     # 28: Y4 上采样
  - [19, 1, Conv, [256, 1, 1, None, 1, 1, False]]                  # 29: 引入 Fused_P3(19) 投影
  - [[-2, -1], 1, Concat, [1]]                                     # 30:
  - [-1, 3, RepC3, [256]]                                          # 31: X3 (P3尺度最终特征)

  # ------------ PAN (Bottom-up) ------------
  - [-1, 1, Conv, [256, 3, 2]]                                     # 32: downsample P3
  - [[-1, 27], 1, Concat, [1]]                                     # 33:
  - [-1, 3, RepC3, [256]]                                          # 34: F4

  - [-1, 1, Conv, [256, 3, 2]]                                     # 35: downsample P4
  - [[-1, 22], 1, Concat, [1]]                                     # 36:
  - [-1, 3, RepC3, [256]]                                          # 37: F5

  # R50 的 Decoder 深度为 6
  - [[31, 34, 37], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 6]]      # 38: 端到端检测