# 模型名: rtdetr-mm-DFGF-r18-SymP3.yaml
# 单一变量: 仅在 P3 层使用同尺度对称融合，保持 R18 主干与其他融合逻辑不变

nc: 80 
scales:
  l: [1.00, 1.00, 1024]

backbone:
  # ==================== RGB 路径 (R18) ====================
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu'], 'RGB'] 
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']]        
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']]        
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]]                               

  - [-1, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']]                # 4
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']]               # 5-P3/8   (RGB_P3)
  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']]               # 6-P4/16  (RGB_P4)
  - [-1, 1, Blocks, [512, BasicBlock, 2, 5, 'relu']]               # 7-P5/32  (RGB_P5)

  # ==================== IR 路径 (R18) ====================
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu'], 'X']   
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']]        
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']]        
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]]                               

  - [-1, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']]                # 12
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']]               # 13-P3/8  (IR_P3)
  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']]               # 14-P4/16 (IR_P4)
  - [-1, 1, Blocks, [512, BasicBlock, 2, 5, 'relu']]               # 15-P5/32 (IR_P5)

  # ==================== ★ 单一变量：P3 尺度感知融合 ★ ====================
  - [[7, 15], 1, SymmetricFreqGuidedFusion, [512, False]]          # 16: RGB_P5 + IR_P5
  - [-1, 1, C2PSA, [512]]                                          # 17: Fused_P5

  - [[6, 15], 1, DecoupledFreqGuidedFusion, [256, False]]          # 18: RGB_P4 + IR_P5 (保持原版非对称)
  
  # 【唯一修改处】：P3 层改为同尺度的对称融合
  - [[5, 13], 1, SymmetricFreqGuidedFusion, [128, False]]          # 19: RGB_P3 + IR_P3 -> Fused_P3

head:
  # ==================== RT-DETR R18 原生检测头 ====================
  - [17, 1, Conv, [256, 1, 1, None, 1, 1, False]]                  # 20
  - [-1, 1, AIFI, [1024, 8]]                                       # 21
  - [-1, 1, Conv, [256, 1, 1]]                                     # 22: Y5

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]                     # 23
  - [18, 1, Conv, [256, 1, 1, None, 1, 1, False]]                  # 24
  - [[-2, -1], 1, Concat, [1]]                                     # 25
  - [-1, 3, RepC3, [256, 0.5]]                                     # 26
  - [-1, 1, Conv, [256, 1, 1]]                                     # 27: Y4

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]                     # 28
  - [19, 1, Conv, [256, 1, 1, None, 1, 1, False]]                  # 29
  - [[-2, -1], 1, Concat, [1]]                                     # 30
  - [-1, 3, RepC3, [256, 0.5]]                                     # 31: X3 

  - [-1, 1, Conv, [256, 3, 2]]                                     # 32
  - [[-1, 27], 1, Concat, [1]]                                     # 33
  - [-1, 3, RepC3, [256, 0.5]]                                     # 34: F4

  - [-1, 1, Conv, [256, 3, 2]]                                     # 35
  - [[-1, 22], 1, Concat, [1]]                                     # 36
  - [-1, 3, RepC3, [256, 0.5]]                                     # 37: F5

  - [[31, 34, 37], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]      # 38 (R18解码器为3)