# Ultralytics YOLOMM 🚀 RT-DETR with HeavyDFGF (P2-Level High-Resolution Fusion)
# 专攻极小目标：引入 P2 层 (Stride 4) + 4层特征解码

nc: 80 
scales:
  l: [1.00, 1.00, 1024]

backbone:
  # ==================== RGB 路径 ====================
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu'], 'RGB'] 
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']]        
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']]        
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]]                               
  # 【提取 P2】下采样 4 倍，保留海量极小目标像素
  - [-1, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']]                # 4-P2/4 (RGB_P2) 
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']]               # 5-P3/8 (RGB_P3) 
  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']]               # 6-P4/16 (RGB_P4) 
  - [-1, 1, Blocks, [512, BasicBlock, 2, 5, 'relu']]               # 7-P5/32 (RGB_P5) 

  # ==================== IR 路径 ====================
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu'], 'X']   
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']]        
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']]        
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]]                               
  # 【提取 P2】
  - [-1, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']]                # 12-P2/4 (IR_P2) 
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']]               # 13-P3/8 (IR_P3) 
  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']]               # 14-P4/16 (IR_P4) 
  - [-1, 1, Blocks, [512, BasicBlock, 2, 5, 'relu']]               # 15-P5/32 (IR_P5) 

  # ==================== HeavyDFGF 尺度感知融合 ====================
  - [[7, 15], 1, HeavyDFGF, [512, False]]       # 16: P5 大目标
  - [-1, 1, C2PSA, [512]]                       # 17: Fused_P5
  - [[6, 15], 1, HeavyDFGF, [256, False]]       # 18: P4 中/大目标跨尺度
  - [[5, 13], 1, HeavyDFGF, [128, True]]        # 19: P3 小目标 (网格禁用+热异常注入)
  - [[4, 12], 1, HeavyDFGF, [64, True]]         # 20: P2 极小目标专属通道！

# ==================== 4层特征 Neck & Decoder ====================
head:
  - [17, 1, Conv, [256, 1, 1, None, 1, 1, False]]  
  - [-1, 1, AIFI, [1024, 8]]                       
  - [-1, 1, Conv, [256, 1, 1]]                     # 23: Y5

  # P4 语义下传
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]     
  - [18, 1, Conv, [256, 1, 1, None, 1, 1, False]]  
  - [[-2, -1], 1, Concat, [1]]                     
  - [-1, 3, RepC3, [256, 0.5]]                     
  - [-1, 1, Conv, [256, 1, 1]]                     # 28: Y4

  # P3 语义下传
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]     
  - [19, 1, Conv, [256, 1, 1, None, 1, 1, False]]  
  - [[-2, -1], 1, Concat, [1]]                     
  - [-1, 3, RepC3, [256, 0.5]]                     # 32: Y3

  # P2 语义下传 (高分辨率终极特征)
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]     
  - [20, 1, Conv, [256, 1, 1, None, 1, 1, False]]  
  - [[-2, -1], 1, Concat, [1]]                     
  - [-1, 3, RepC3, [256, 0.5]]                     # 36: Y2 (P2尺度，含海量极小目标信息)

  # 空间特征回传 (Bottom-up)
  - [-1, 1, Conv, [256, 3, 2]]                     
  - [[-1, 32], 1, Concat, [1]]                     
  - [-1, 3, RepC3, [256, 0.5]]                     # 39: F3

  - [-1, 1, Conv, [256, 3, 2]]                     
  - [[-1, 28], 1, Concat, [1]]                     
  - [-1, 3, RepC3, [256, 0.5]]                     # 42: F4

  - [-1, 1, Conv, [256, 3, 2]]                     
  - [[-1, 23], 1, Concat, [1]]                     
  - [-1, 3, RepC3, [256, 0.5]]                     # 45: F5

  # 传入 4 层特征 (36, 39, 42, 45)。注意最后一个参数 4 代表 num_levels=4
  - [[36, 39, 42, 45], 1, RTDETRDecoder, [nc, 256, 600, 4, 8, 4]]