# yolov11-mm-DGFG_re-rgbEFv2-xEFv2-S (Dual EfficientFormerV2-S0 + S2)
# 核心修复：分离自定义模块（填写物理通道）与官方模块（填写2倍逻辑通道）

nc: 80
scales:
  # 全局 S 尺度 (width=0.5，仅对官方 Conv/C3k2/SPPF 等模块生效)
  s: [0.50, 0.50, 1024]

backbone:
  # ==================== 1. IR 主干（EFv2-S0） ====================
  - [-1, 1, nn.Identity, []]                       # 0
  - [-1, 1, efficientformerv2_s0, [0, 640], 'X']   # 1
  # 自定义模块，不受 scale 影响，直接填入物理输出通道
  - [1, 1, GetIndex, [32,  0]]                     # 2: IR_P2 (实际 32c)
  - [1, 1, GetIndex, [48,  1]]                     # 3: IR_P3 (实际 48c)
  - [1, 1, GetIndex, [96,  2]]                     # 4: IR_P4 (实际 96c)
  - [1, 1, GetIndex, [176, 3]]                     # 5: IR_P5 (实际 176c)

  # ==================== 2. RGB 主干（EFv2-S2） ====================
  - [0, 1, efficientformerv2_s2, [0, 640], 'RGB']  # 6
  # 自定义模块，不受 scale 影响，直接填入物理输出通道
  - [6, 1, GetIndex, [32,  0]]                     # 7: RGB_P2 (实际 32c)
  - [6, 1, GetIndex, [64,  1]]                     # 8: RGB_P3 (实际 64c)
  - [6, 1, GetIndex, [144, 2]]                     # 9: RGB_P4 (实际 144c)
  - [6, 1, GetIndex, [288, 3]]                     # 10: RGB_P5 (实际 288c)
  
  # 官方模块，受 0.5 缩放影响！为了保持 288c 的物理输出，参数必须填 576
  - [-1, 1, SPPF, [576, 5]]                        # 11: SPPF (实际输出 288c)
  - [-1, 2, C2PSA, [576]]                          # 12: C2PSA (实际输出 288c)

  # ==================== 3. 混合融合策略 ====================
  # 自定义模块，不受 scale 影响。直接指定输出 S 尺度的标准通道
  # Fused_P5: (288c + 176c) -> 融合输出 512c
  - [[12, 5], 1, SymmetricFreqGuidedFusion, [512, False]]  # 13
  
  # Fused_P4: (144c + 48c) -> 融合输出 256c
  - [[9, 3], 1, DecoupledFreqGuidedFusion_re, [256, 2]]    # 14
  
  # Fused_P3: (64c + 32c) -> 融合输出 128c
  - [[8, 2], 1, DecoupledFreqGuidedFusion_re, [128, 2]]    # 15

# ==================== 4. YOLOv11 Neck + Head ====================
head:
  # ------ 自顶向下 (FPN) ------
  - [13, 1, nn.Upsample, [None, 2, "nearest"]]     # 16: 放大 Fused_P5 (512c)
  - [[-1, 14], 1, Concat, [1]]                     # 17: 拼接 (512+256 = 768c)
  
  # 官方模块，需要输出 256c，填 512
  - [-1, 2, C3k2, [512, False]]                    # 18: FPN_P4 (实际 256c)
  
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]     # 19: 放大 FPN_P4 (256c)
  - [[-1, 15], 1, Concat, [1]]                     # 20: 拼接 (256+128 = 384c)
  
  # 官方模块，需要输出 128c，填 256
  - [-1, 2, C3k2, [256, False]]                    # 21: FPN_P3 (实际 128c)
  
  # 官方模块，需要保持 128c，填 256
  - [-1, 1, C2PSA, [256]]                          # 22: FPN_P3_refined (实际 128c)
  
  # ------ 自底向上 (PAN) ------
  # 官方模块，需要输出 256c，填 512
  - [-1, 1, Conv, [512, 3, 2]]                     # 23: 下采样 P3 (实际 256c)
  - [[-1, 18], 1, Concat, [1]]                     # 24: 拼接 (256+256 = 512c)
  
  # 官方模块，需要输出 256c，填 512
  - [-1, 2, C3k2, [512, False]]                    # 25: PAN_P4 (实际 256c)
  
  # 官方模块，需要输出 512c，填 1024
  - [-1, 1, Conv, [1024, 3, 2]]                    # 26: 下采样 P4 (实际 512c)
  - [[-1, 13], 1, Concat, [1]]                     # 27: 拼接 (512+512 = 1024c)
  
  # 官方模块，需要输出 512c，填 1024
  - [-1, 2, C3k2, [1024, True]]                    # 28: PAN_P5 (实际 512c)

  # ------ 最终检测头 ------
  - [[22, 25, 28], 1, Detect, [nc]]                # 29: Detect (输入: 128c, 256c, 512c)