# YOLOv11-MM-DFGF (Asymmetric: RGB is S-scale, IR is N-scale)
# 核心策略: 极致轻量的异构双流主干 + DFGF跨尺度频域引导 + 双P5级联融合

# Parameters
nc: 80 
scales: 
  # 全局使用 S 尺度 (Depth=0.50, Width=0.50, Max=1024)
  s: [0.50, 0.50, 1024]

backbone:
  # ==================== 1. RGB 路径 (标准 S 尺度基准) ====================
  - [-1, 1, Conv, [64, 3, 2], 'RGB']      # 0
  - [-1, 1, Conv, [128, 3, 2]]            # 1
  - [-1, 2, C3k2, [256, False, 0.25]]     # 2
  - [-1, 1, Conv, [256, 3, 2]]            # 3
  - [-1, 2, C3k2, [512, False, 0.25]]     # 4: RGB_P3
  - [-1, 1, Conv, [512, 3, 2]]            # 5
  - [-1, 2, C3k2, [512, True]]            # 6: RGB_P4
  - [-1, 1, Conv, [1024, 3, 2]]           # 7
  - [-1, 2, C3k2, [1024, True]]           # 8: RGB_P5 (Early - SPPF前)
  - [-1, 1, SPPF, [1024, 5]]              # 9
  - [-1, 2, C2PSA, [1024]]                # 10: RGB_P5 (Final - C2PSA后)

  # ==================== 2. X 路径 (红外/深度) (强制 N 尺度: 基准全部减半) ====================
  - [-1, 1, Conv, [32, 3, 2], 'X']        # 11: (原64 -> 32)
  - [-1, 1, Conv, [64, 3, 2]]             # 12: (原128 -> 64)
  - [-1, 2, C3k2, [128, False, 0.25]]     # 13: (原256 -> 128)
  - [-1, 1, Conv, [128, 3, 2]]            # 14: (原256 -> 128)
  - [-1, 2, C3k2, [256, False, 0.25]]     # 15: X_P3
  - [-1, 1, Conv, [256, 3, 2]]            # 16: (原512 -> 256)
  - [-1, 2, C3k2, [256, True]]            # 17: X_P4
  - [-1, 1, Conv, [512, 3, 2]]            # 18: (原1024 -> 512)
  - [-1, 2, C3k2, [512, True]]            # 19: X_P5 (Early - SPPF前)
  - [-1, 1, SPPF, [512, 5]]               # 20: (原1024 -> 512)
  - [-1, 2, C2PSA, [512]]                 # 21: X_P5 (Final - C2PSA后)

  # ==================== 3. 非对称跨尺度 频域引导融合 ====================
  # Top P5 融合 (Final): 用于启动 FPN 的自顶向下高级语义传递
  - [[10, 21], 1, SymmetricFreqGuidedFusion, [1024, False]]  # 22 (基准 1024c -> 输出 512c)

  # Early P5 融合 (新增): 截留 SPPF 之前的空间信息，用于接应 PAN 的自底向上路径
  - [[8, 19], 1, SymmetricFreqGuidedFusion, [1024, False]]   # 23 (基准 1024c -> 输出 512c)

  # P4 融合: IR_P5(21) 跨尺度引导 RGB_P4(6)
  - [[6, 21], 1, DecoupledFreqGuidedFusion, [512, False]]    # 24 (基准 512c -> 输出 256c)

  # P3 融合: IR_P4(17) 跨尺度引导 RGB_P3(4)
  - [[4, 17], 1, DecoupledFreqGuidedFusion, [512, False]]    # 25 (基准 512c -> 输出 256c)

# ==================== 4. 标准 YOLOv11 检测头 ====================
head:
  # ------ 自顶向下 (FPN) ------
  - [22, 1, nn.Upsample, [None, 2, "nearest"]]               # 26: 放大 Final Fused P5
  - [[-1, 24], 1, ContextGuideFusionModuleV2, [1]]           # 27: 拼接 Fused P4
  - [-1, 2, C3k2, [512, False]]                              # 28: FPN_P4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]               # 29: 放大 FPN_P4
  - [[-1, 25], 1, ContextGuideFusionModuleV2, [1]]           # 30: 拼接 Fused P3
  - [-1, 2, C3k2, [256, False]]                              # 31: FPN_P3 (输出检测层 1)

  # ------ 自底向上 (PAN) ------
  - [-1, 1, Conv, [256, 3, 2]]                               # 32: 下采样 P3
  - [[-1, 28], 1, ContextGuideFusionModuleV2, [1]]           # 33: 拼接 FPN_P4
  - [-1, 2, C3k2, [512, False]]                              # 34: PAN_P4 (输出检测层 2)

  - [-1, 1, Conv, [512, 3, 2]]                               # 35: 下采样 P4
  # 🌟 关键点：这里不再去拼接高度模糊的 Top P5(22)，而是拼接你新增的 Early P5(23)，保护大目标边缘！
  - [[-1, 23], 1, ContextGuideFusionModuleV2, [1]]           # 36: 拼接 Early Fused P5
  - [-1, 2, C3k2, [1024, True]]                              # 37: PAN_P5 (输出检测层 3)

  # ------ Detect ------
  - [[31, 34, 37], 1, Detect, [nc]]                          # 38: 最终检测头