# YOLOv11-MM-DFGF (Heterogeneous: EV_M0 IR + YOLOv11-CNN RGB + DFGF_re)
# IR 主干：EfficientViT_M0（轻量 ViT，输出 P3/P4/P5）
# 融合策略：P5/P4 用 DFGF_re（大 IR 经 Focus 降采样引导小 RGB），P3 退化为对称融合
nc: 80
scales:
  m: [0.50, 1.00, 512]

backbone:
  # ==================== 1. IR 主干（EV_M0） ====================
  - [-1, 1, nn.Identity, []]                       # 0: 输入占位符
  - [-1, 1, EfficientViT_M0, [], 'X']              # 1: IR 主干，输出 list=[P3, P4, P5]

  # GetIndex 从 list 里取出各 stage（stage_idx: 0/1/2 → P3/P4/P5）
  - [1, 1, GetIndex, [64,  0]]                     # 2: IR_P3  (stride  8, 64c)
  - [1, 1, GetIndex, [128, 1]]                     # 3: IR_P4  (stride 16, 128c)
  - [1, 1, GetIndex, [192, 2]]                     # 4: IR_P5  (stride 32, 192c)

  # ==================== 2. RGB 主干（YOLOv11 标准） ====================
  - [0, 1, Conv, [64, 3, 2], 'RGB']                # 5: P1/2
  - [-1, 1, Conv, [128, 3, 2]]                     # 6: P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]              # 7
  - [-1, 1, Conv, [256, 3, 2]]                     # 8: P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]              # 9: RGB_P3 (512c)
  - [-1, 1, Conv, [512, 3, 2]]                     # 10: P4/16
  - [-1, 2, C3k2, [512, True]]                     # 11: RGB_P4 (512c)
  - [-1, 1, Conv, [1024, 3, 2]]                    # 12: P5/32
  - [-1, 2, C3k2, [1024, True]]                    # 13
  - [-1, 1, SPPF, [1024, 5]]                       # 14
  - [-1, 2, C2PSA, [1024]]                         # 15: RGB_P5 (1024c)

  # ==================== 3. 解耦频域引导融合（DFGF_re 主导） ====================
  # Fused_P5: RGB_P5(15, 1024c) + IR_P4(3, 128c)。IR 大一级，Focus 下采样匹配 P5
  - [[15, 3], 1, DecoupledFreqGuidedFusion_re, [1024, 2]]   # 16: Fused_P5

  # Fused_P4: RGB_P4(11, 512c) + IR_P3(2, 64c)。IR 大一级，Focus 下采样匹配 P4
  - [[11, 2], 1, DecoupledFreqGuidedFusion_re, [512, 2]]    # 17: Fused_P4

  # Fused_P3: RGB_P3(9, 512c) + IR_P3(2, 64c)。IR 同分辨率，对称融合
  - [[9, 2], 1, SymmetricFreqGuidedFusion, [512, False]]    # 18: Fused_P3

# ==================== 4. YOLOv11 Neck + Head ====================
head:
  # 自顶向下 (FPN)
  - [16, 1, nn.Upsample, [None, 2, "nearest"]]     # 19
  - [[-1, 17], 1, Concat, [1]]                     # 20
  - [-1, 2, C3k2, [512, False]]                    # 21: FPN_P4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]     # 22
  - [[-1, 18], 1, Concat, [1]]                     # 23
  - [-1, 2, C3k2, [256, False]]                    # 24: FPN_P3

  # 自底向上 (PAN)
  - [-1, 1, Conv, [256, 3, 2]]                     # 25
  - [[-1, 21], 1, Concat, [1]]                     # 26
  - [-1, 2, C3k2, [512, False]]                    # 27: PAN_P4

  - [-1, 1, Conv, [512, 3, 2]]                     # 28
  - [[-1, 16], 1, Concat, [1]]                     # 29
  - [-1, 2, C3k2, [1024, True]]                    # 30: PAN_P5

  - [[24, 27, 30], 1, Detect, [nc]]                # 31: Detect