# YOLOv11-MM-DFGF (Asymmetric: RGB is M-scale, IR is S-scale)
# 核心策略: 异构双流主干 + DFGF跨尺度频域引导 + YOLOv11标准检测头

# Parameters
nc: 80 
scales: 
  # 全局使用 M 尺度 (Depth=0.50, Width=1.00, Max=512)
  m: [0.50, 1.00, 512]

backbone:
  # ==================== 1. RGB 路径 (M 尺度, 保持不变) ====================
  - [-1, 1, Conv, [64, 3, 2], 'RGB']      # 0
  - [-1, 1, Conv, [128, 3, 2]]            # 1
  - [-1, 2, C3k2, [256, False, 0.25]]     # 2
  - [-1, 1, Conv, [256, 3, 2]]            # 3
  - [-1, 2, C3k2, [512, False, 0.25]]     # 4: RGB_P3 (512c)
  - [-1, 1, Conv, [512, 3, 2]]            # 5
  - [-1, 2, C3k2, [512, True]]            # 6: RGB_P4 (512c)
  - [-1, 1, Conv, [1024, 3, 2]]           # 7
  - [-1, 2, C3k2, [1024, True]]           # 8
  - [-1, 1, SPPF, [1024, 5]]              # 9
  - [-1, 2, C2PSA, [1024]]                # 10: RGB_P5 (M尺度受限为512c)

  # ==================== 2. X 路径 (红外/深度) (强制 S 尺度: 通道数全减半) ====================
  - [-1, 1, Conv, [32, 3, 2], 'X']        # 11 (原64 -> 32)
  - [-1, 1, Conv, [64, 3, 2]]             # 12 (原128 -> 64)
  - [-1, 2, C3k2, [128, False, 0.25]]     # 13 (原256 -> 128)
  - [-1, 1, Conv, [128, 3, 2]]            # 14 (原256 -> 128)
  - [-1, 2, C3k2, [256, False, 0.25]]     # 15: X_P3 (原512 -> 256c)
  - [-1, 1, Conv, [256, 3, 2]]            # 16 (原512 -> 256)
  - [-1, 2, C3k2, [256, True]]            # 17: X_P4 (原512 -> 256c)
  - [-1, 1, Conv, [512, 3, 2]]            # 18 (原1024 -> 512)
  - [-1, 2, C3k2, [512, True]]            # 19 (原1024 -> 512)
  - [-1, 1, SPPF, [512, 5]]               # 20 (原1024 -> 512)
  - [-1, 2, C2PSA, [512]]                 # 21: X_P5 (原1024 -> 512c)

  # ==================== 3. 非对称跨尺度 频域引导融合 ====================
  # P5 融合: RGB_P5(512c) + IR_P5(512c)
  - [[10, 21], 1, SymmetricFreqGuidedFusion, [1024, False]]  # 22: Fused_P5 (输出 1024c -> M尺度截断为 512c)

  # P4 融合: IR_P5(512c) 引导 RGB_P4(512c)
  - [[6, 21], 1, DecoupledFreqGuidedFusion, [512, False]]    # 23: Fused_P4 (输出 512c)

  # P3 融合: IR_P4(256c) 引导 RGB_P3(512c)
  - [[4, 17], 1, DecoupledFreqGuidedFusion, [512, False]]    # 24: Fused_P3 (输出 512c)

# ==================== 4. 标准 YOLOv11 检测头 (保持不变) ====================
head:
  - [22, 1, nn.Upsample, [None, 2, "nearest"]]  
  - [[-1, 23], 1, Concat, [1]]                  
  - [-1, 2, C3k2, [512, False]]                 # 27: FPN_P4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  
  - [[-1, 24], 1, Concat, [1]]                  
  - [-1, 2, C3k2, [256, False]]                 # 30: FPN_P3 

  - [-1, 1, Conv, [256, 3, 2]]                  
  - [[-1, 27], 1, Concat, [1]]                  
  - [-1, 2, C3k2, [512, False]]                 # 33: PAN_P4 

  - [-1, 1, Conv, [512, 3, 2]]                  
  - [[-1, 22], 1, Concat, [1]]                  
  - [-1, 2, C3k2, [1024, True]]                 # 36: PAN_P5 

  - [[30, 33, 36], 1, Detect, [nc]]             # 37