# YOLOv11-MM-DFGF (Heterogeneous: EFv2-S0 IR + YOLOv11-CNN RGB + DFGF_re/Symmetric)
# IR 主干：EfficientFormerV2-S0（输出 P2/P3/P4/P5）
# 融合策略：
#   - P5：对称 SymmetricFreqGuidedFusion(RGB_P5, IR_P5) 同尺度融合（深层语义对齐）
#   - P4：非对称 DFGF_re(RGB_P4, IR_P3) IR 高一级 Focus 下采样引导
#   - P3：非对称 DFGF_re(RGB_P3, IR_P2) IR 高一级 Focus 下采样引导
# Head：FPN_P3 后加 C2PSA 精炼小目标特征
nc: 80
scales:
  m: [0.50, 1.00, 512]

backbone:
  # ==================== 1. IR 主干（EFv2-S0） ====================
  - [-1, 1, nn.Identity, []]                       # 0: 输入占位符
  - [-1, 1, efficientformerv2_s0, [0, 640], 'X']   # 1: IR 主干, resolution=640 必须等于训练 imgsz
                                                   #    输出 list=[P2, P3, P4, P5]

  # GetIndex 从 list 里解包各 stage（stage_idx: 0/1/2/3 → P2/P3/P4/P5）
  - [1, 1, GetIndex, [32,  0]]                     # 2: IR_P2  (stride  4, 32c)
  - [1, 1, GetIndex, [48,  1]]                     # 3: IR_P3  (stride  8, 48c)
  - [1, 1, GetIndex, [96,  2]]                     # 4: IR_P4  (stride 16, 96c)
  - [1, 1, GetIndex, [176, 3]]                     # 5: IR_P5  (stride 32, 176c)

  # ==================== 2. RGB 主干（YOLOv11 标准） ====================
  - [0, 1, Conv, [64, 3, 2], 'RGB']                # 6:  P1/2
  - [-1, 1, Conv, [128, 3, 2]]                     # 7:  P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]              # 8
  - [-1, 1, Conv, [256, 3, 2]]                     # 9:  P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]              # 10: RGB_P3 (512c)
  - [-1, 1, Conv, [512, 3, 2]]                     # 11: P4/16
  - [-1, 2, C3k2, [512, True]]                     # 12: RGB_P4 (512c)
  - [-1, 1, Conv, [1024, 3, 2]]                    # 13: P5/32
  - [-1, 2, C3k2, [1024, True]]                    # 14
  - [-1, 1, SPPF, [1024, 5]]                       # 15
  - [-1, 2, C2PSA, [1024]]                         # 16: RGB_P5 (1024c)

  # ==================== 3. 混合融合策略 ====================
  # Fused_P5: RGB_P5(16, 1024c) + IR_P5(5, 176c)，同尺度 stride=32，对称融合
  - [[16, 5], 1, SymmetricFreqGuidedFusion, [1024, False]]  # 17: Fused_P5

  # Fused_P4: RGB_P4(12, 512c) + IR_P3(3, 48c)，IR 高一级，Focus 下采样匹配
  - [[12, 3], 1, DecoupledFreqGuidedFusion_re, [512, 2]]    # 18: Fused_P4

  # Fused_P3: RGB_P3(10, 512c) + IR_P2(2, 32c)，IR 高一级，Focus 下采样匹配
  - [[10, 2], 1, DecoupledFreqGuidedFusion_re, [512, 2]]    # 19: Fused_P3

# ==================== 4. YOLOv11 Neck + Head ====================
head:
  # 自顶向下 (FPN)
  - [17, 1, nn.Upsample, [None, 2, "nearest"]]     # 20
  - [[-1, 18], 1, Concat, [1]]                     # 21
  - [-1, 2, C3k2, [512, False]]                    # 22: FPN_P4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]     # 23
  - [[-1, 19], 1, Concat, [1]]                     # 24
  - [-1, 2, C3k2, [256, False]]                    # 25: FPN_P3


  # 自底向上 (PAN)
  - [-1, 1, Conv, [256, 3, 2]]                     # 26
  - [[-1, 22], 1, Concat, [1]]                     # 27
  - [-1, 2, C3k2, [512, False]]                    # 28: PAN_P4

  - [-1, 1, Conv, [512, 3, 2]]                     # 29
  - [[-1, 17], 1, Concat, [1]]                     # 30
  - [-1, 2, C3k2, [1024, True]]                    # 31: PAN_P5

  - [[25, 28, 31], 1, Detect, [nc]]                # 32: Detect