# YOLOv11-MM-DGFG-xn-rgbs (Pure Version)
# Asymmetric: RGB is S-scale, IR is N-scale
# Fusion: 1x SFGF (P5), 2x DFGF_re (IR_P3->RGB_P4, IR_P2->RGB_P3) + Standard Concat Head

# Parameters
nc: 80 
scales: 
  # 全局使用 S 尺度 (Depth=0.50, Width=0.50, Max=1024)
  s: [0.50, 0.50, 1024]

backbone:
  # ==================== 1. RGB 路径 (标准 S 尺度基准) ====================
  - [-1, 1, Conv, [64, 3, 2], 'RGB']      # 0
  - [-1, 1, Conv, [128, 3, 2]]            # 1
  - [-1, 2, C3k2, [256, False, 0.25]]     # 2
  - [-1, 1, Conv, [256, 3, 2]]            # 3
  - [-1, 2, C3k2, [512, False, 0.25]]     # 4: RGB_P3 
  - [-1, 1, Conv, [512, 3, 2]]            # 5
  - [-1, 2, C3k2, [512, True]]            # 6: RGB_P4 
  - [-1, 1, Conv, [1024, 3, 2]]           # 7
  - [-1, 2, C3k2, [1024, True]]           # 8
  - [-1, 1, SPPF, [1024, 5]]              # 9
  - [-1, 2, C2PSA, [1024]]                # 10: RGB_P5

  # ==================== 2. X 路径 (红外) (强制 N 尺度: 基准全部减半) ====================
  - [-1, 1, Conv, [32, 3, 2], 'X']        # 11
  - [-1, 1, Conv, [64, 3, 2]]             # 12
  - [-1, 2, C3k2, [128, False, 0.25]]     # 13: X_P2 (大尺寸，引导 RGB_P3)
  - [-1, 1, Conv, [128, 3, 2]]            # 14
  - [-1, 2, C3k2, [256, False, 0.25]]     # 15: X_P3 (大尺寸，引导 RGB_P4)
  - [-1, 1, Conv, [256, 3, 2]]            # 16
  - [-1, 2, C3k2, [256, True]]            # 17: X_P4
  - [-1, 1, Conv, [512, 3, 2]]            # 18
  - [-1, 2, C3k2, [512, True]]            # 19
  - [-1, 1, SPPF, [512, 5]]               # 20
  - [-1, 2, C2PSA, [512]]                 # 21: X_P5

  # ==================== 3. 跨模态融合 (1次SFGF + 2次DFGF_re) ====================
  # P5 融合: 同尺度高级语义交换 (RGB_P5 + IR_P5)
  - [[10, 21], 1, SymmetricFreqGuidedFusion, [1024, False]]  # 22 (输出 S尺度 512c)

  # P4 融合: 非对称高频引导 (RGB_P4 结合 IR_P3 经Focus下采样)
  - [[6, 15], 1, DecoupledFreqGuidedFusion_re, [512, 2]]     # 23 (输出 S尺度 256c)

  # P3 融合: 非对称高频引导 (RGB_P3 结合 IR_P2 经Focus下采样)
  - [[4, 13], 1, DecoupledFreqGuidedFusion_re, [512, 2]]     # 24 (输出 S尺度 256c)

# ==================== 4. 纯净版 YOLOv11 标准检测头 ====================
head:
  # ------ 自顶向下 (FPN) ------
  - [22, 1, nn.Upsample, [None, 2, "nearest"]]               # 25: 放大 Fused P5
  - [[-1, 23], 1, Concat, [1]]                               # 26: 拼接 Fused P4
  - [-1, 2, C3k2, [512, False]]                              # 27: FPN_P4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]               # 28: 放大 FPN_P4
  - [[-1, 24], 1, Concat, [1]]                               # 29: 拼接 Fused P3
  - [-1, 2, C3k2, [256, False]]                              # 30: FPN_P3 (输出检测层 1)

  # ------ 自底向上 (PAN) ------
  - [-1, 1, Conv, [256, 3, 2]]                               # 31: 下采样 P3
  - [[-1, 27], 1, Concat, [1]]                               # 32: 拼接 FPN_P4
  - [-1, 2, C3k2, [512, False]]                              # 33: PAN_P4 (输出检测层 2)

  - [-1, 1, Conv, [512, 3, 2]]                               # 34: 下采样 P4
  - [[-1, 22], 1, Concat, [1]]                               # 35: 拼接 Fused P5
  - [-1, 2, C3k2, [1024, True]]                              # 36: PAN_P5 (输出检测层 3)

  # ------ Detect ------
  - [[30, 33, 36], 1, Detect, [nc]]                          # 37: 最终检测头