# yolov11-mm-DGFG+fix-xn-rgbs
# 在 xn-rgbs 基础上：仅在 FPN_P3 后加 C2PSA 精炼，其余不变

nc: 80 
scales: 
  s: [0.50, 0.50, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2], 'RGB']      # 0
  - [-1, 1, Conv, [128, 3, 2]]            # 1
  - [-1, 2, C3k2, [256, False, 0.25]]     # 2
  - [-1, 1, Conv, [256, 3, 2]]            # 3
  - [-1, 2, C3k2, [512, False, 0.25]]     # 4: RGB_P3
  - [-1, 1, Conv, [512, 3, 2]]            # 5
  - [-1, 2, C3k2, [512, True]]            # 6: RGB_P4
  - [-1, 1, Conv, [1024, 3, 2]]           # 7
  - [-1, 2, C3k2, [1024, True]]           # 8
  - [-1, 1, SPPF, [1024, 5]]              # 9
  - [-1, 2, C2PSA, [1024]]                # 10: RGB_P5

  - [-1, 1, Conv, [32, 3, 2], 'X']        # 11
  - [-1, 1, Conv, [64, 3, 2]]             # 12
  - [-1, 2, C3k2, [128, False, 0.25]]     # 13
  - [-1, 1, Conv, [128, 3, 2]]            # 14
  - [-1, 2, C3k2, [256, False, 0.25]]     # 15: X_P3
  - [-1, 1, Conv, [256, 3, 2]]            # 16
  - [-1, 2, C3k2, [256, True]]            # 17: X_P4
  - [-1, 1, Conv, [512, 3, 2]]            # 18
  - [-1, 2, C3k2, [512, True]]            # 19
  - [-1, 1, SPPF, [512, 5]]               # 20
  - [-1, 2, C2PSA, [512]]                 # 21: X_P5

  - [[10, 21], 1, SymmetricFreqGuidedFusion, [1024, False]]  # 22: Fused_P5
  - [[6,  21], 1, DecoupledFreqGuidedFusion, [512,  False]]  # 23: Fused_P4
  - [[4,  17], 1, DecoupledFreqGuidedFusion, [512,  False]]  # 24: Fused_P3

head:
  - [22, 1, nn.Upsample, [None, 2, "nearest"]]  # 25
  - [[-1, 23], 1, Concat, [1]]                  # 26
  - [-1, 2, C3k2, [512, False]]                 # 27: FPN_P4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 28
  - [[-1, 24], 1, Concat, [1]]                  # 29
  - [-1, 2, C3k2, [256, False]]                 # 30: FPN_P3
  # ★ 唯一新增：C2PSA 精炼 P3 小目标特征，参数少但对 FLIR 小行人有效
  - [-1, 1, C2PSA, [256]]                       # 31: FPN_P3_refined

  - [-1, 1, Conv, [256, 3, 2]]                  # 32
  - [[-1, 27], 1, Concat, [1]]                  # 33
  - [-1, 2, C3k2, [512, False]]                 # 34: PAN_P4

  - [-1, 1, Conv, [512, 3, 2]]                  # 35
  - [[-1, 22], 1, Concat, [1]]                  # 36
  - [-1, 2, C3k2, [1024, True]]                 # 37: PAN_P5

  - [[31, 34, 37], 1, Detect, [nc]]             # 38