# YOLOv11-MM-DFGF: YOLOv11 Backbone & Head + Asymmetric Frequency-Guided Fusion
# 核心策略: YOLOv11双流并行主干 + DFGF跨尺度频域引导 (IR_P5->RGB_P4, IR_P4->RGB_P3) + YOLOv11标准检测头

# Parameters
nc: 80 # number of classes
scales: # 使用 YOLOv11 标准缩放常数
  #n: [0.50, 0.25, 1024]
  #s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # ==================== 1. RGB 路径 (层 0-10) ====================
  - [-1, 1, Conv, [64, 3, 2], 'RGB']      # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]            # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]     # 2
  - [-1, 1, Conv, [256, 3, 2]]            # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]     # 4: RGB_P3 (输出通道: 512)
  - [-1, 1, Conv, [512, 3, 2]]            # 5-P4/16
  - [-1, 2, C3k2, [512, True]]            # 6: RGB_P4 (输出通道: 512)
  - [-1, 1, Conv, [1024, 3, 2]]           # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]           # 8
  - [-1, 1, SPPF, [1024, 5]]              # 9
  - [-1, 2, C2PSA, [1024]]                # 10: RGB_P5 (输出通道: 1024)

  # ==================== 2. X 路径 (红外/深度) (层 11-21) ====================
  - [-1, 1, Conv, [64, 3, 2], 'X']        # 11-P1/2
  - [-1, 1, Conv, [128, 3, 2]]            # 12-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]     # 13
  - [-1, 1, Conv, [256, 3, 2]]            # 14-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]     # 15: X_P3 (此层特征将被抛弃，保留非对称逻辑)
  - [-1, 1, Conv, [512, 3, 2]]            # 16-P4/16
  - [-1, 2, C3k2, [512, True]]            # 17: X_P4 (输出通道: 512)
  - [-1, 1, Conv, [1024, 3, 2]]           # 18-P5/32
  - [-1, 2, C3k2, [1024, True]]           # 19
  - [-1, 1, SPPF, [1024, 5]]              # 20
  - [-1, 2, C2PSA, [1024]]                # 21: X_P5 (输出通道: 1024)

  # ==================== 3. 非对称跨尺度 频域引导融合 ====================
  # P5 顶层: 对称融合 RGB_P5(10) + IR_P5(21)
  - [[10, 21], 1, SymmetricFreqGuidedFusion, [1024, False]]  # 22: Fused_P5 (1024c)

  # P4 融合: 拿低分辨率 IR_P5(21) 引导高分辨率 RGB_P4(6)
  - [[6, 15], 1, DecoupledFreqGuidedFusion_re, [512, 2]]    # 23: Fused_P4 (512c)

  # P3 融合: 拿低分辨率 IR_P4(17) 引导高分辨率 RGB_P3(4)
  - [[4, 13], 1, DecoupledFreqGuidedFusion_re, [512, 2]]    # 24: Fused_P3 (512c)

# ==================== 4. 标准 YOLOv11 检测头 (Neck + Head) ====================
head:
  # 自顶向下路径 (FPN)
  - [22, 1, nn.Upsample, [None, 2, "nearest"]]  # 25: 放大 Fused_P5
  - [[-1, 23], 1, Concat, [1]]                  # 26: 拼接 Fused_P4(23)
  - [-1, 2, C3k2, [512, False]]                 # 27: FPN_P4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 28: 放大 FPN_P4
  - [[-1, 24], 1, Concat, [1]]                  # 29: 拼接 Fused_P3(24)
  - [-1, 2, C3k2, [256, False]]                 # 30: FPN_P3 (P3/8 最终特征)

  # 自底向上路径 (PAN)
  - [-1, 1, Conv, [256, 3, 2]]                  # 31: 下采样 P3
  - [[-1, 27], 1, Concat, [1]]                  # 32: 拼接 FPN_P4(27)
  - [-1, 2, C3k2, [512, False]]                 # 33: PAN_P4 (P4/16 最终特征)

  - [-1, 1, Conv, [512, 3, 2]]                  # 34: 下采样 P4
  - [[-1, 22], 1, Concat, [1]]                  # 35: 拼接最顶层 Fused_P5(22) !关键连线!
  - [-1, 2, C3k2, [1024, True]]                 # 36: PAN_P5 (P5/32 最终特征)

  # 最终 YOLOv11 Detect 模块
  - [[30, 33, 36], 1, Detect, [nc]]             # 37: 端到端检测输出