# Ultralytics YOLOMM - Mid-Fusion with MSIA Neck
# 目的：在中期融合架构中验证 MSIA 多尺度迭代聚合能力
# 基于：yolo11n-mm-mid.yaml
# 变更：在 Neck 部分使用 MSIA 替代传统 Concat 进行特征聚合
#
# 重要提示:
# 使用此配置训练时必须关闭 AMP (自动混合精度)，否则可能出现 NaN loss
# 训练示例: model.train(data='xxx.yaml', amp=False, ...)

nc: 80
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # ========== RGB路径 (层0-10) - 完整骨干网到P5 ==========
  - [-1, 1, Conv, [64, 3, 2], 'RGB']      # 0-P1/2 RGB路径起始
  - [-1, 1, Conv, [128, 3, 2]]            # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]     # 2
  - [-1, 1, Conv, [256, 3, 2]]            # 3-P3/8 (RGB_P3)
  - [-1, 2, C3k2, [512, False, 0.25]]     # 4
  - [-1, 1, Conv, [512, 3, 2]]            # 5-P4/16
  - [-1, 2, C3k2, [512, True]]            # 6 (RGB_P4)
  - [-1, 1, Conv, [1024, 3, 2]]           # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]           # 8
  - [-1, 1, SPPF, [1024, 5]]              # 9
  - [-1, 2, C2PSA, [1024]]                # 10 (RGB_P5)

  # ========== X路径 (层11-21) - 完整骨干网到P5 ==========
  - [-1, 1, Conv, [64, 3, 2], 'X']        # 11-P1/2 X路径起始
  - [-1, 1, Conv, [128, 3, 2]]            # 12-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]     # 13
  - [-1, 1, Conv, [256, 3, 2]]            # 14-P3/8 (X_P3)
  - [-1, 2, C3k2, [512, False, 0.25]]     # 15
  - [-1, 1, Conv, [512, 3, 2]]            # 16-P4/16
  - [-1, 2, C3k2, [512, True]]            # 17 (X_P4)
  - [-1, 1, Conv, [1024, 3, 2]]           # 18-P5/32
  - [-1, 2, C3k2, [1024, True]]           # 19
  - [-1, 1, SPPF, [1024, 5]]              # 20
  - [-1, 2, C2PSA, [1024]]                # 21 (X_P5)

  # ========== P4和P5层级融合 ==========
  # P4级融合
  - [[6, 17], 1, Concat, [1]]             # 22 P4融合: RGB_P4(6) + X_P4(17)
  - [-1, 2, C3k2, [1024, True]]           # 23 (Fused_P4)

  # P5级融合
  - [[10, 21], 1, Concat, [1]]            # 24 P5融合: RGB_P5(10) + X_P5(21)
  - [-1, 2, C3k2, [1024, True]]           # 25
  - [-1, 1, C2PSA, [1024]]                # 26 (Fused_P5)

head:
  # ========== MSIA 增强的 FPN ==========
  # P5 上采样后与 P4 通过 MSIA 聚合
  - [26, 1, nn.Upsample, [None, 2, "nearest"]]  # 27 Fused_P5上采样
  - [-1, 1, Conv, [1024, 1, 1]]                 # 28 通道对齐到 P4 (1024*width=256)
  - [[23, 28], 1, MSIA, [1024]]                 # 29 MSIA(Fused_P4, P5_up)
  - [-1, 2, C3k2, [512, False]]                 # 30

  # P4 上采样后与 P3 通过 MSIA 聚合
  - [30, 1, nn.Upsample, [None, 2, "nearest"]]  # 31
  - [-1, 1, Conv, [512, 1, 1]]                  # 32 通道对齐到 P3 (512*width=128)
  - [[4, 32], 1, MSIA, [512]]                   # 33 MSIA(RGB_P3, P4_up)
  - [-1, 2, C3k2, [256, False]]                 # 34 (P3/8-small)

  # 自底向上路径 (PAN)
  - [-1, 1, Conv, [256, 3, 2]]                  # 35
  - [[-1, 30], 1, Concat, [1]]                  # 36
  - [-1, 2, C3k2, [512, False]]                 # 37 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                  # 38
  - [[-1, 26], 1, Concat, [1]]                  # 39
  - [-1, 2, C3k2, [1024, True]]                 # 40 (P5/32-large)

  - [[34, 37, 40], 1, Detect, [nc]]             # 41 Detect(P3, P4, P5)
