# Ultralytics YOLOMM 🚀 Mid-Fusion with SOEP-RFPN
# YOLOMM RGB+X 中期融合 + SOEP-RFPN增强
# 核心策略: 双路独立P5骨干网 + P4/P5双层融合 + SOEP + RFPN增强
# 设计原则: 在SOEP基础上，使用SNI软插值和GSConvE增强特征金字塔
# 适用场景: 需要更高精度小目标检测的多模态任务

# SOEP-RFPN特性:
# - SPDConv: 空间到深度卷积
# - CSPOmniKernel: 多尺度核融合 + 频域增强
# - SNI: 软最近邻插值，减少上采样伪影
# - GSConvE: 多感受野增强卷积，提升表示学习

# 技术参考:
# - SOEP: 小目标增强金字塔（原创）
# - RFPN: ECCV2024 Rethinking FPN

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# P4/P5双层融合架构（同 yolo11n-mm-mid.yaml）
backbone:
  # ========== RGB路径 (层0-10) - 完整骨干网到P5 ==========
  - [-1, 1, Conv, [64, 3, 2], 'RGB']      # 0-P1/2 RGB路径起始
  - [-1, 1, Conv, [128, 3, 2]]            # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]     # 2 (RGB_P2)
  - [-1, 1, Conv, [256, 3, 2]]            # 3-P3/8 (RGB_P3)
  - [-1, 2, C3k2, [512, False, 0.25]]     # 4
  - [-1, 1, Conv, [512, 3, 2]]            # 5-P4/16
  - [-1, 2, C3k2, [512, True]]            # 6 (RGB_P4)
  - [-1, 1, Conv, [1024, 3, 2]]           # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]           # 8
  - [-1, 1, SPPF, [1024, 5]]              # 9
  - [-1, 2, C2PSA, [1024]]                # 10 (RGB_P5)

  # ========== X路径 (层11-21) - 完整骨干网到P5 ==========
  - [-1, 1, Conv, [64, 3, 2], 'X']        # 11-P1/2 X路径起始
  - [-1, 1, Conv, [128, 3, 2]]            # 12-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]     # 13 (X_P2)
  - [-1, 1, Conv, [256, 3, 2]]            # 14-P3/8 (X_P3)
  - [-1, 2, C3k2, [512, False, 0.25]]     # 15
  - [-1, 1, Conv, [512, 3, 2]]            # 16-P4/16
  - [-1, 2, C3k2, [512, True]]            # 17 (X_P4)
  - [-1, 1, Conv, [1024, 3, 2]]           # 18-P5/32
  - [-1, 2, C3k2, [1024, True]]           # 19
  - [-1, 1, SPPF, [1024, 5]]              # 20
  - [-1, 2, C2PSA, [1024]]                # 21 (X_P5)

  # ========== P4和P5层级融合 ==========
  # P4级融合
  - [[6, 17], 1, Concat, [1]]             # 22 P4融合: RGB_P4(6) + X_P4(17)
  - [-1, 2, C3k2, [1024, True]]           # 23 (Fused_P4)

  # P5级融合
  - [[10, 21], 1, Concat, [1]]            # 24 P5融合: RGB_P5(10) + X_P5(21)
  - [-1, 2, C3k2, [1024, True]]           # 25
  - [-1, 1, C2PSA, [1024]]                # 26 (Fused_P5)

# SOEP-RFPN增强颈部 + 标准检测头
head:
  # 自顶向下路径 (FPN with SNI)
  - [26, 1, SNI, [2]]                           # 27 Fused_P5软插值上采样
  - [[-1, 23], 1, Concat, [1]]                  # 28 连接Fused_P4
  - [-1, 2, C3k2, [512, False]]                 # 29

  # === SOEP小目标增强部分 (with SNI) ===
  - [-1, 1, SNI, [2]]                           # 30 软插值上采样到P3尺度
  - [2, 1, SPDConv, [256]]                      # 31 RGB_P2(2)经过SPDConv处理
  - [[-1, -2, 4], 1, Concat, [1]]               # 32 三路融合: SPDConv(31) + FPN(30) + RGB_P3(4)
  - [-1, 1, CSPOmniKernel, []]                  # 33 多尺度核融合+频域增强
  - [-1, 2, C3k2, [256, False]]                 # 34 (增强的P3/8-small)

  # 自底向上路径 (PAN with GSConvE)
  - [-1, 1, GSConvE, [256, 3, 2]]               # 35 增强型下采样
  - [[-1, 29], 1, Concat, [1]]                  # 36 连接P4
  - [-1, 2, C3k2, [512, False]]                 # 37 (P4/16-medium)

  - [-1, 1, GSConvE, [512, 3, 2]]               # 38 增强型下采样
  - [[-1, 26], 1, Concat, [1]]                  # 39 连接Fused_P5
  - [-1, 2, C3k2, [1024, True]]                 # 40 (P5/32-large)

  - [[34, 37, 40], 1, Detect, [nc]]             # 41 Detect(增强的P3, P4, P5)
