# Ultralytics YOLOMM 🚀 Mid-Fusion with MCF-Gated Fusion
# 设计要点：
# - 输入顺序沿用现有多模态规范：第 1 路为主模态（RGB），第 2 路为副模态（X）。
# - 在 P4/P5 融合处使用 MCFGatedFusion（ZeroConv 门，add 模式），实现“主模态等效起点 + 副模态渐进补偿”。
# - 其余颈部与检测头保持标准 YOLO11n 布局，便于直接替换现有 mid 模型。

nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # ========== 主模态 RGB ==========
  - [-1, 1, Conv, [64, 3, 2], 'RGB']      # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]            # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]     # 2
  - [-1, 1, Conv, [256, 3, 2]]            # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]     # 4
  - [-1, 1, Conv, [512, 3, 2]]            # 5-P4/16
  - [-1, 2, C3k2, [512, True]]            # 6 (RGB_P4)
  - [-1, 1, Conv, [1024, 3, 2]]           # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]           # 8
  - [-1, 1, SPPF, [1024, 5]]              # 9
  - [-1, 2, C2PSA, [1024]]                # 10 (RGB_P5)

  # ========== 副模态 X ==========
  - [-1, 1, Conv, [64, 3, 2], 'X']        # 11-P1/2
  - [-1, 1, Conv, [128, 3, 2]]            # 12-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]     # 13
  - [-1, 1, Conv, [256, 3, 2]]            # 14-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]     # 15
  - [-1, 1, Conv, [512, 3, 2]]            # 16-P4/16
  - [-1, 2, C3k2, [512, True]]            # 17 (X_P4)
  - [-1, 1, Conv, [1024, 3, 2]]           # 18-P5/32
  - [-1, 2, C3k2, [1024, True]]           # 19
  - [-1, 1, SPPF, [1024, 5]]              # 20
  - [-1, 2, C2PSA, [1024]]                # 21 (X_P5)

  # ========== MCF 门控融合 ==========
  - [[6, 17], 1, MCFGatedFusion, ['add', 3]]  # 22 P4: 主 512 + 副门控补偿
  - [-1, 2, C3k2, [512, True]]                # 23 (Fused_P4, 保持主通道数)

  - [[10, 21], 1, MCFGatedFusion, ['add', 3]] # 24 P5: 主 1024 + 副门控补偿
  - [-1, 2, C3k2, [1024, True]]               # 25
  - [-1, 1, C2PSA, [1024]]                    # 26 (Fused_P5)

head:
  # FPN
  - [26, 1, nn.Upsample, [None, 2, "nearest"]]  # 27
  - [[-1, 23], 1, Concat, [1]]                  # 28
  - [-1, 2, C3k2, [512, False]]                 # 29

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 30
  - [[-1, 4], 1, Concat, [1]]                   # 31
  - [-1, 2, C3k2, [256, False]]                 # 32 (P3/8)

  # PAN
  - [-1, 1, Conv, [256, 3, 2]]                  # 33
  - [[-1, 29], 1, Concat, [1]]                  # 34
  - [-1, 2, C3k2, [512, False]]                 # 35 (P4/16)

  - [-1, 1, Conv, [512, 3, 2]]                  # 36
  - [[-1, 26], 1, Concat, [1]]                  # 37
  - [-1, 2, C3k2, [1024, True]]                 # 38 (P5/32)

  - [[32, 35, 38], 1, Detect, [nc]]             # 39
