# Ultralytics YOLOMM 🚀 Mid-Fusion Paradigm at P3/P4
# YOLOMM RGB+X 中期P3/P4融合范式
# 核心策略: 双路独立P4骨干网 + P3/P4双层融合 + 标准检测头
# 设计原则: 聚焦于中层语义信息的融合，在计算效率和性能之间取得平衡。
# 适用场景: 适用于关键互补信息出现在中等语义层级的检测任务。

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# P3/P4双层融合架构
backbone:
  # ========== RGB路径 (层0-6) - 骨干网到P4 ==========
  - [-1, 1, Conv, [64, 3, 2], 'RGB']      # 0-P1/2 RGB路径起始
  - [-1, 1, Conv, [128, 3, 2]]            # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]     # 2
  - [-1, 1, Conv, [256, 3, 2]]            # 3-P3/8 (RGB_P3)
  - [-1, 2, C3k2, [512, False, 0.25]]     # 4
  - [-1, 1, Conv, [512, 3, 2]]            # 5-P4/16
  - [-1, 2, C3k2, [512, True]]            # 6 (RGB_P4)

  # ========== X路径 (层7-13) - 骨干网到P4 ==========
  - [-1, 1, Conv, [64, 3, 2], 'X']        # 7-P1/2 X路径起始
  - [-1, 1, Conv, [128, 3, 2]]            # 8-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]     # 9
  - [-1, 1, Conv, [256, 3, 2]]            # 10-P3/8 (X_P3)
  - [-1, 2, C3k2, [512, False, 0.25]]     # 11
  - [-1, 1, Conv, [512, 3, 2]]            # 12-P4/16
  - [-1, 2, C3k2, [512, True]]            # 13 (X_P4)

  # ========== P3和P4层级融合 ==========
  # P3级融合
  - [[3, 10], 1, Concat, [1]]             # 14 P3融合: RGB_P3(3) + X_P3(10)
  - [-1, 2, C3k2, [512, False, 0.25]]     # 15 (Fused_P3)

  # P4级融合
  - [[6, 13], 1, Concat, [1]]             # 16 P4融合: RGB_P4(6) + X_P4(13)
  - [-1, 2, C3k2, [1024, True]]           # 17 (Fused_P4)

# 标准YOLOv11检测头 (Neck + Head)
head:
  # 从Fused_P4生成P5
  - [17, 1, Conv, [1024, 3, 2]]           # 18 生成Pseudo_P5
  - [-1, 2, C3k2, [1024, True]]           # 19

  # 自顶向下路径 (FPN)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 20 Pseudo_P5上采样
  - [[-1, 17], 1, Concat, [1]]                  # 21 连接Fused_P4
  - [-1, 2, C3k2, [512, False]]                 # 22

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 23
  - [[-1, 15], 1, Concat, [1]]                  # 24 连接Fused_P3
  - [-1, 2, C3k2, [256, False]]                 # 25 (P3/8-small)

  # 自底向上路径 (PAN)
  - [-1, 1, Conv, [256, 3, 2]]                  # 26
  - [[-1, 22], 1, Concat, [1]]                  # 27
  - [-1, 2, C3k2, [512, False]]                 # 28 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                  # 29
  - [[-1, 19], 1, Concat, [1]]                  # 30
  - [-1, 2, C3k2, [1024, True]]                 # 31 (P5/32-large)

  - [[25, 28, 31], 1, Detect, [nc]]             # 32 Detect(P3, P4, P5)
