# Ultralytics YOLO11 🚀 MultiModal Residual Fusion Network Configuration
# YOLOMM RGB+X二元模态残差融合网络配置
# 策略：双路径独立提取后，通过多级残差连接实现跨模态增强
# 适用场景：模态间强相关性的检测任务，如RGB-Depth室内场景、RGB-Thermal目标跟踪

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# 残差融合网络架构
backbone:
  # ========== RGB路径 (层0-9) - 完整独立提取 ==========
  - [-1, 1, Conv, [64, 3, 2], 'RGB']      # 0-P1/2 RGB起始
  - [-1, 1, Conv, [128, 3, 2]]            # 1-P2/4 RGB
  - [-1, 2, C3k2, [256, False, 0.25]]     # 2 RGB P2特征
  - [-1, 1, Conv, [256, 3, 2]]            # 3-P3/8 RGB
  - [-1, 2, C3k2, [512, False, 0.25]]     # 4 RGB P3特征
  - [-1, 1, Conv, [512, 3, 2]]            # 5-P4/16 RGB
  - [-1, 2, C3k2, [512, True]]            # 6 RGB P4特征
  - [-1, 1, Conv, [1024, 3, 2]]           # 7-P5/32 RGB
  - [-1, 2, C3k2, [1024, True]]           # 8 RGB P5特征
  - [-1, 1, SPPF, [1024, 5]]              # 9 RGB最终特征

  # ========== X路径 (层10-19) - 完整独立提取 ==========
  - [-1, 1, Conv, [64, 3, 2], 'X']        # 10-P1/2 X起始
  - [-1, 1, Conv, [128, 3, 2]]            # 11-P2/4 X
  - [-1, 2, C3k2, [256, False, 0.25]]     # 12 X P2特征
  - [-1, 1, Conv, [256, 3, 2]]            # 13-P3/8 X
  - [-1, 2, C3k2, [512, False, 0.25]]     # 14 X P3特征
  - [-1, 1, Conv, [512, 3, 2]]            # 15-P4/16 X
  - [-1, 2, C3k2, [512, True]]            # 16 X P4特征
  - [-1, 1, Conv, [1024, 3, 2]]           # 17-P5/32 X
  - [-1, 2, C3k2, [1024, True]]           # 18 X P5特征
  - [-1, 1, SPPF, [1024, 5]]              # 19 X最终特征

  # ========== 多级残差连接 (层20-31) ==========
  # P2级残差连接
  - [[1, 11], 1, Concat, [1]]             # 20 P2残差：RGB P2 + X P2
  - [-1, 1, Conv, [256, 1, 1]]            # 21 P2残差调整
  - [-1, 1, C3k2, [256, False, 0.25]]     # 22 P2残差增强
  # 对齐到P3/8后再进行跨尺度拼接
  - [22, 1, Conv, [256, 3, 2]]            # 23 P2->P3 下采样对齐

  # P3级残差连接（累积P2残差）
  - [[3, 13, 23], 1, Concat, [1]]         # 24 P3残差：RGB P3 + X P3 + 对齐后的P2残差
  - [-1, 1, Conv, [512, 1, 1]]            # 25 P3残差调整
  - [-1, 2, C3k2, [512, False, 0.25]]     # 26 P3残差增强
  # 对齐到P4/16后再进行跨尺度拼接
  - [26, 1, Conv, [512, 3, 2]]            # 27 P3->P4 下采样对齐

  # P4级残差连接（累积P3残差）
  - [[5, 15, 27], 1, Concat, [1]]         # 28 P4残差：RGB P4 + X P4 + 对齐后的P3残差
  - [-1, 1, Conv, [1024, 1, 1]]           # 29 P4残差调整
  - [-1, 2, C3k2, [1024, True]]           # 30 P4残差增强
  # 对齐到P5/32后再进行跨尺度拼接
  - [30, 1, Conv, [1024, 3, 2]]           # 31 P4->P5 下采样对齐

  # P5级最终融合（累积所有残差）
  - [[9, 19, 31], 1, Concat, [1]]         # 32 P5融合：RGB P5 + X P5 + 对齐后的P4残差
  - [-1, 2, C3k2, [1024, True]]           # 33 最终融合处理
  - [-1, 2, C2PSA, [1024]]                # 34 最终特征增强

  # ========== 反向残差增强 (层32-37) ==========
  # 为检测头准备增强特征
  - [[2, 22], 1, Concat, [1]]             # 35 RGB P2 + P2残差增强（同尺度）
  - [-1, 1, Conv, [256, 1, 1]]            # 36 RGB P2增强

  - [[4, 26], 1, Concat, [1]]             # 37 RGB P3 + P3残差增强（同尺度）
  - [-1, 1, Conv, [512, 1, 1]]            # 38 RGB P3增强

  - [[6, 30], 1, Concat, [1]]             # 39 RGB P4 + P4残差增强（同尺度）
  - [-1, 1, Conv, [512, 1, 1]]            # 40 RGB P4增强

# 残差增强检测头
head:
  # P5->P4上采样
  - [34, 1, nn.Upsample, [None, 2, "nearest"]]   # 41 从最终特征增强(P5/32)上采样至P4/16
  - [[-1, 40], 1, Concat, [1]]                    # 42 连接P4增强特征（同尺度）
  - [-1, 2, C3k2, [512, False]]                   # 43 P4融合

  # P4->P3上采样
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 44
  - [[-1, 38], 1, Concat, [1]]                    # 45 连接P3增强特征（同尺度）
  - [-1, 2, C3k2, [256, False]]                   # 46 (P3/8-small)

  # P3->P4下采样
  - [-1, 1, Conv, [256, 3, 2]]                   # 47
  - [[-1, 43], 1, Concat, [1]]                    # 48 与P4路径融合（同尺度）
  - [-1, 2, C3k2, [512, False]]                   # 49 (P4/16-medium)

  # P4->P5下采样
  - [-1, 1, Conv, [512, 3, 2]]                   # 50
  - [[-1, 34], 1, Concat, [1]]                    # 51 与最终特征增强(P5/32)融合
  - [-1, 2, C3k2, [1024, True]]                   # 52 (P5/32-large)

  - [[46, 49, 52], 1, Detect, [nc]]              # 53 Detect(P3, P4, P5)

# 残差融合配置优势：
# 1. 路径独立：RGB和X完全独立提取，结构清晰
# 2. 多级残差：P2/P3/P4/P5四级残差连接，特征充分交互
# 3. 累积增强：每级残差包含前级信息，渐进式增强
# 4. 双向增强：残差既增强融合特征，又反馈增强原始特征
# 5. 梯度优化：残差连接改善深层网络训练
# 6. 适用场景：RGB-Depth、RGB-Thermal等强相关模态组合
