# Ultralytics YOLOMM 🚀 Mid-Fusion + RD (Fused-only)
# 说明：在标准中期融合架构的 P4/P5 融合输出后各插入一处 RD（DConv），
# 增强跨模态融合后的共享语义表征，改动最小、收益稳定。

nc: 80  # number of classes
scales:  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # ===== RGB Branch =====
  - [-1, 1, Conv, [64, 3, 2], 'RGB']      # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]            # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]     # 2
  - [-1, 1, Conv, [256, 3, 2]]            # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]     # 4 (RGB_P3)
  - [-1, 1, Conv, [512, 3, 2]]            # 5-P4/16
  - [-1, 2, C3k2, [512, True]]            # 6 (RGB_P4)
  - [-1, 1, Conv, [1024, 3, 2]]           # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]           # 8
  - [-1, 1, SPPF, [1024, 5]]              # 9
  - [-1, 2, C2PSA, [1024]]                # 10 (RGB_P5)

  # ===== X Branch =====
  - [-1, 1, Conv, [64, 3, 2], 'X']        # 11-P1/2
  - [-1, 1, Conv, [128, 3, 2]]            # 12-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]     # 13
  - [-1, 1, Conv, [256, 3, 2]]            # 14-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]     # 15 (X_P3)
  - [-1, 1, Conv, [512, 3, 2]]            # 16-P4/16
  - [-1, 2, C3k2, [512, True]]            # 17 (X_P4)
  - [-1, 1, Conv, [1024, 3, 2]]           # 18-P5/32
  - [-1, 2, C3k2, [1024, True]]           # 19
  - [-1, 1, SPPF, [1024, 5]]              # 20
  - [-1, 2, C2PSA, [1024]]                # 21 (X_P5)

  # ===== Fusion P4 with RD =====
  - [[6, 17], 1, Concat, [1]]             # 22  fuse P4: RGB_P4 + X_P4
  - [-1, 2, C3k2, [1024, True]]           # 23  Fused_P4
  - [-1, 1, DConv, [256, 0.8]]            # 24  RD after Fused_P4 (atoms=256, alpha=0.8)

  # ===== Fusion P5 with RD =====
  - [[10, 21], 1, Concat, [1]]            # 25  fuse P5: RGB_P5 + X_P5
  - [-1, 2, C3k2, [1024, True]]           # 26
  - [-1, 1, C2PSA, [1024]]                # 27  Fused_P5
  - [-1, 1, DConv, [256, 0.8]]            # 28  RD after Fused_P5

head:
  # FPN
  - [28, 1, nn.Upsample, [None, 2, "nearest"]]  # 29  up(Fused_P5_RD)
  - [[-1, 24], 1, Concat, [1]]                  # 30  + Fused_P4_RD
  - [-1, 2, C3k2, [512, False]]                 # 31

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 32
  - [[-1, 4], 1, Concat, [1]]                   # 33  + RGB_P3
  - [-1, 2, C3k2, [256, False]]                 # 34 (P3/8-small)

  # PAN
  - [-1, 1, Conv, [256, 3, 2]]                  # 35
  - [[-1, 31], 1, Concat, [1]]                  # 36
  - [-1, 2, C3k2, [512, False]]                 # 37 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                  # 38
  - [[-1, 28], 1, Concat, [1]]                  # 39  + Fused_P5_RD
  - [-1, 2, C3k2, [1024, True]]                 # 40 (P5/32-large)

  - [[34, 37, 40], 1, Detect, [nc]]             # 41 Detect(P3, P4, P5)

