# Ultralytics YOLOMM Pose Mid-Fusion
# YOLOMM RGB+X Pose Estimation with Mid-Fusion
# Multi-modal pose estimation with dual backbone and P4/P5 fusion

# Parameters
nc: 1  # number of classes (person)
kpt_shape: [17, 3]  # COCO 17 keypoints, 3 dims (x, y, visibility)

scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# P4/P5 Dual-layer Fusion Architecture
backbone:
  # ========== RGB Path (layers 0-10) ==========
  - [-1, 1, Conv, [64, 3, 2], 'RGB']
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 2, C2PSA, [1024]]

  # ========== X Path (layers 11-21) ==========
  - [-1, 1, Conv, [64, 3, 2], 'X']
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 2, C2PSA, [1024]]

  # ========== P4/P5 Fusion ==========
  - [[6, 17], 1, Concat, [1]]
  - [-1, 2, C3k2, [1024, True]]
  - [[10, 21], 1, Concat, [1]]
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, C2PSA, [1024]]

# Pose Head
head:
  - [26, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 23], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 29], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 26], 1, Concat, [1]]
  - [-1, 2, C3k2, [1024, True]]

  - [[32, 35, 38], 1, Pose, [nc, kpt_shape]]
