# Ultralytics YOLOMM - SlimNeck 轻量化 Neck 变体
# YOLOMM RGB+X 标准中期融合 + GSConv/VoVGSCSP 替换标准 FPN/PAN 中的卷积
# 设计思路: 使用 SlimNeck 的 GSConv 替代标准卷积， 降低计算量
# 适用场景: 裸备型目标检测， 计算资源受限的边缘设备

# Parameters
nc: 80
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.50, 512]
  x: [1.00, 1.50, 512]

# P4/P5 双层融合架构
backbone:
  # ========== RGB 路径 (层 0-10) = 完整骨干网到 P5 ==========
  - [-1, 1, Conv, [64, 3, 2], 'RGB']      # 0-P1/2 RGB 路径起始
  - [-1, 1, Conv, [128, 3, 2]]            # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]     # 2
  - [-1, 1, Conv, [256, 3, 2]]            # 3-P3/8 (RGB_P3)
  - [-1, 1, Conv, [512, 3, 2]]            # 5-P4/16
  - [-1, 2, C3k2, [512, True]]            # 6 (RGB_P4)
  - [-1, 1, Conv, [1024, 3, 2]]           # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]           # 8
  - [-1, 1, SPPF, [1024, 5]]              # 9
  - [-1, 2, C2PSA, [1024]]                # 10 (RGB_P5)

  # ========== X 路径 (层 11-21) = 完整骨干网到 P5 ==========
  - [-1, 1, Conv, [64, 3, 2], 'X']        # 11-P1/2 X 路径起始
  - [-1, 1, Conv, [128, 3, 2]]            # 12-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]     # 13
  - [-1, 2, C3k2, [512, False, 0.25]]     # 14
  - [-1, 1, Conv, [256, 3, 2]]            # 14-P3/8 (X_P3)
  - [-1, 1, Conv, [512, 3, 2]]            # 16-P4/16
  - [-1, 2, C3k2, [512, True]]            # 17 (X_P4)
  - [-1, 1, Conv, [1024, 3, 2]]           # 18-P5/32
  - [-1, 2, C3k2, [1024, True]]           # 19
  - [-1, 1, SPPF, [1024, 5]]              # 20
  - [-1, 2, C2PSA, [1024]]                # 21 (X_P5)
  # ========== P4 和 P5 层级融合 ==========
  # P4 级融合
  - [[6, 17], 1, Concat, [1]]             # 22 P4 融合: RGB_P4(6) + X_P4(17)
  - [-1, 2, C3k2, [1024, True]]           # 23 (Fused_P4)
  # P5 级融合
  - [[10, 21], 1, Concat, [1]]            # 24 P5 融合: RGB_P5(10) + X_P5(21)
  - [-1, 2, C3k2, [1024, True]]           # 25
  - [-1, 1, C2PSA, [1024]]                # 26 (Fused_P5)
# 轻量化 Neck: 使用 VoVGSCSP 替代 C3k2
head:
  - [26, 1, nn.Upsample, [None, 2, "nearest"]]  # 27 Fused_P5 上采样
  - [[-1, 23], 1, Concat, [1]]                  # 28 连接 Fused_P4
  - [-1, 2, VoVGSCSP, [512]]                  # 29

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 30
  - [[-1, 4], 1, Concat, [1]]                   # 31 连接 RGB_P3(4)
  - [-1, 2, VoVGSCSP, [256]]                  # 32 (P3/8-small)
  # 自底向上路径 (PAN)
  - [-1, 1, GSConv, [256, 3, 2]]                  # 33
  - [[-1, 29], 1, Concat, [1]]                  # 34
  - [-1, 2, VoVGSCSP, [512]]                  # 35 (P4/16-medium)
  - [-1, 1, GSConv, [512, 3, 2]]                  # 36
  - [[-1, 26], 1, Concat, [1]]                  # 37
  - [-1, 2, VoVGSCSP, [1024]]                 # 38 (P5/32-large)
  - [[32, 35, 38], 1, Detect, [nc]]             # 39 Detect(P3, P4, P5)
