# Ultralytics YOLOMM - Mid-Fusion with RFF
# 基于标准中期融合架构，在检测头前添加 RFF 模块
# RFF: Residual Feature Fusion - 融合 P1 层低级特征以保留像素级信息
# 论文: UMIS-YOLO (IEEE TGRS 2025)
# 核心改进: 通过残差特征融合将 P1 层像素级特征注入到各检测头，提升边界分割精度

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# P4/P5双层融合 + P1 RFF 注入架构
backbone:
  # ========== RGB路径 (层0-10) - 完整骨干网到P5 ==========
  - [-1, 1, Conv, [64, 3, 2], 'RGB']      # 0-P1/2 RGB路径起始 (RGB_P1)
  - [-1, 1, Conv, [128, 3, 2]]            # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]     # 2
  - [-1, 1, Conv, [256, 3, 2]]            # 3-P3/8 (RGB_P3)
  - [-1, 2, C3k2, [512, False, 0.25]]     # 4
  - [-1, 1, Conv, [512, 3, 2]]            # 5-P4/16
  - [-1, 2, C3k2, [512, True]]            # 6 (RGB_P4)
  - [-1, 1, Conv, [1024, 3, 2]]           # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]           # 8
  - [-1, 1, SPPF, [1024, 5]]              # 9
  - [-1, 2, C2PSA, [1024]]                # 10 (RGB_P5)

  # ========== X路径 (层11-21) - 完整骨干网到P5 ==========
  - [-1, 1, Conv, [64, 3, 2], 'X']        # 11-P1/2 X路径起始 (X_P1)
  - [-1, 1, Conv, [128, 3, 2]]            # 12-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]     # 13
  - [-1, 1, Conv, [256, 3, 2]]            # 14-P3/8 (X_P3)
  - [-1, 2, C3k2, [512, False, 0.25]]     # 15
  - [-1, 1, Conv, [512, 3, 2]]            # 16-P4/16
  - [-1, 2, C3k2, [512, True]]            # 17 (X_P4)
  - [-1, 1, Conv, [1024, 3, 2]]           # 18-P5/32
  - [-1, 2, C3k2, [1024, True]]           # 19
  - [-1, 1, SPPF, [1024, 5]]              # 20
  - [-1, 2, C2PSA, [1024]]                # 21 (X_P5)

  # ========== P1 层融合 (用于后续 RFF) ==========
  - [[0, 11], 1, Concat, [1]]             # 22 P1融合: RGB_P1(0) + X_P1(11) -> Fused_P1

  # ========== P4和P5层级融合 ==========
  # P4级融合
  - [[6, 17], 1, Concat, [1]]             # 23 P4融合: RGB_P4(6) + X_P4(17)
  - [-1, 2, C3k2, [1024, True]]           # 24 (Fused_P4)

  # P5级融合
  - [[10, 21], 1, Concat, [1]]            # 25 P5融合: RGB_P5(10) + X_P5(21)
  - [-1, 2, C3k2, [1024, True]]           # 26
  - [-1, 1, C2PSA, [1024]]                # 27 (Fused_P5)

# 检测头 + RFF 特征注入
head:
  # 自顶向下路径 (FPN)
  - [27, 1, nn.Upsample, [None, 2, "nearest"]]  # 28 Fused_P5上采样
  - [[-1, 24], 1, Concat, [1]]                  # 29 连接Fused_P4
  - [-1, 2, C3k2, [512, False]]                 # 30

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 31
  - [[-1, 4], 1, Concat, [1]]                   # 32 连接RGB_P3(4)
  - [-1, 2, C3k2, [256, False]]                 # 33 (P3/8-small 基础特征)

  # 自底向上路径 (PAN)
  - [-1, 1, Conv, [256, 3, 2]]                  # 34
  - [[-1, 30], 1, Concat, [1]]                  # 35
  - [-1, 2, C3k2, [512, False]]                 # 36 (P4/16-medium 基础特征)

  - [-1, 1, Conv, [512, 3, 2]]                  # 37
  - [[-1, 27], 1, Concat, [1]]                  # 38
  - [-1, 2, C3k2, [1024, True]]                 # 39 (P5/32-large 基础特征)

  # ========== RFF 残差特征融合 (P1 -> 各检测头) ==========
  # RFF 将 P1 层低级特征融合到各尺度输出，提升像素级分割精度
  - [[22, 33], 1, RFF, [4]]                     # 40 RFF-P3: Fused_P1(22) + P3特征(33)
  - [[22, 36], 1, RFF, [4]]                     # 41 RFF-P4: Fused_P1(22) + P4特征(36)
  - [[22, 39], 1, RFF, [4]]                     # 42 RFF-P5: Fused_P1(22) + P5特征(39)

  - [[40, 41, 42], 1, Detect, [nc]]             # 43 Detect(RFF-P3, RFF-P4, RFF-P5)
