# Ultralytics YOLOMM - UMIS-YOLO Complete Architecture
# 完整实现 UMIS-YOLO 论文的双模态融合架构
# 论文: UMIS-YOLO: Underwater Multimodal Images Instance Segmentation With YOLO
# 来源: IEEE Transactions on Geoscience and Remote Sensing, Vol.63, 2025
#
# 核心组件:
# 1. FDFEF (Frequency-Domain Feature Enhancement Fusion): P3/P4/P5 层频域特征增强融合
# 2. RFF (Residual Feature Fusion): P1 层低级特征残差融合到检测头
#
# 设计原则:
# - FDFEF 在频域内增强并融合多模态特征，通过幅度/相位融合实现互补
# - RFF 保留像素级信息，提升边界分割精度

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# UMIS-YOLO 完整架构: FDFEF + RFF
backbone:
  # ========== RGB路径 (层0-10) - 完整骨干网到P5 ==========
  - [-1, 1, Conv, [64, 3, 2], 'RGB']      # 0-P1/2 RGB路径起始 (RGB_P1)
  - [-1, 1, Conv, [128, 3, 2]]            # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]     # 2
  - [-1, 1, Conv, [256, 3, 2]]            # 3-P3/8
  - [-1, 2, C3k2, [256, False, 0.25]]     # 4 (RGB_P3)
  - [-1, 1, Conv, [512, 3, 2]]            # 5-P4/16
  - [-1, 2, C3k2, [512, True]]            # 6 (RGB_P4)
  - [-1, 1, Conv, [1024, 3, 2]]           # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]           # 8
  - [-1, 1, SPPF, [1024, 5]]              # 9
  - [-1, 2, C2PSA, [1024]]                # 10 (RGB_P5)

  # ========== X路径 (层11-21) - 完整骨干网到P5 ==========
  - [-1, 1, Conv, [64, 3, 2], 'X']        # 11-P1/2 X路径起始 (X_P1)
  - [-1, 1, Conv, [128, 3, 2]]            # 12-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]     # 13
  - [-1, 1, Conv, [256, 3, 2]]            # 14-P3/8
  - [-1, 2, C3k2, [256, False, 0.25]]     # 15 (X_P3)
  - [-1, 1, Conv, [512, 3, 2]]            # 16-P4/16
  - [-1, 2, C3k2, [512, True]]            # 17 (X_P4)
  - [-1, 1, Conv, [1024, 3, 2]]           # 18-P5/32
  - [-1, 2, C3k2, [1024, True]]           # 19
  - [-1, 1, SPPF, [1024, 5]]              # 20
  - [-1, 2, C2PSA, [1024]]                # 21 (X_P5)

  # ========== P1 层融合 (用于后续 RFF) ==========
  - [[0, 11], 1, Concat, [1]]             # 22 P1融合: RGB_P1(0) + X_P1(11) -> Fused_P1

  # ========== P3/P4/P5 FDFEF 频域融合 ==========
  # P3级 FDFEF 融合
  - [[4, 15], 1, FDFEF, []]               # 23 P3 FDFEF融合: RGB_P3(4) + X_P3(15)
  - [-1, 2, C3k2, [256, False]]           # 24 (Fused_P3)

  # P4级 FDFEF 融合
  - [[6, 17], 1, FDFEF, []]               # 25 P4 FDFEF融合: RGB_P4(6) + X_P4(17)
  - [-1, 2, C3k2, [512, True]]            # 26 (Fused_P4)

  # P5级 FDFEF 融合
  - [[10, 21], 1, FDFEF, []]              # 27 P5 FDFEF融合: RGB_P5(10) + X_P5(21)
  - [-1, 2, C3k2, [1024, True]]           # 28
  - [-1, 1, C2PSA, [1024]]                # 29 (Fused_P5)

# 检测头 + RFF 特征注入
head:
  # 自顶向下路径 (FPN)
  - [29, 1, nn.Upsample, [None, 2, "nearest"]]  # 30 Fused_P5上采样
  - [[-1, 26], 1, Concat, [1]]                  # 31 连接Fused_P4
  - [-1, 2, C3k2, [512, False]]                 # 32

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 33
  - [[-1, 24], 1, Concat, [1]]                  # 34 连接Fused_P3
  - [-1, 2, C3k2, [256, False]]                 # 35 (P3/8-small 基础特征)

  # 自底向上路径 (PAN)
  - [-1, 1, Conv, [256, 3, 2]]                  # 36
  - [[-1, 32], 1, Concat, [1]]                  # 37
  - [-1, 2, C3k2, [512, False]]                 # 38 (P4/16-medium 基础特征)

  - [-1, 1, Conv, [512, 3, 2]]                  # 39
  - [[-1, 29], 1, Concat, [1]]                  # 40
  - [-1, 2, C3k2, [1024, True]]                 # 41 (P5/32-large 基础特征)

  # ========== RFF 残差特征融合 (P1 -> 各检测头) ==========
  # RFF 将 P1 层低级特征融合到各尺度输出，提升像素级分割精度
  - [[22, 35], 1, RFF, [4]]                     # 42 RFF-P3: Fused_P1(22) + P3特征(35)
  - [[22, 38], 1, RFF, [4]]                     # 43 RFF-P4: Fused_P1(22) + P4特征(38)
  - [[22, 41], 1, RFF, [4]]                     # 44 RFF-P5: Fused_P1(22) + P5特征(41)

  - [[42, 43, 44], 1, Detect, [nc]]             # 45 Detect(RFF-P3, RFF-P4, RFF-P5)
