# Ultralytics YOLOMM 🚀 Mid-Fusion with P2 Head
# 基于 yolo11n-mm-mid.yaml 增加 P2/4 提取与四尺度检测 (P2,P3,P4,P5)

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# 骨干保持与标准 mid 版本一致，P4/P5 做双模态融合；P2 在 head 中引入
backbone:
  # ========== RGB路径 (层0-10) ==========
  - [-1, 1, Conv, [64, 3, 2], 'RGB']      # 0-P1/2 RGB起始
  - [-1, 1, Conv, [128, 3, 2]]            # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]     # 2  (RGB_P2)
  - [-1, 1, Conv, [256, 3, 2]]            # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]     # 4  (RGB_P3)
  - [-1, 1, Conv, [512, 3, 2]]            # 5-P4/16
  - [-1, 2, C3k2, [512, True]]            # 6  (RGB_P4)
  - [-1, 1, Conv, [1024, 3, 2]]           # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]           # 8
  - [-1, 1, SPPF, [1024, 5]]              # 9
  - [-1, 2, C2PSA, [1024]]                # 10 (RGB_P5)

  # ========== X路径 (层11-21) ==========
  - [-1, 1, Conv, [64, 3, 2], 'X']        # 11-P1/2 X起始
  - [-1, 1, Conv, [128, 3, 2]]            # 12-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]     # 13 (X_P2)
  - [-1, 1, Conv, [256, 3, 2]]            # 14-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]     # 15 (X_P3)
  - [-1, 1, Conv, [512, 3, 2]]            # 16-P4/16
  - [-1, 2, C3k2, [512, True]]            # 17 (X_P4)
  - [-1, 1, Conv, [1024, 3, 2]]           # 18-P5/32
  - [-1, 2, C3k2, [1024, True]]           # 19
  - [-1, 1, SPPF, [1024, 5]]              # 20
  - [-1, 2, C2PSA, [1024]]                # 21 (X_P5)

  # ========== P4 与 P5 融合 ==========
  - [[6, 17], 1, Concat, [1]]             # 22: 融合 P4 -> (Fused_P4_in)
  - [-1, 2, C3k2, [1024, True]]           # 23: Fused_P4

  - [[10, 21], 1, Concat, [1]]            # 24: 融合 P5 -> (Fused_P5_in)
  - [-1, 2, C3k2, [1024, True]]           # 25
  - [-1, 1, C2PSA, [1024]]                # 26: Fused_P5

# Head: 在标准 FPN 基础上加入 P2 分支，并进行四尺度检测
head:
  # 自顶向下 FPN：P5 -> P4 -> P3
  - [26, 1, nn.Upsample, [None, 2, "nearest"]]  # 27: Fused_P5 上采样
  - [[-1, 23], 1, Concat, [1]]                   # 28: + Fused_P4
  - [-1, 2, C3k2, [512, False]]                  # 29

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 30
  - [[-1, 4], 1, Concat, [1]]                    # 31: + RGB_P3(4)
  - [-1, 2, C3k2, [256, False]]                  # 32: P3 特征

  # 额外向下至 P2（新增）
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 33: P3->P2 上采样
  - [[-1, 2], 1, Concat, [1]]                    # 34: + RGB_P2(2)
  - [-1, 2, C3k2, [128, False]]                  # 35: P2 特征

  # 自底向上 PAN：P2 -> P3 -> P4 -> P5（重融合）
  - [35, 1, Conv, [128, 3, 2]]                   # 36: P2->P3 下采样
  - [[-1, 32], 1, Concat, [1]]                   # 37
  - [-1, 2, C3k2, [256, False]]                  # 38: 精炼 P3

  - [-1, 1, Conv, [256, 3, 2]]                   # 39: P3->P4 下采样
  - [[-1, 29], 1, Concat, [1]]                   # 40
  - [-1, 2, C3k2, [512, False]]                  # 41: 精炼 P4

  - [-1, 1, Conv, [512, 3, 2]]                   # 42: P4->P5 下采样
  - [[-1, 26], 1, Concat, [1]]                   # 43
  - [-1, 2, C3k2, [1024, True]]                  # 44: 精炼 P5

  - [[35, 38, 41, 44], 1, Detect, [nc]]          # 45 Detect(P2, P3, P4, P5)

