# Ultralytics YOLOMM 🚀 Mid-Fusion with P2 Head
# 基于 yolo11n-mm-mid.yaml 增加 P2/4 提取与四尺度检测 (P2,P3,P4,P5)

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# 骨干保持与标准 mid 版本一致，P4/P5 做双模态融合；P2 在 head 中引入
backbone:
  # ========== RGB路径 (层0-9) ==========
  - [-1, 1, LoGStem, [128], 'RGB']        # 0-P2/4 RGB起始 (LoG边缘检测+4x下采样)
  - [-1, 2, C3k2, [256, False, 0.25]]     # 1  (RGB_P2)
  - [-1, 1, Conv, [256, 3, 2]]            # 2-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]     # 3  (RGB_P3)
  - [-1, 1, Conv, [512, 3, 2]]            # 4-P4/16
  - [-1, 2, C3k2, [512, True]]            # 5  (RGB_P4)
  - [-1, 1, Conv, [1024, 3, 2]]           # 6-P5/32
  - [-1, 2, C3k2, [1024, True]]           # 7
  - [-1, 1, SPPF, [1024, 5]]              # 8
  - [-1, 2, C2PSA, [1024]]                # 9 (RGB_P5)

  # ========== X路径 (层10-20) ==========
  - [-1, 1, Conv, [64, 3, 2], 'X']        # 10-P1/2 X起始
  - [-1, 1, Conv, [128, 3, 2]]            # 11-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]    # 12 (X_P2)
  - [-1, 1, Conv, [256, 3, 2]]           # 13-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]    # 14 (X_P3)
  - [-1, 1, Conv, [512, 3, 2]]           # 15-P4/16
  - [-1, 2, C3k2, [512, True]]           # 16 (X_P4)
  - [-1, 1, Conv, [1024, 3, 2]]          # 17-P5/32
  - [-1, 2, C3k2, [1024, True]]          # 18
  - [-1, 1, SPPF, [1024, 5]]             # 19
  - [-1, 2, C2PSA, [1024]]               # 20 (X_P5)

  # ========== P3 与 P4 与 P5 融合 ==========
  - [[3, 14], 1, Concat, [1]]            # 21: 融合 P3 -> (Fused_P3_in)
  - [-1, 2, C3k2, [1024, False, 0.25]]   # 22: Fused_P3

  - [[5, 16], 1, Concat, [1]]            # 23: 融合 P4 -> (Fused_P4_in)
  - [-1, 2, C3k2, [1024, True]]          # 24: Fused_P4

  - [[9, 20], 1, Concat, [1]]            # 25: 融合 P5 -> (Fused_P5_in)
  - [-1, 2, C3k2, [1024, True]]          # 26
  - [-1, 1, C2PSA, [1024]]               # 27: Fused_P5

# Head: 在标准 FPN 基础上加入 P2 分支，并进行四尺度检测
head:
  # 自顶向下 FPN：P5 -> P4 -> P3
  - [27, 1, nn.Upsample, [None, 2, "nearest"]]  # 28: Fused_P5 上采样
  - [[-1, 24], 1, Concat, [1]]                  # 29: + Fused_P4
  - [-1, 2, C3k2, [512, False]]                 # 30

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 31
  - [[-1, 22], 1, Concat, [1]]                  # 32: + Fused_P3(22)
  - [-1, 2, C3k2, [256, False]]                 # 33: P3 特征

  # 额外向下至 P2（新增）
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 34: P3->P2 上采样
  - [[-1, 1], 1, Concat, [1]]                   # 35: + RGB_P2(1)
  - [-1, 2, C3k2, [128, False]]                 # 36: P2 特征

  # 自底向上 PAN：P2 -> P3 -> P4 -> P5（重融合）
  - [36, 1, Conv, [128, 3, 2]]                  # 37: P2->P3 下采样
  - [[-1, 33], 1, Concat, [1]]                  # 38
  - [-1, 2, C3k2, [256, False]]                 # 39: 精炼 P3

  - [-1, 1, Conv, [256, 3, 2]]                  # 40: P3->P4 下采样
  - [[-1, 30], 1, Concat, [1]]                  # 41
  - [-1, 2, C3k2, [512, False]]                 # 42: 精炼 P4

  - [-1, 1, Conv, [512, 3, 2]]                  # 43: P4->P5 下采样
  - [[-1, 27], 1, Concat, [1]]                  # 44
  - [-1, 2, C3k2, [1024, True]]                 # 45: 精炼 P5

  - [[36, 39, 42, 45], 1, Detect, [nc]]         # 46 Detect(P2, P3, P4, P5)
