# Ultralytics YOLO11 🚀 MultiModal Asymmetric Depth Fusion Configuration
# YOLOMM RGB+X二元模态非对称深度融合配置
# 策略：RGB深层网络(到P5) + X浅层网络(到P4)，充分利用模态特性差异
# 适用场景：RGB信息丰富需要深层处理，X模态(thermal/depth)信息相对简单的检测任务

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# 非对称深度架构 - RGB深X浅
backbone:
  # ========== RGB路径 (层0-10) - 完整深层网络到P5 ==========
  - [-1, 1, Conv, [64, 3, 2], 'RGB']      # 0-P1/2 RGB路径起始
  - [-1, 1, Conv, [128, 3, 2]]            # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]     # 2
  - [-1, 1, Conv, [256, 3, 2]]            # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]     # 4
  - [-1, 1, Conv, [512, 3, 2]]            # 5-P4/16
  - [-1, 2, C3k2, [512, True]]            # 6
  - [-1, 1, Conv, [1024, 3, 2]]           # 7-P5/32 RGB继续深层
  - [-1, 2, C3k2, [1024, True]]           # 8
  - [-1, 1, SPPF, [1024, 5]]              # 9
  - [-1, 2, C2PSA, [1024]]                # 10 RGB P5深层特征

  # ========== X路径 (层11-18) - 浅层网络只到P4 ==========
  - [-1, 1, Conv, [64, 3, 2], 'X']        # 11-P1/2 X路径起始
  - [-1, 1, Conv, [128, 3, 2]]            # 12-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]     # 13
  - [-1, 1, Conv, [256, 3, 2]]            # 14-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]     # 15
  - [-1, 1, Conv, [512, 3, 2]]            # 16-P4/16
  - [-1, 2, C3k2, [512, True]]            # 17
  - [-1, 1, SPPF, [512, 5]]               # 18 X P4特征（X路径结束）

  # ========== 非对称融合 ==========
  # P3级融合
  - [[3, 14], 1, Concat, [1]]             # 19 P3融合：RGB P3 + X P3
  - [-1, 2, C3k2, [512, False, 0.25]]     # 20 P3融合特征处理

  # P4级融合
  - [[6, 18], 1, Concat, [1]]             # 21 P4融合：RGB P4 + X P4
  - [-1, 2, C3k2, [1024, True]]           # 22 P4融合特征处理
  - [-1, 1, C2PSA, [1024]]                # 23 P4融合特征增强

# 非对称检测头 - 结合深层RGB和融合特征
head:
  # P5->P4上采样
  - [10, 1, nn.Upsample, [None, 2, "nearest"]]   # 24 RGB P5上采样
  - [[-1, 23], 1, Concat, [1]]                   # 25 连接P4融合特征
  - [-1, 2, C3k2, [512, False]]                  # 26 P4检测特征

  # P4->P3上采样
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 27
  - [[-1, 20], 1, Concat, [1]]                   # 28 连接P3融合特征
  - [-1, 2, C3k2, [256, False]]                  # 29 P3检测特征 (P3/8-small)

  # P3->P4下采样
  - [-1, 1, Conv, [256, 3, 2]]                   # 30
  - [[-1, 26], 1, Concat, [1]]                   # 31
  - [-1, 2, C3k2, [512, False]]                  # 32 P4检测特征 (P4/16-medium)

  # P4->P5下采样
  - [-1, 1, Conv, [512, 3, 2]]                   # 33
  - [[-1, 10], 1, Concat, [1]]                   # 34 连接RGB P5特征
  - [-1, 2, C3k2, [1024, True]]                  # 35 P5检测特征 (P5/32-large)

  - [[29, 32, 35], 1, Detect, [nc]]              # 36 Detect(P3, P4, P5)

# 非对称融合配置优势：
# 1. 计算高效：X路径较浅，节省约30%计算量
# 2. 模态特性匹配：RGB深层提取复杂纹理，X浅层提取结构信息
# 3. 深浅互补：P5保留RGB独有的深层语义，P3-P4融合两模态特征
# 4. 灵活部署：可根据场景动态调整X路径深度
# 5. 适用场景：白天为主的自动驾驶、RGB主导的监控系统等