# Ultralytics YOLOMM 🚀 Mid-Fusion + RD (Branch-small + Fused)
# 说明：在RGB/X两路分支的P3、P4输出后各插入小字典RD；在融合后的P4、P5处各插入一处较大字典RD。
# 目标：分支内“净化/提纯”各模态语义，融合后做共享语义的显式增强。

nc: 80  # number of classes
scales:  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # ===== RGB Branch =====
  - [-1, 1, Conv, [64, 3, 2], 'RGB']      # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]            # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]     # 2
  - [-1, 1, Conv, [256, 3, 2]]            # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]     # 4 (RGB_P3)
  - [-1, 1, DConv, [128, 0.8]]            # 5 RD: RGB_P3 (small atoms)
  - [-1, 1, Conv, [512, 3, 2]]            # 6-P4/16
  - [-1, 2, C3k2, [512, True]]            # 7 (RGB_P4)
  - [-1, 1, DConv, [128, 0.8]]            # 8 RD: RGB_P4 (small atoms)
  - [-1, 1, Conv, [1024, 3, 2]]           # 9-P5/32
  - [-1, 2, C3k2, [1024, True]]           # 10
  - [-1, 1, SPPF, [1024, 5]]              # 11
  - [-1, 2, C2PSA, [1024]]                # 12 (RGB_P5)

  # ===== X Branch =====
  - [-1, 1, Conv, [64, 3, 2], 'X']        # 13-P1/2
  - [-1, 1, Conv, [128, 3, 2]]            # 14-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]     # 15
  - [-1, 1, Conv, [256, 3, 2]]            # 16-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]     # 17 (X_P3)
  - [-1, 1, DConv, [128, 0.8]]            # 18 RD: X_P3 (small atoms)
  - [-1, 1, Conv, [512, 3, 2]]            # 19-P4/16
  - [-1, 2, C3k2, [512, True]]            # 20 (X_P4)
  - [-1, 1, DConv, [128, 0.8]]            # 21 RD: X_P4 (small atoms)
  - [-1, 1, Conv, [1024, 3, 2]]           # 22-P5/32
  - [-1, 2, C3k2, [1024, True]]           # 23
  - [-1, 1, SPPF, [1024, 5]]              # 24
  - [-1, 2, C2PSA, [1024]]                # 25 (X_P5)

  # ===== Fusion P4 with RD =====
  - [[8, 21], 1, Concat, [1]]             # 26 fuse P4 (use RD-processed P4)
  - [-1, 2, C3k2, [1024, True]]           # 27 Fused_P4
  - [-1, 1, DConv, [256, 0.8]]            # 28 RD: Fused_P4 (bigger atoms)

  # ===== Fusion P5 with RD =====
  - [[12, 25], 1, Concat, [1]]            # 29 fuse P5
  - [-1, 2, C3k2, [1024, True]]           # 30
  - [-1, 1, C2PSA, [1024]]                # 31 Fused_P5
  - [-1, 1, DConv, [256, 0.8]]            # 32 RD: Fused_P5 (bigger atoms)

head:
  # FPN
  - [32, 1, nn.Upsample, [None, 2, "nearest"]]  # 33 up(Fused_P5_RD)
  - [[-1, 28], 1, Concat, [1]]                  # 34 + Fused_P4_RD
  - [-1, 2, C3k2, [512, False]]                 # 35

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 36
  - [[-1, 5], 1, Concat, [1]]                   # 37 + RGB_P3_RD
  - [-1, 2, C3k2, [256, False]]                 # 38 (P3/8-small)

  # PAN
  - [-1, 1, Conv, [256, 3, 2]]                  # 39
  - [[-1, 35], 1, Concat, [1]]                  # 40
  - [-1, 2, C3k2, [512, False]]                 # 41 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                  # 42
  - [[-1, 32], 1, Concat, [1]]                  # 43 + Fused_P5_RD
  - [-1, 2, C3k2, [1024, True]]                 # 44 (P5/32-large)

  - [[38, 41, 44], 1, Detect, [nc]]             # 45 Detect(P3, P4, P5)

