# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLOv9c + RD (单模态原版风格)
# 说明：
# - 在骨干 B3 位置注入 RD：使用 RepNCSPELAND(atoms=512, alpha=0.8)
# - B4/B5 维持 RepNCSPELAN4（与 v9c 一致）
# - 颈/头：沿 v9c 结构（SPPELAN + FPN/PAN + Detect）
# - 为兼容 YOLOMM 路由，在第一层 Conv 第5列标注 'RGB'，其余层无需标注

# 参数
nc: 80  # 类别数

# GELAN backbone with RD injection at B3
backbone:
  - [-1, 1, Conv, [64, 3, 2], 'RGB']            # 0-P1/2 输入绑定 RGB 源
  - [-1, 1, Conv, [128, 3, 2]]                   # 1-P2/4
  - [-1, 1, RepNCSPELAN4, [256, 128, 64, 1]]     # 2
  - [-1, 1, ADown, [256]]                        # 3-P3/8
  - [-1, 1, RepNCSPELAND, [512, 256, 128, 1]]    # 4 ← RD 注入（B3层）默认 atoms=512, alpha=0.8
  - [-1, 1, ADown, [512]]                        # 5-P4/16
  - [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]]    # 6（B4）
  - [-1, 1, ADown, [512]]                        # 7-P5/32
  - [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]]    # 8（B5）
  - [-1, 1, SPPELAN, [512, 256]]                 # 9

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]                    # cat backbone P4（来自 6）
  - [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]]    # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]                    # cat backbone P3（来自 4，含 RD 注入）
  - [-1, 1, RepNCSPELAN4, [256, 256, 128, 1]]    # 15 (P3/8-small)

  - [-1, 1, ADown, [256]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]]    # 18 (P4/16-medium)

  - [-1, 1, ADown, [512]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]]    # 21 (P5/32-large)

  - [[15, 18, 21], 1, Detect, [nc]]              # Detect(P3, P4, P5)

