# RT-DETR-r18 MultiModal Mid-level Fusion (UniRGB-IR Lite)
# 对应 YOLOMM: yolo11n-mm-mid-unirgb-ir（X侧轻量金字塔 + P3 通道门控融合）

nc: 80
scales:
  l: [1.00, 1.00, 1024]

backbone:
  # RGB/X branches till P3
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu'], 'RGB']  # 0
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']]         # 1
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']]         # 2
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]]                                # 3

  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu'], 'X']    # 4
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']]         # 5
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']]         # 6
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]]                                # 7

  - [3, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']]                  # 8
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']]                # 9 RGB P3 (128c)
  - [7, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']]                  # 10
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']]                # 11 X P3 (128c)

  # IR lightweight pyramid from raw X (route via 'X') → (IR_P3, IR_P4, IR_P5)
  - [-1, 1, SpatialPriorModuleLite, [64, [128, 128, 256], 3], 'X']  # 12 tuple
  - [12, 1, Index, [0]]  # 13 IR_P3 (128c)

  # ChannelGate at P3 (RGB_P3, IR_P3) → fused P3 (128c)
  - [[9, 13], 1, ChannelGate, [128]]  # 14 Fused_P3(128c)
  - [-1, 1, Conv, [256, 1, 1]]        # 15 to 256

  # Build P4/P5 from fused P3
  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']]  # 16 P4
  - [-1, 1, Blocks, [512, BasicBlock, 2, 5, 'relu']]  # 17 P5

head:
  - [17, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 18 input_proj.2
  - [-1, 1, AIFI, [1024, 8]]  # 19
  - [-1, 1, Conv, [256, 1, 1]]  # 20

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 21
  - [16, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 22 input_proj.1
  - [[-2, -1], 1, Concat, [1]]  # 23
  - [-1, 3, RepC3, [256, 0.5]]  # 24
  - [-1, 1, Conv, [256, 1, 1]]  # 25

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 26
  - [15, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 27 input_proj.0
  - [[-2, -1], 1, Concat, [1]]  # 28
  - [-1, 3, RepC3, [256, 0.5]]  # 29

  - [-1, 1, Conv, [256, 3, 2]]  # 30
  - [[-1, 25], 1, Concat, [1]]  # 31
  - [-1, 3, RepC3, [256, 0.5]]  # 32

  - [-1, 1, Conv, [256, 3, 2]]  # 33
  - [[-1, 20], 1, Concat, [1]]  # 34
  - [-1, 3, RepC3, [256, 0.5]]  # 35

  - [[29, 32, 35], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]  # 36

