# RT-DETR-r18 MultiModal Mid-level Fusion with FCM(+Index) and ConvFFN_GLU in neck
# 对应 YOLOMM: yolo11n-mm-mid-convffn（P3 使用 FCM + Index 选 main；颈部若干 RepC3 以 ConvFFN_GLU 替换）

nc: 80
scales:
  l: [1.00, 1.00, 1024]

backbone:
  # RGB/X branches to P3
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu'], 'RGB']
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']]
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']]
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]]

  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu'], 'X']
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']]
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']]
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]]

  - [3, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']]   # 8
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']]  # 9 RGB P3
  - [7, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']]    # 10
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']]  # 11 X P3

  # FCM (dual-output) + Index select main + 1x1 to 256
  - [[9, 11], 1, FCM, [null, 2]]  # 12 -> (main, aux)
  - [12, 1, Index, [0]]           # 13 select main
  - [-1, 1, Conv, [256, 1, 1]]    # 14 fused P3

  # P4/P5 from fused P3
  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']]  # 15 P4
  - [-1, 1, Blocks, [512, BasicBlock, 2, 5, 'relu']]  # 16 P5

head:
  - [16, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 17 input_proj.2
  - [-1, 1, AIFI, [1024, 8]]  # 18
  - [-1, 1, Conv, [256, 1, 1]]  # 19

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 20
  - [15, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 21 input_proj.1
  - [[-2, -1], 1, Concat, [1]] # 22
  - [-1, 1, ConvFFN_GLU, [null, 256]] # 23 替代 RepC3, 输出保持 256
  - [-1, 1, Conv, [256, 1, 1]] # 24 Y4

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 25
  - [14, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 26 input_proj.0
  - [[-2, -1], 1, Concat, [1]] # 27
  - [-1, 1, ConvFFN_GLU, [null, 256]] # 28 替代 RepC3

  - [-1, 1, Conv, [256, 3, 2]] # 29
  - [[-1, 24], 1, Concat, [1]] # 30
  - [-1, 1, ConvFFN_GLU, [null, 256]] # 31 替代 RepC3

  - [-1, 1, Conv, [256, 3, 2]] # 32
  - [[-1, 19], 1, Concat, [1]] # 33
  - [-1, 3, RepC3, [256, 0.5]] # 34 保留最后一级为 RepC3

  - [[28, 31, 34], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]] # 35

