# Ultralytics YOLOMM 🚀 Mid-Fusion (ConvFFN_GLU Test)
# 基于 yolo11n-mm-mid 架构，在 Concat 之后使用 ConvFFN_GLU 代替 C3k2 进行通道压缩（保持下游期望通道数）。

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# P4/P5 融合：沿用 FCM (P4) + FeatureFusion (P5)，并在 Neck 的 Concat 后测试 ConvFFN_GLU。
backbone:
  # ========== RGB路径 (层0-10) ==========
  - [-1, 1, Conv, [64, 3, 2], 'RGB']      # 0-P1/2 RGB路径起始
  - [-1, 1, Conv, [128, 3, 2]]            # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]     # 2
  - [-1, 1, Conv, [256, 3, 2]]            # 3-P3/8 (RGB_P3)
  - [-1, 2, C3k2, [512, False, 0.25]]     # 4
  - [-1, 1, Conv, [512, 3, 2]]            # 5-P4/16
  - [-1, 2, C3k2, [512, True]]            # 6 (RGB_P4)
  - [-1, 1, Conv, [1024, 3, 2]]           # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]           # 8
  - [-1, 1, SPPF, [1024, 5]]              # 9
  - [-1, 2, C2PSA, [1024]]                # 10 (RGB_P5)

  # ========== X路径 (层11-21) ==========
  - [-1, 1, Conv, [64, 3, 2], 'X']        # 11-P1/2 X路径起始
  - [-1, 1, Conv, [128, 3, 2]]            # 12-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]     # 13
  - [-1, 1, Conv, [256, 3, 2]]            # 14-P3/8 (X_P3)
  - [-1, 2, C3k2, [512, False, 0.25]]     # 15
  - [-1, 1, Conv, [512, 3, 2]]            # 16-P4/16
  - [-1, 2, C3k2, [512, True]]            # 17 (X_P4)
  - [-1, 1, Conv, [1024, 3, 2]]           # 18-P5/32
  - [-1, 2, C3k2, [1024, True]]           # 19
  - [-1, 1, SPPF, [1024, 5]]              # 20
  - [-1, 2, C2PSA, [1024]]                # 21 (X_P5)

  # ========== P4/P5 融合 ==========
  - [[6, 17], 1, FCM, [null, 2]]                 # 22: P4 使用 FCM（输出 (main, aux)）
  - [-1, 1, Index, [0]]                          # 23: 取 main 分支作为 Fused_P4
  - [[10, 21], 1, FeatureFusion, [null, 2, 4, 8]]  # 24: P5 使用 FeatureFusion（单路输出）
  - [-1, 2, C3k2, [1024, True]]                  # 25
  - [-1, 1, C2PSA, [1024]]                       # 26 (Fused_P5)

# 标准YOLOv11检测头 (Neck + Head) — 使用 ConvFFN_GLU 替换 Concat 后的 C3k2
head:
  # 自顶向下路径 (FPN)
  - [26, 1, nn.Upsample, [None, 2, "nearest"]]  # 27 Fused_P5 上采样
  - [[-1, 23], 1, Concat, [1]]                  # 28 + Fused_P4
  - [-1, 1, ConvFFN_GLU, [null, 128]]           # 29: 384 -> 128（in_channels 自动补齐）

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 30
  - [[-1, 4], 1, Concat, [1]]                   # 31 + RGB_P3(4)
  - [-1, 2, C3k2, [256, False]]                 # 32 (P3/8-small) 保持 C3k2 不变

  # 自底向上路径 (PAN)
  - [-1, 1, Conv, [256, 3, 2]]                  # 33
  - [[-1, 29], 1, Concat, [1]]                  # 34
  - [-1, 1, ConvFFN_GLU, [null, 128]]           # 35: 384 -> 128

  - [-1, 1, Conv, [128, 3, 2]]                  # 36
  - [[-1, 26], 1, Concat, [1]]                  # 37
  - [-1, 1, ConvFFN_GLU, [null, 256]]           # 38: 384 -> 256

  - [[32, 35, 38], 1, Detect, [nc]]             # 39 Detect(P3, P4, P5)

