# Ultralytics YOLOMM 🚀 Mid-Fusion (FCM + FFN Test)
# 基于 yolo11n-mm-mid.yaml（非P2版本）构建，用于实例化测试 FCM 与 FFN 模块

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# P4/P5 融合：在 P4 处测试 FCM(+Index 选主分支)，在 P5 处测试 FeatureFusion
backbone:
  # ========== RGB路径 (层0-10) ==========
  - [-1, 1, Conv, [64, 3, 2], 'RGB']      # 0-P1/2 RGB路径起始
  - [-1, 1, Conv, [128, 3, 2]]            # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]     # 2
  - [-1, 1, Conv, [256, 3, 2]]            # 3-P3/8 (RGB_P3)
  - [-1, 2, C3k2, [512, False, 0.25]]     # 4
  - [-1, 1, Conv, [512, 3, 2]]            # 5-P4/16
  - [-1, 2, C3k2, [512, True]]            # 6 (RGB_P4)
  - [-1, 1, Conv, [1024, 3, 2]]           # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]           # 8
  - [-1, 1, SPPF, [1024, 5]]              # 9
  - [-1, 2, C2PSA, [1024]]                # 10 (RGB_P5)

  # ========== X路径 (层11-21) ==========
  - [-1, 1, Conv, [64, 3, 2], 'X']        # 11-P1/2 X路径起始
  - [-1, 1, Conv, [128, 3, 2]]            # 12-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]     # 13
  - [-1, 1, Conv, [256, 3, 2]]            # 14-P3/8 (X_P3)
  - [-1, 2, C3k2, [512, False, 0.25]]     # 15
  - [-1, 1, Conv, [512, 3, 2]]            # 16-P4/16
  - [-1, 2, C3k2, [512, True]]            # 17 (X_P4)
  - [-1, 1, Conv, [1024, 3, 2]]           # 18-P5/32
  - [-1, 2, C3k2, [1024, True]]           # 19
  - [-1, 1, SPPF, [1024, 5]]              # 20
  - [-1, 2, C2PSA, [1024]]                # 21 (X_P5)

  # ========== P4/P5 融合 ==========
  # P4: 使用 FCM（双分支纠偏增强）+ Index 选主分支，保持层索引与原 mid 一致
  - [[6, 17], 1, FCM, [null, 2]]          # 22: FCM(dim auto, reduction=2) -> (main, aux)
  - [-1, 1, Index, [0]]                   # 23: 取 main 分支作为 Fused_P4

  # P5: 使用 FeatureFusion（交互式融合为单路）
  - [[10, 21], 1, FeatureFusion, [null, 2, 4, 8]]  # 24: dim auto, reduction=2, sr_ratio=4, num_heads=8
  - [-1, 2, C3k2, [1024, True]]           # 25
  - [-1, 1, C2PSA, [1024]]                # 26 (Fused_P5)

# 标准YOLOv11检测头 (Neck + Head) — 索引保持与原 mid 一致
head:
  # 自顶向下路径 (FPN)
  - [26, 1, nn.Upsample, [None, 2, "nearest"]]  # 27 Fused_P5 上采样
  - [[-1, 23], 1, Concat, [1]]                  # 28 + Fused_P4
  - [-1, 2, C3k2, [512, False]]                 # 29

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 30
  - [[-1, 4], 1, Concat, [1]]                   # 31 + RGB_P3(4)
  - [-1, 2, C3k2, [256, False]]                 # 32 (P3/8-small)

  # 自底向上路径 (PAN)
  - [-1, 1, Conv, [256, 3, 2]]                  # 33
  - [[-1, 29], 1, Concat, [1]]                  # 34
  - [-1, 2, C3k2, [512, False]]                 # 35 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                  # 36
  - [[-1, 26], 1, Concat, [1]]                  # 37
  - [-1, 2, C3k2, [1024, True]]                 # 38 (P5/32-large)

  - [[32, 35, 38], 1, Detect, [nc]]             # 39 Detect(P3, P4, P5)

# ================================================================
# 说明：FCM 输出与 Index 搭配（P4 融合）
# ---------------------------------------------------------------
# FCM 输出性质
# - 输入：[6(RGB_P4)=x1, 17(X_P4)=x2]。
# - 输出：(main, aux)，为跨模态校正后的两路特征：
#   • main ≈ x1 ⊕ φ(x2→x1)：以 x1 为主体，受 x2 条件引导（“x1 对 x2”）。
#   • aux  ≈ x2 ⊕ φ(x1→x2)：以 x2 为主体，受 x1 条件引导（“x2 对 x1”）。
#   其中 φ 为跨模态交互/门控，保持 P4 空间尺度与对齐后的通道数。
#
# 搭配关系（FCM + Index）
# - FCM 之后紧接 Index，从 (main, aux) 中选择一路作为 Fused_P4 供后续 FPN 使用。
# - 选择规则：Index[0] 取 main（默认），Index[1] 取 aux。
# ================================================================

# ---------------------------------------------------------------
# 补充：在 FCM 后同时获取 main/aux 的写法
# - 需求：分别保留 FCM(22) 的两路输出，需添加两个 Index，并都显式读取层 22。
# - 示例：
#   - [22, 1, Index, [0]]  # Fused_P4_main：main（x1 对 x2）
#   - [22, 1, Index, [1]]  # Fused_P4_aux： aux（x2 对 x1）
# - 说明：避免使用 `-1`，否则第二个 Index 将引用前一层而非 FCM 输出。
