# Ultralytics YOLOMM - Mid-Fusion with MJRNet
# 目的：在中期融合架构中验证 MJRNet 的跨模态融合能力
# 基于：yolo11n-mm-mid.yaml
# 变更：P4/P5 层使用 MJRNet 替代 Concat + C3k2
#
# 重要提示:
# 使用此配置训练时必须关闭 AMP (自动混合精度)，否则可能出现 NaN loss
# 训练示例: model.train(data='xxx.yaml', amp=False, ...)

nc: 80
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # ========== RGB路径 (层0-10) - 完整骨干网到P5 ==========
  - [-1, 1, Conv, [64, 3, 2], 'RGB']      # 0-P1/2 RGB路径起始
  - [-1, 1, Conv, [128, 3, 2]]            # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]     # 2
  - [-1, 1, Conv, [256, 3, 2]]            # 3-P3/8 (RGB_P3)
  - [-1, 2, C3k2, [512, False, 0.25]]     # 4
  - [-1, 1, Conv, [512, 3, 2]]            # 5-P4/16
  - [-1, 2, C3k2, [512, True]]            # 6 (RGB_P4)
  - [-1, 1, Conv, [1024, 3, 2]]           # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]           # 8
  - [-1, 1, SPPF, [1024, 5]]              # 9
  - [-1, 2, C2PSA, [1024]]                # 10 (RGB_P5)

  # ========== X路径 (层11-21) - 完整骨干网到P5 ==========
  - [-1, 1, Conv, [64, 3, 2], 'X']        # 11-P1/2 X路径起始
  - [-1, 1, Conv, [128, 3, 2]]            # 12-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]     # 13
  - [-1, 1, Conv, [256, 3, 2]]            # 14-P3/8 (X_P3)
  - [-1, 2, C3k2, [512, False, 0.25]]     # 15
  - [-1, 1, Conv, [512, 3, 2]]            # 16-P4/16
  - [-1, 2, C3k2, [512, True]]            # 17 (X_P4)
  - [-1, 1, Conv, [1024, 3, 2]]           # 18-P5/32
  - [-1, 2, C3k2, [1024, True]]           # 19
  - [-1, 1, SPPF, [1024, 5]]              # 20
  - [-1, 2, C2PSA, [1024]]                # 21 (X_P5)

  # ========== P4和P5层级融合（使用 MJRNet）==========
  # P4级融合：使用 MJRNet 替代 Concat
  - [[6, 17], 1, MJRNet, [512, 16]]       # 22 MJRNet(RGB_P4, X_P4) -> Fused_P4

  # P5级融合：使用 MJRNet 替代 Concat
  - [[10, 21], 1, MJRNet, [1024, 16]]     # 23 MJRNet(RGB_P5, X_P5)
  - [-1, 1, C2PSA, [1024]]                # 24 (Fused_P5)

head:
  # 自顶向下路径 (FPN)
  - [24, 1, nn.Upsample, [None, 2, "nearest"]]  # 25 Fused_P5上采样
  - [[-1, 22], 1, Concat, [1]]                  # 26 连接Fused_P4
  - [-1, 2, C3k2, [512, False]]                 # 27

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 28
  - [[-1, 4], 1, Concat, [1]]                   # 29 连接RGB_P3(4)
  - [-1, 2, C3k2, [256, False]]                 # 30 (P3/8-small)

  # 自底向上路径 (PAN)
  - [-1, 1, Conv, [256, 3, 2]]                  # 31
  - [[-1, 27], 1, Concat, [1]]                  # 32
  - [-1, 2, C3k2, [512, False]]                 # 33 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                  # 34
  - [[-1, 24], 1, Concat, [1]]                  # 35
  - [-1, 2, C3k2, [1024, True]]                 # 36 (P5/32-large)

  - [[30, 33, 36], 1, Detect, [nc]]             # 37 Detect(P3, P4, P5)
