# Ultralytics YOLOMM 🚀 中期融合（UniRGB-IR 简化版）
# 基于 yolo11n-mm-mid 思路，使用 IR 侧轻量金字塔 + 通道门控融合
# 目标：以最小改动在 P3/P4/P5 三尺度引入 IR 信息

# 参数
nc: 80  # 类别数
scales:  # 复用标准yolo11n的缩放配置
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# 说明：
# - 使用 5th 字段（'RGB' / 'X'）做多模态输入路由
# - IR 支路采用 SpatialPriorModuleLite 直接从 X 图像构建 8/16/32 下采样特征
# - 在 P3/P4/P5 用 ChannelGate 做简化门控融合（可后续叠加 ConvMixFusion 增强）

backbone:
  # ========== RGB 路径（0-10）==========
  - [-1, 1, Conv, [64, 3, 2], 'RGB']      # 0-P1/2 RGB 起始
  - [-1, 1, Conv, [128, 3, 2]]            # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]     # 2
  - [-1, 1, Conv, [256, 3, 2]]            # 3-P3/8 (RGB_P3 pre)
  - [-1, 2, C3k2, [512, False, 0.25]]     # 4 (RGB_P3)
  - [-1, 1, Conv, [512, 3, 2]]            # 5-P4/16
  - [-1, 2, C3k2, [512, True]]            # 6 (RGB_P4)
  - [-1, 1, Conv, [1024, 3, 2]]           # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]           # 8
  - [-1, 1, SPPF, [1024, 5]]              # 9
  - [-1, 1, C2PSA, [1024]]                # 10 (RGB_P5)

  # ========== IR 轻量金字塔（11-14）==========
  # 必须显式传参：inplanes=64, embed_dims按yolo11n宽度缩放(0.25)：(128,128,256), in_chans=3（若IR为伪彩；单通道请设为1）
  - [-1, 1, SpatialPriorModuleLite, [64, [128, 128, 256], 3], 'X']  # 11 -> (IR_P3, IR_P4, IR_P5)
  - [11, 1, Index, [0]]                     # 12 IR_P3  (B,128,H/8,W/8)
  - [11, 1, Index, [1]]                     # 13 IR_P4  (B,128,H/16,W/16)
  - [11, 1, Index, [2]]                     # 14 IR_P5  (B,256,H/32,W/32)

  # ========== 三尺度门控融合（15-17）==========
  - [[4, 12], 1, ChannelGate, [128]]        # 15 Fused_P3（128=512*0.25）
  - [[6, 13], 1, ChannelGate, [128]]        # 16 Fused_P4（128=512*0.25）
  - [[10, 14], 1, ChannelGate, [256]]       # 17 Fused_P5（256=1024*0.25）

# 标准 FPN/PAN + Detect 头
head:
  # 自顶向下（FPN）
  - [17, 1, nn.Upsample, [None, 2, "nearest"]]  # 18 Fused_P5 上采样
  - [[-1, 16], 1, Concat, [1]]                   # 19 汇合 Fused_P4
  - [-1, 2, C3k2, [512, False]]                  # 20

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 21
  - [[-1, 15], 1, Concat, [1]]                   # 22 汇合 Fused_P3
  - [-1, 2, C3k2, [256, False]]                  # 23 (P3/8-small)

  # 自底向上（PAN）
  - [-1, 1, Conv, [256, 3, 2]]                   # 24
  - [[-1, 20], 1, Concat, [1]]                   # 25
  - [-1, 2, C3k2, [512, False]]                  # 26 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                   # 27
  - [[-1, 17], 1, Concat, [1]]                   # 28
  - [-1, 2, C3k2, [1024, True]]                  # 29 (P5/32-large)

  - [[23, 26, 29], 1, Detect, [nc]]              # 30 Detect(P3,P4,P5)
