# Ultralytics YOLOMM 🚀 Mid-Fusion (MHCA via CTF-1L)
# 目的：以最小封装（CTF=1层）触发 MultiHeadCrossAttention 的跨模态交互，并验证其对中层特征的影响
# 说明：直接在 YAML 中调用 MHCA 需要序列形 [B,N,C] 输入和双实参，
#       为避免与现有前向签名/形状约束冲突，此处采用 CTF(1层) 封装方式（内部核心即 MHCA）。

nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # ===== RGB path (0-10) =====
  - [-1, 1, Conv, [64, 3, 2], 'RGB']
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]            # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]     # 4 (RGB_P3)
  - [-1, 1, Conv, [512, 3, 2]]            # 5-P4/16
  - [-1, 2, C3k2, [512, True]]            # 6 (RGB_P4)
  - [-1, 1, Conv, [1024, 3, 2]]           # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]           # 8
  - [-1, 1, SPPF, [1024, 5]]              # 9
  - [-1, 2, C2PSA, [1024]]                # 10 (RGB_P5)

  # ===== X path (11-21) =====
  - [-1, 1, Conv, [64, 3, 2], 'X']
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]            # 14-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]     # 15 (X_P3)
  - [-1, 1, Conv, [512, 3, 2]]            # 16-P4/16
  - [-1, 2, C3k2, [512, True]]            # 17 (X_P4)
  - [-1, 1, Conv, [1024, 3, 2]]           # 18-P5/32
  - [-1, 2, C3k2, [1024, True]]           # 19
  - [-1, 1, SPPF, [1024, 5]]              # 20
  - [-1, 2, C2PSA, [1024]]                # 21 (X_P5)

  # ===== P4: MHCA 交互（通过 CTF-1L 封装） =====
  - [[6, 17], 1, CrossTransformerFusion, [null, 4, 1, 0.0]]  # 22: heads=4, layers=1, dropout=0.0
  - [-1, 1, Conv, [512, 1, 1]]                               # 23: 压回 512 → Fused_P4

  # ===== P5: 基线融合，隔离 P4 变量 =====
  - [[10, 21], 1, FeatureFusion, [null, 2, 4, 8]]            # 24
  - [-1, 2, C3k2, [1024, True]]                              # 25
  - [-1, 1, C2PSA, [1024]]                                   # 26 → Fused_P5

head:
  - [26, 1, nn.Upsample, [None, 2, "nearest"]]  # 27
  - [[-1, 23], 1, Concat, [1]]                  # 28
  - [-1, 2, C3k2, [512, False]]                 # 29

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 30
  - [[-1, 4], 1, Concat, [1]]                   # 31 + RGB_P3(4)
  - [-1, 2, C3k2, [256, False]]                 # 32 (P3/8)

  - [-1, 1, Conv, [256, 3, 2]]                  # 33
  - [[-1, 29], 1, Concat, [1]]                  # 34
  - [-1, 2, C3k2, [512, False]]                 # 35 (P4/16)

  - [-1, 1, Conv, [512, 3, 2]]                  # 36
  - [[-1, 26], 1, Concat, [1]]                  # 37
  - [-1, 2, C3k2, [1024, True]]                 # 38 (P5/32)

  - [[32, 35, 38], 1, Detect, [nc]]             # 39

