# Ultralytics YOLOv10-MM 🚀 Mid Fusion (RGB+X)
# YOLOv10n 多模态中期融合：RGB/X 双分支独立至 P5，P4/P5 层级融合

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]

# 分支书写规范：先连续写完 RGB 分支，再写 X 分支；在显式融合（Concat）之前不交叉引用
backbone:
  # ========== RGB 分支 (0-10) ==========
  # [from, repeats, module, args, input_source]
  - [-1, 1, Conv, [64, 3, 2], 'RGB']   # 0-P1/2 RGB 起点
  - [-1, 1, Conv, [128, 3, 2]]         # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]         # 3-P3/8 (RGB_P3)
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, SCDown, [512, 3, 2]]       # 5-P4/16
  - [-1, 6, C2f, [512, True]]          # 6 (RGB_P4)
  - [-1, 1, SCDown, [1024, 3, 2]]      # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]           # 9
  - [-1, 1, PSA, [1024]]               # 10 (RGB_P5)

  # ========== X 分支 (11-21) ==========
  - [-1, 1, Conv, [64, 3, 2], 'X']     # 11-P1/2 X 起点 (from=-1 + 'X')
  - [-1, 1, Conv, [128, 3, 2]]         # 12-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]         # 14-P3/8 (X_P3)
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, SCDown, [512, 3, 2]]       # 16-P4/16
  - [-1, 6, C2f, [512, True]]          # 17 (X_P4)
  - [-1, 1, SCDown, [1024, 3, 2]]      # 18-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]           # 20
  - [-1, 1, PSA, [1024]]               # 21 (X_P5)

  # ========== 层级融合 ==========
  # P4 级融合
  - [[6, 17], 1, Concat, [1]]          # 22: RGB_P4 (6) + X_P4 (17)
  - [-1, 3, C2f, [1024, True]]         # 23: Fused_P4

  # P5 级融合
  - [[10, 21], 1, Concat, [1]]         # 24: RGB_P5 (10) + X_P5 (21)
  - [-1, 3, C2f, [1024, True]]         # 25
  - [-1, 1, PSA, [1024]]               # 26: Fused_P5

head:
  # 自顶向下 (FPN)
  - [26, 1, nn.Upsample, [None, 2, "nearest"]]  # 27: Fused_P5 上采样
  - [[-1, 23], 1, Concat, [1]]                   # 28: + Fused_P4
  - [-1, 3, C2f, [512]]                          # 29

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 30
  - [[-1, 4], 1, Concat, [1]]                    # 31: + RGB_P3(4)
  - [-1, 3, C2f, [256]]                          # 32 (P3/8-small)

  # 自底向上 (PAN)
  - [-1, 1, Conv, [256, 3, 2]]                   # 33
  - [[-1, 29], 1, Concat, [1]]                   # 34
  - [-1, 3, C2f, [512]]                          # 35 (P4/16-medium)

  - [-1, 1, SCDown, [512, 3, 2]]                 # 36
  - [[-1, 26], 1, Concat, [1]]                   # 37: + Fused_P5
  - [-1, 3, C2fCIB, [1024, True, True]]          # 38 (P5/32-large)

  - [[32, 35, 38], 1, v10Detect, [nc]]           # 39 Detect(P3, P4, P5)

