# Ultralytics YOLOv10-MM 🚀 Early Fusion (RGB+X)
# YOLOv10n 多模态早期融合（Dual=RGB(3)+X(Xch)）

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]

# 早期融合：输入层直接以 Dual(3+Xch) 作为6通道（或 3+Xch）输入
# 第5字段用以标注输入路由（'RGB'|'X'|'Dual'），早期融合仅在起点声明 'Dual'
backbone:
  # [from, repeats, module, args, input_source]
  - [-1, 1, Conv, [64, 3, 2], 'Dual']  # 0-P1/2 Dual(3+Xch) 起点
  - [-1, 1, Conv, [128, 3, 2]]         # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]         # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, SCDown, [512, 3, 2]]       # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, SCDown, [1024, 3, 2]]      # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]           # 9
  - [-1, 1, PSA, [1024]]               # 10

# YOLOv10n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]      # cat backbone P4
  - [-1, 3, C2f, [512]]            # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]      # cat backbone P3
  - [-1, 3, C2f, [256]]            # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]     # cat head P4
  - [-1, 3, C2f, [512]]            # 19 (P4/16-medium)

  - [-1, 1, SCDown, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]     # cat head/backbone P5
  - [-1, 3, C2fCIB, [1024, True, True]]  # 22 (P5/32-large)

  - [[16, 19, 22], 1, v10Detect, [nc]]   # Detect(P3, P4, P5)

