# Ultralytics YOLOv10-MM 🚀 FSCF Style Final Variant

nc: 80
scales:
  n: [0.33, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2], 'RGB']
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, SCDown, [512, 3, 2]]
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, ACA, [512, 0.5]]
  - [-1, 1, FSConv, [1024, 3, 2]]
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 1, PSA, [1024]]

  - [-1, 1, Conv, [64, 3, 2], 'X']
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, SCDown, [512, 3, 2]]
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, ACA, [512, 0.5]]
  - [-1, 1, FSConv, [1024, 3, 2]]
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 1, PSA, [1024]]

  - [[7, 19], 1, Concat, [1]]
  - [-1, 1, MRCB, [1024, [1, 3, 5], 0.5]]

  - [[11, 23], 1, Concat, [1]]
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, PSA, [1024]]

head:
  - [28, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 25], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 31], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]

  - [-1, 1, SCDown, [512, 3, 2]]
  - [[-1, 28], 1, Concat, [1]]
  - [-1, 1, MRCB, [1024, [1, 3, 5], 0.5]]

  - [[34, 37, 40], 1, v10Detect, [nc]]
