# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLOv9c Multi-Modal (RGB + X) with RD injection
# 发行版：v9c 主干，双分支中期融合（P4/P5），在融合处采用 RepNCSPELAND（ELAN+RD 字典注入）
# 说明：
# - 初始两路（RGB、X）分别构建到 P5；
# - 在 P4、P5 两处进行特征级融合（Concat），并在融合后使用 RepNCSPELAND 注入 RD；
# - 后续 Neck/Head 沿 v9c 模板构建，使用标准 Detect 头。

# 参数
nc: 80  # 类别数

# Backbone（RGB 路径 0-9；X 路径 10-19）
backbone:
  # ===== RGB Branch =====
  - [-1, 1, Conv, [64, 3, 2], 'RGB']           # 0-P1/2 RGB
  - [-1, 1, Conv, [128, 3, 2]]                  # 1-P2/4
  - [-1, 1, RepNCSPELAN4, [256, 128, 64, 1]]    # 2
  - [-1, 1, ADown, [256]]                       # 3-P3/8 (RGB_P3)
  - [-1, 1, RepNCSPELAN4, [512, 256, 128, 1]]   # 4
  - [-1, 1, ADown, [512]]                       # 5-P4/16
  - [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]]   # 6 (RGB_P4)
  - [-1, 1, ADown, [512]]                       # 7-P5/32
  - [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]]   # 8
  - [-1, 1, SPPELAN, [512, 256]]                # 9 (RGB_P5, SPP-ELAN)

  # ===== X Branch =====
  - [-1, 1, Conv, [64, 3, 2], 'X']              # 10-P1/2 X
  - [-1, 1, Conv, [128, 3, 2]]                  # 11-P2/4
  - [-1, 1, RepNCSPELAN4, [256, 128, 64, 1]]    # 12
  - [-1, 1, ADown, [256]]                       # 13-P3/8 (X_P3)
  - [-1, 1, RepNCSPELAN4, [512, 256, 128, 1]]   # 14
  - [-1, 1, ADown, [512]]                       # 15-P4/16
  - [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]]   # 16 (X_P4)
  - [-1, 1, ADown, [512]]                       # 17-P5/32
  - [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]]   # 18
  - [-1, 1, SPPELAN, [512, 256]]                # 19 (X_P5, SPP-ELAN)

  # ===== Mid-level Fusion =====
  - [[6, 16], 1, Concat, [1]]                   # 20 Fused_P4: RGB_P4 + X_P4
  - [-1, 1, RepNCSPELAND, [512, 512, 256, 1]]   # 21 RD-injected F4

  - [[9, 19], 1, Concat, [1]]                   # 22 Fused_P5: RGB_P5 + X_P5
  - [-1, 1, RepNCSPELAND, [512, 512, 256, 1]]   # 23 RD-injected F5

# Head（沿 v9c 结构）
head:
  - [23, 1, nn.Upsample, [None, 2, "nearest"]]   # 24 F5 upsample
  - [[-1, 21], 1, Concat, [1]]                    # 25 cat F4
  - [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]]     # 26

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 27
  - [[-1, 4], 1, Concat, [1]]                     # 28 cat RGB_P3(4)
  - [-1, 1, RepNCSPELAN4, [256, 256, 128, 1]]     # 29 (P3/8-small)

  - [-1, 1, ADown, [256]]                         # 30
  - [[-1, 26], 1, Concat, [1]]                    # 31
  - [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]]     # 32 (P4/16-medium)

  - [-1, 1, ADown, [512]]                         # 33
  - [[-1, 23], 1, Concat, [1]]                    # 34
  - [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]]     # 35 (P5/32-large)

  - [[29, 32, 35], 1, Detect, [nc]]               # 36 Detect(P3, P4, P5)

