# Ultralytics YOLOMM - TAB (Token聚合块)
# TAB - Token聚合块 (CVPR 2025)
nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # ========== RGB路径 ==========
  - [-1, 1, Conv, [64, 3, 2], 'RGB']      # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]            # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]     # 2
  - [-1, 1, Conv, [256, 3, 2]]            # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]     # 4
  - [-1, 1, Conv, [512, 3, 2]]            # 5-P4/16
  - [-1, 2, C3k2, [512, True]]            # 6 (RGB_P4)
  - [-1, 1, TAB, []]                      # 7 TAB
  - [-1, 1, Conv, [1024, 3, 2]]           # 8-P5/32
  - [-1, 2, C3k2, [1024, True]]           # 9
  - [-1, 1, SPPF, [1024, 5]]              # 10
  - [-1, 2, C2PSA, [1024]]                # 11 (RGB_P5)

  # ========== X路径 ==========
  - [-1, 1, Conv, [64, 3, 2], 'X']        # 12-P1/2
  - [-1, 1, Conv, [128, 3, 2]]            # 13-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]     # 14
  - [-1, 1, Conv, [256, 3, 2]]            # 15-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]     # 16
  - [-1, 1, Conv, [512, 3, 2]]            # 17-P4/16
  - [-1, 2, C3k2, [512, True]]            # 18 (X_P4)
  - [-1, 1, Conv, [1024, 3, 2]]           # 19-P5/32
  - [-1, 2, C3k2, [1024, True]]           # 20
  - [-1, 1, SPPF, [1024, 5]]              # 21
  - [-1, 2, C2PSA, [1024]]                # 22 (X_P5)

  # ========== P4/P5融合 ==========
  - [[7, 18], 1, Concat, [1]]             # 23 P4融合: ATTN(7) + X_P4(18)
  - [-1, 2, C3k2, [1024, True]]           # 24 (Fused_P4)
  - [[11, 22], 1, Concat, [1]]            # 25 P5融合
  - [-1, 2, C3k2, [1024, True]]           # 26
  - [-1, 1, C2PSA, [1024]]                # 27 (Fused_P5)

head:
  - [27, 1, nn.Upsample, [None, 2, "nearest"]]  # 28
  - [[-1, 24], 1, Concat, [1]]                  # 29
  - [-1, 2, C3k2, [512, False]]                 # 30
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 31
  - [[-1, 4], 1, Concat, [1]]                   # 32
  - [-1, 2, C3k2, [256, False]]                 # 33 (P3/8-small)
  - [-1, 1, Conv, [256, 3, 2]]                  # 34
  - [[-1, 30], 1, Concat, [1]]                  # 35
  - [-1, 2, C3k2, [512, False]]                 # 36 (P4/16-medium)
  - [-1, 1, Conv, [512, 3, 2]]                  # 37
  - [[-1, 27], 1, Concat, [1]]                  # 38
  - [-1, 2, C3k2, [1024, True]]                 # 39 (P5/32-large)
  - [[33, 36, 39], 1, Detect, [nc]]             # 40 Detect(P3, P4, P5)
