# Ultralytics YOLO26MM 🚀 Multi-Modal Mid-Fusion Architecture
# YOLO26MM RGB+X 多模态中期融合范式
# 核心创新: YOLO26特性 (end2end + 简化DFL + SPPF shortcut) + 双路独立骨干 + P4/P5双层融合
# 设计原则: 在多模态架构中集成YOLO26的检测优化，实现高效的端到端训练和推理
# 适用场景: 多模态目标检测，特别是需要端到端优化和快速推理的场景

# Parameters
nc: 80  # number of classes
end2end: True  # YOLO26特性: end-to-end detection (one2many + one2one dual branches)
reg_max: 1  # YOLO26特性: simplified DFL bins (YOLO26 innovation)

scales:  # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# P4/P5双层融合架构 (YOLO26 backbone with multimodal routing)
backbone:
  # ========== RGB路径 (层0-10) - 完整YOLO26骨干到P5 ==========
  - [-1, 1, Conv, [64, 3, 2], 'RGB']      # 0-P1/2 RGB路径起始 (第5字段指定模态)
  - [-1, 1, Conv, [128, 3, 2]]            # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]     # 2
  - [-1, 1, Conv, [256, 3, 2]]            # 3-P3/8 (RGB_P3)
  - [-1, 2, C3k2, [512, False, 0.25]]     # 4
  - [-1, 1, Conv, [512, 3, 2]]            # 5-P4/16
  - [-1, 2, C3k2, [512, True]]            # 6 (RGB_P4)
  - [-1, 1, Conv, [1024, 3, 2]]           # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]           # 8
  - [-1, 1, SPPF, [1024, 5, 3, True]]     # 9 (YOLO26新特性: shortcut=True, c2=c1 for residual)
  - [-1, 2, C2PSA, [1024]]                # 10 (RGB_P5)

  # ========== X路径 (层11-21) - 完整YOLO26骨干到P5 ==========
  - [-1, 1, Conv, [64, 3, 2], 'X']        # 11-P1/2 X路径起始 (第5字段指定模态)
  - [-1, 1, Conv, [128, 3, 2]]            # 12-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]     # 13
  - [-1, 1, Conv, [256, 3, 2]]            # 14-P3/8 (X_P3)
  - [-1, 2, C3k2, [512, False, 0.25]]     # 15
  - [-1, 1, Conv, [512, 3, 2]]            # 16-P4/16
  - [-1, 2, C3k2, [512, True]]            # 17 (X_P4)
  - [-1, 1, Conv, [1024, 3, 2]]           # 18-P5/32
  - [-1, 2, C3k2, [1024, True]]           # 19
  - [-1, 1, SPPF, [1024, 5, 3, True]]     # 20 (YOLO26新特性: shortcut=True)
  - [-1, 2, C2PSA, [1024]]                # 21 (X_P5)

  # ========== P4和P5层级融合 (Multi-Modal Fusion) ==========
  # P4级融合
  - [[6, 17], 1, Concat, [1]]             # 22 P4融合: RGB_P4(6) + X_P4(17)
  - [-1, 2, C3k2, [1024, True]]           # 23 (Fused_P4)

  # P5级融合
  - [[10, 21], 1, Concat, [1]]            # 24 P5融合: RGB_P5(10) + X_P5(21)
  - [-1, 2, C3k2, [1024, True]]           # 25
  - [-1, 1, C2PSA, [1024]]                # 26 (Fused_P5)

# YOLO26检测头 (Neck + v26Detect head)
head:
  # 自顶向下路径 (FPN)
  - [26, 1, nn.Upsample, [None, 2, "nearest"]]  # 27 Fused_P5上采样
  - [[-1, 23], 1, Concat, [1]]                  # 28 连接Fused_P4
  - [-1, 2, C3k2, [512, True]]                  # 29

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 30
  - [[-1, 4], 1, Concat, [1]]                   # 31 连接RGB_P3(4)
  - [-1, 2, C3k2, [256, True]]                  # 32 (P3/8-small)

  # 自底向上路径 (PAN)
  - [-1, 1, Conv, [256, 3, 2]]                  # 33
  - [[-1, 29], 1, Concat, [1]]                  # 34
  - [-1, 2, C3k2, [512, True]]                  # 35 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                  # 36
  - [[-1, 26], 1, Concat, [1]]                  # 37
  - [-1, 1, C3k2, [1024, True, 0.5]]            # 38 (P5/32-large)

  - [[32, 35, 38], 1, v26Detect, [nc]]          # 39 v26Detect(P3, P4, P5) with end2end + reg_max=1
