# Ultralytics YOLO26MM AGPL-3.0 License
# YOLO26MM RGB+X 多模态中期融合 - Segment26分割头
# 核心: YOLO26特性 + 双路骨干 + P4/P5融合 + Proto26多尺度分割

# Parameters
nc: 80
end2end: True
reg_max: 1

scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # ========== RGB路径 (层0-10) ==========
  - [-1, 1, Conv, [64, 3, 2], 'RGB']      # 0
  - [-1, 1, Conv, [128, 3, 2]]            # 1
  - [-1, 2, C3k2, [256, False, 0.25]]     # 2
  - [-1, 1, Conv, [256, 3, 2]]            # 3
  - [-1, 2, C3k2, [512, False, 0.25]]     # 4
  - [-1, 1, Conv, [512, 3, 2]]            # 5
  - [-1, 2, C3k2, [512, True]]            # 6 (RGB_P4)
  - [-1, 1, Conv, [1024, 3, 2]]           # 7
  - [-1, 2, C3k2, [1024, True]]           # 8
  - [-1, 1, SPPF, [1024, 5, 3, True]]     # 9
  - [-1, 2, C2PSA, [1024]]                # 10 (RGB_P5)

  # ========== X路径 (层11-21) ==========
  - [-1, 1, Conv, [64, 3, 2], 'X']        # 11
  - [-1, 1, Conv, [128, 3, 2]]            # 12
  - [-1, 2, C3k2, [256, False, 0.25]]     # 13
  - [-1, 1, Conv, [256, 3, 2]]            # 14
  - [-1, 2, C3k2, [512, False, 0.25]]     # 15
  - [-1, 1, Conv, [512, 3, 2]]            # 16
  - [-1, 2, C3k2, [512, True]]            # 17 (X_P4)
  - [-1, 1, Conv, [1024, 3, 2]]           # 18
  - [-1, 2, C3k2, [1024, True]]           # 19
  - [-1, 1, SPPF, [1024, 5, 3, True]]     # 20
  - [-1, 2, C2PSA, [1024]]                # 21 (X_P5)

  # ========== P4/P5融合 ==========
  - [[6, 17], 1, Concat, [1]]             # 22
  - [-1, 2, C3k2, [1024, True]]           # 23 (Fused_P4)
  - [[10, 21], 1, Concat, [1]]            # 24
  - [-1, 2, C3k2, [1024, True]]           # 25
  - [-1, 1, C2PSA, [1024]]                # 26 (Fused_P5)

head:
  - [26, 1, nn.Upsample, [None, 2, "nearest"]]  # 27
  - [[-1, 23], 1, Concat, [1]]                  # 28
  - [-1, 2, C3k2, [512, True]]                  # 29

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 30
  - [[-1, 4], 1, Concat, [1]]                   # 31
  - [-1, 2, C3k2, [256, True]]                  # 32 (P3)

  - [-1, 1, Conv, [256, 3, 2]]                  # 33
  - [[-1, 29], 1, Concat, [1]]                  # 34
  - [-1, 2, C3k2, [512, True]]                  # 35 (P4)

  - [-1, 1, Conv, [512, 3, 2]]                  # 36
  - [[-1, 26], 1, Concat, [1]]                  # 37
  - [-1, 1, C3k2, [1024, True, 0.5]]            # 38 (P5)

  - [[32, 35, 38], 1, Segment26, [nc, 32, 256]] # 39
