# Ultralytics YOLO26MM MultiModal Late Fusion Configuration
# YOLO26MM RGB+X 晚期融合 + v26Detect 头
# 核心策略: 双路独立骨干 + 各自独立 FPN+PAN → P3/P4/P5 三层 Concat 融合 → 统一检测
# YOLO26 特性: end2end + reg_max=1 + SPPF shortcut
# 适用场景: RGB和X模态特征差异大，需要完全独立的特征提取和检测路径

# Parameters
nc: 80  # number of classes
end2end: True  # YOLO26特性: end-to-end detection
reg_max: 1  # YOLO26特性: simplified DFL bins

scales:  # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# 双路径 backbone - RGB路径和X路径完全独立
backbone:
  # ========== RGB路径 (层0-10) - 完整YOLO26骨干到P5 ==========
  - [-1, 1, Conv, [64, 3, 2], 'RGB']       # 0-P1/2 RGB路径起始
  - [-1, 1, Conv, [128, 3, 2]]             # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]      # 2
  - [-1, 1, Conv, [256, 3, 2]]             # 3-P3/8 (RGB_P3)
  - [-1, 2, C3k2, [512, False, 0.25]]      # 4
  - [-1, 1, Conv, [512, 3, 2]]             # 5-P4/16
  - [-1, 2, C3k2, [512, True]]             # 6 (RGB_P4)
  - [-1, 1, Conv, [1024, 3, 2]]            # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]            # 8
  - [-1, 1, SPPF, [1024, 5, 3, True]]      # 9 (YOLO26: shortcut=True)
  - [-1, 2, C2PSA, [1024]]                 # 10 (RGB_P5)

  # ========== X路径 (层11-21) - 完整YOLO26骨干到P5 ==========
  - [-1, 1, Conv, [64, 3, 2], 'X']         # 11-P1/2 X路径起始
  - [-1, 1, Conv, [128, 3, 2]]             # 12-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]      # 13
  - [-1, 1, Conv, [256, 3, 2]]             # 14-P3/8 (X_P3)
  - [-1, 2, C3k2, [512, False, 0.25]]      # 15
  - [-1, 1, Conv, [512, 3, 2]]             # 16-P4/16
  - [-1, 2, C3k2, [512, True]]             # 17 (X_P4)
  - [-1, 1, Conv, [1024, 3, 2]]            # 18-P5/32
  - [-1, 2, C3k2, [1024, True]]            # 19
  - [-1, 1, SPPF, [1024, 5, 3, True]]      # 20 (YOLO26: shortcut=True)
  - [-1, 2, C2PSA, [1024]]                 # 21 (X_P5)

# 独立检测头 - RGB和X模态各自独立FPN+PAN，最后融合决策
head:
  # ========== RGB检测分支 (层22-33) ==========
  - [10, 1, nn.Upsample, [None, 2, "nearest"]]   # 22 从RGB backbone P5
  - [[-1, 6], 1, Concat, [1]]                    # 23 cat RGB backbone P4
  - [-1, 2, C3k2, [512, True]]                   # 24

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 25
  - [[-1, 4], 1, Concat, [1]]                    # 26 cat RGB backbone P3
  - [-1, 2, C3k2, [256, True]]                   # 27 (RGB P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]                   # 28
  - [[-1, 24], 1, Concat, [1]]                   # 29 cat RGB head P4
  - [-1, 2, C3k2, [512, True]]                   # 30 (RGB P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                   # 31
  - [[-1, 10], 1, Concat, [1]]                   # 32 cat RGB backbone P5
  - [-1, 1, C3k2, [1024, True, 0.5]]             # 33 (RGB P5/32-large)

  # ========== X模态检测分支 (层34-45) ==========
  - [21, 1, nn.Upsample, [None, 2, "nearest"]]   # 34 从X backbone P5
  - [[-1, 17], 1, Concat, [1]]                   # 35 cat X backbone P4
  - [-1, 2, C3k2, [512, True]]                   # 36

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 37
  - [[-1, 15], 1, Concat, [1]]                   # 38 cat X backbone P3
  - [-1, 2, C3k2, [256, True]]                   # 39 (X P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]                   # 40
  - [[-1, 36], 1, Concat, [1]]                   # 41 cat X head P4
  - [-1, 2, C3k2, [512, True]]                   # 42 (X P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                   # 43
  - [[-1, 21], 1, Concat, [1]]                   # 44 cat X backbone P5
  - [-1, 1, C3k2, [1024, True, 0.5]]             # 45 (X P5/32-large)

  # ========== 多模态融合 + 检测 ==========
  - [[27, 39], 1, Concat, [1]]                   # 46 融合P3
  - [[30, 42], 1, Concat, [1]]                   # 47 融合P4
  - [[33, 45], 1, Concat, [1]]                   # 48 融合P5
  - [[46, 47, 48], 1, v26Detect, [nc]]           # 49 v26Detect(P3, P4, P5) with end2end + reg_max=1
