# Ultralytics YOLOv5-MM 🚀 Mid Fusion (RGB+X)
# YOLOv5 多模态中期融合：RGB/X 双分支至 P5，P4/P5 级联融合

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 1024]
  l: [1.00, 1.00, 1024]
  x: [1.33, 1.25, 1024]

# 分支书写规范：先连续 RGB，再连续 X；融合前不交叉引用；X 分支起点使用 from=-1 + 'X'
backbone:
  # ========== RGB 分支 (0-9) ==========
  # [from, number, module, args, input_source]
  - [-1, 1, Conv, [64, 6, 2, 2], 'RGB'] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]           # 1-P2/4
  - [-1, 3, C3, [128]]
  - [-1, 1, Conv, [256, 3, 2]]           # 3-P3/8 (RGB_P3)
  - [-1, 6, C3, [256]]
  - [-1, 1, Conv, [512, 3, 2]]           # 5-P4/16
  - [-1, 9, C3, [512]]                   # 6 (RGB_P4)
  - [-1, 1, Conv, [1024, 3, 2]]          # 7-P5/32
  - [-1, 3, C3, [1024]]
  - [-1, 1, SPPF, [1024, 5]]             # 9 (RGB_P5)

  # ========== X 分支 (10-19) ==========
  - [-1, 1, Conv, [64, 6, 2, 2], 'X']    # 10-P1/2 (from=-1 + 'X')
  - [-1, 1, Conv, [128, 3, 2]]           # 11-P2/4
  - [-1, 3, C3, [128]]
  - [-1, 1, Conv, [256, 3, 2]]           # 13-P3/8 (X_P3)
  - [-1, 6, C3, [256]]
  - [-1, 1, Conv, [512, 3, 2]]           # 15-P4/16
  - [-1, 9, C3, [512]]                   # 16 (X_P4)
  - [-1, 1, Conv, [1024, 3, 2]]          # 17-P5/32
  - [-1, 3, C3, [1024]]
  - [-1, 1, SPPF, [1024, 5]]             # 19 (X_P5)

  # ========== 层级融合 ==========
  # P4 融合
  - [[6, 16], 1, Concat, [1]]            # 20: RGB_P4 + X_P4
  - [-1, 3, C3, [1024, True]]            # 21: Fused_P4

  # P5 融合
  - [[9, 19], 1, Concat, [1]]            # 22: RGB_P5 + X_P5
  - [-1, 3, C3, [1024, True]]            # 23
  - [-1, 1, SPPF, [1024, 5]]             # 24: Fused_P5 (加深语义)

head:
  - [24, 1, Conv, [512, 1, 1]]           # 25: 减半通道
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 21], 1, Concat, [1]]           # 27: + Fused_P4
  - [-1, 3, C3, [512, False]]            # 28

  - [-1, 1, Conv, [256, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]            # 31: + RGB_P3(4)
  - [-1, 3, C3, [256, False]]            # 32 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 28], 1, Concat, [1]]           # 34
  - [-1, 3, C3, [512, False]]            # 35 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 25], 1, Concat, [1]]           # 37: + Fused_P5 减半前特征
  - [-1, 3, C3, [1024, False]]           # 38 (P5/32-large)

  - [[32, 35, 38], 1, Detect, [nc]]      # 39 Detect(P3, P4, P5)

