# Ultralytics YOLOMM 自定义上采样模块配置
# 设计思路: 使用 DySample（动态采样上采样）替换标准 nn.Upsample 最近邻上采样
# DySample 通过学习采样偏移量实现动态上采样，能更好地保留空间结构信息
# 核心替换: nn.Upsample [None, 2, "nearest"] → DySample []（2x上采样，参数自动填充）
# DySample(in_channels, scale=2, style='lp', groups=4) -- scale默认2，无需显式指定
# 注意: 上采样模块 c2=ch[f]（通道数不变），YAML 中 args 留空即可

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# 标准中期融合骨干网（下采样保持标准 Conv）
backbone:
  # ========== RGB路径 (层0-10) - 完整骨干网到P5 ==========
  - [-1, 1, Conv, [64, 3, 2], 'RGB']      # 0-P1/2 RGB路径起始
  - [-1, 1, Conv, [128, 3, 2]]            # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]     # 2
  - [-1, 1, Conv, [256, 3, 2]]            # 3-P3/8 (RGB_P3)
  - [-1, 2, C3k2, [512, False, 0.25]]     # 4
  - [-1, 1, Conv, [512, 3, 2]]            # 5-P4/16
  - [-1, 2, C3k2, [512, True]]            # 6 (RGB_P4)
  - [-1, 1, Conv, [1024, 3, 2]]           # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]           # 8
  - [-1, 1, SPPF, [1024, 5]]              # 9
  - [-1, 2, C2PSA, [1024]]                # 10 (RGB_P5)

  # ========== X路径 (层11-21) - 完整骨干网到P5 ==========
  - [-1, 1, Conv, [64, 3, 2], 'X']        # 11-P1/2 X路径起始
  - [-1, 1, Conv, [128, 3, 2]]            # 12-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]     # 13
  - [-1, 1, Conv, [256, 3, 2]]            # 14-P3/8 (X_P3)
  - [-1, 2, C3k2, [512, False, 0.25]]     # 15
  - [-1, 1, Conv, [512, 3, 2]]            # 16-P4/16
  - [-1, 2, C3k2, [512, True]]            # 17 (X_P4)
  - [-1, 1, Conv, [1024, 3, 2]]           # 18-P5/32
  - [-1, 2, C3k2, [1024, True]]           # 19
  - [-1, 1, SPPF, [1024, 5]]              # 20
  - [-1, 2, C2PSA, [1024]]                # 21 (X_P5)

  # ========== P4和P5层级融合 ==========
  # P4级融合
  - [[6, 17], 1, Concat, [1]]             # 22 P4融合: RGB_P4(6) + X_P4(17)
  - [-1, 2, C3k2, [1024, True]]           # 23 (Fused_P4)

  # P5级融合
  - [[10, 21], 1, Concat, [1]]            # 24 P5融合: RGB_P5(10) + X_P5(21)
  - [-1, 2, C3k2, [1024, True]]           # 25
  - [-1, 1, C2PSA, [1024]]                # 26 (Fused_P5)

# DySample 上采样检测头 (Neck + Head)
head:
  # 自顶向下路径 (FPN) -- 使用 DySample 替换 nn.Upsample
  - [26, 1, DySample, []]                       # 27 Fused_P5 DySample上采样 (c2自动填充=1024)
  - [[-1, 23], 1, Concat, [1]]                  # 28 连接Fused_P4
  - [-1, 2, C3k2, [512, False]]                 # 29

  - [-1, 1, DySample, []]                       # 30 DySample上采样 (c2自动填充=512)
  - [[-1, 4], 1, Concat, [1]]                   # 31 连接RGB_P3(4)
  - [-1, 2, C3k2, [256, False]]                 # 32 (P3/8-small)

  # 自底向下路径 (PAN)
  - [-1, 1, Conv, [256, 3, 2]]                  # 33
  - [[-1, 29], 1, Concat, [1]]                  # 34
  - [-1, 2, C3k2, [512, False]]                 # 35 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                  # 36
  - [[-1, 26], 1, Concat, [1]]                  # 37
  - [-1, 2, C3k2, [1024, True]]                 # 38 (P5/32-large)

  - [[32, 35, 38], 1, Detect, [nc]]             # 39 Detect(P3, P4, P5)
